{"legislative_session": "20252026", "identifier": "AB1566", "title": "Crimes: mandated reporters: severe neglect.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Crimes", "mandatedreporters", "severeneglect"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Child Abuse and Neglect Reporting Act, makes certain persons, including teachers and social workers, mandated reporters. Under existing law, mandated reporters are required to report whenever the mandated reporter, in their professional capacity or within the scope of their employment, has knowledge of or observes a child whom the mandated reporter knows or reasonably suspects has been the victim of child abuse or neglect. Failure by a mandated reporter to report an incident of known or reasonably suspected child abuse or neglect is a misdemeanor. Existing law, for the purposes of the act, defines \"severe neglect\" as the negligent failure of a person having the care or custody of a child to protect the child from severe malnutrition or medically diagnosed nonorganic failure to thrive, as well as those situations of neglect where any person having the care or custody of a child willfully causes or permits the person or health of the child to be placed in a situation such that their person or health is endangered as proscribed by specified law, including the intentional failure to provide adequate food, clothing, shelter, or medical care.\n\nUnder existing law, prosecution of a misdemeanor must generally be commenced within one year of the commission of the offense, unless otherwise specified. Under existing law, if a mandated reporter intentionally conceals their failure to report an incident known by the mandated reporter to be abuse or severe neglect, it is a continuing offense until discovered by the appropriate law enforcement agency and may be prosecuted within one year of the discovery of the offense, but not later than 4 years after the commission of the offense.\n\nThis bill would recast the definition of \"severe neglect\" for the purposes described above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 12.", "date": "2026-01-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Jackson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Jackson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1566", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1566", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1566&version=20250AB156699INT", "media_type": "application/pdf"}], "date": "2026-01-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1566", "note": ""}], "extras": {"impact_clause": "An act to amend Section 11165.2 of the Penal Code, relating to crimes.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-19T08:48:41+00:00", "_id": "a7e28932-f513-11f0-a4ab-4637a27ff409"}