{"legislative_session": "20252026", "identifier": "AB1837", "title": "Video imaging of parking violations.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Videoimagingofparkingviolations"], "abstracts": [{"note": "summary", "abstract": "Existing law authorizes a public transit operator in the state, until January 1, 2027, and authorizes the City and County of San Francisco indefinitely, to enforce parking violations in specified transit-only traffic lanes and at transit stops through the use of video imaging, and to install automated forward facing parking control devices on city-owned public transit vehicles for the purpose of video imaging parking violations occurring in transit-only traffic lanes, as specified. Existing law requires a public transit operator, prior to issuing notices of parking violations, to issue warning notices for the first 60 days and to make a public announcement of the program. Existing law requires a designated employee, or a contracted law enforcement agency, to review video image recordings for the purpose of determining whether a parking violation occurred in a transit-only traffic lane or at a transit stop and to issue a notice of violation to the registered owner of a vehicle within 15 calendar days, as specified. Existing law makes these video image records confidential and provides that these records are available only to public agencies to enforce parking violations. Existing law requires a public transit operator that implements an automated enforcement system to enforce parking violations in transit-only traffic lanes and at transit stops to submit a report to specified committees of the Legislature by no later than January 1, 2025.\n\nThis bill would extend the authorization for the use of video imaging to enforce parking and stopping violations indefinitely and would expand the types of violations to include stopping or parking on the roadway side of a vehicle stopped, parked, or standing, as specified, or unlawfully stopping or parking in a bikeway. The bill would require that a public transit operator issue warnings for 60 days prior to issuing notices of violations when it uses video imaging for enforcement of a violation that it has not previously used video imaging to enforce. The bill would require that a public transit operator that used video imaging to enforce parking violations who has not had a system in operation at any time prior to January 1, 2027, to report to the Legislature until January 1, 2031, as specified.\n\nExisting constitutional provisions require that a statute that limits the right of access to the meetings of public bodies or the writings of public officials and agencies be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\nThis bill would make legislative findings to that effect."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 14.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Hoover", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Hoover\"}", "organization_id": null}, {"name": "Mark González", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Mark Gonz\\u00e1lez\"}", "organization_id": null}, {"name": "Nguyen", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Nguyen\"}", "organization_id": null}, {"name": "Arreguín", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Arregu\\u00edn\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1837", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1837", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/11/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1837&version=20250AB183799INT", "media_type": "application/pdf"}], "date": "2026-02-11", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1837", "note": ""}], "extras": {"impact_clause": "An act to amend Section 40240.5 of, and to amend and repeal Sections 40240 and 40241 of, the Vehicle Code, relating to parking violations.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-16T09:02:18+00:00", "_id": "32383ad8-0b16-11f1-8107-d26818b831da"}