{"legislative_session": "20252026", "identifier": "SB1349", "title": "Taxation: tax expenditures: California Tax Expenditure Review Board.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["CaliforniaTaxExpenditureReviewBoard", "Taxation", "taxexpenditures"], "abstracts": [{"note": "summary", "abstract": "Existing law, including, but not limited to, property tax law, the Sales and Use Tax Law, the Personal Income Tax Law, the Corporation Tax Law, the Motor Vehicle Fuel Tax Law, the law governing the taxation of insurers, the Use Fuel Tax Law, and the Diesel Fuel Tax Law, provides for tax expenditures, including exemptions, deductions, exclusions, and credits against the taxes imposed by those laws. \n\nThis bill would establish in state government the California Tax Expenditure Review Board as an independent advisory body to comprehensively assess major tax expenditures, as defined, and make recommendations to the Legislature. The bill would require the board to be composed of 5 members, as specified, who would serve without compensation.\n\nThe bill would require the board, by October 1, 2027, to hold an open and public meeting to consider information provided by the public for the purpose of determining the schedule for comprehensive assessments of major tax expenditures to be conducted by the Legislative Analyst's Office (LAO) , as specified. The bill would require the board, by January 1, 2028, to meet to finalize the schedule for comprehensive assessments of major tax expenditures, and require them to consider certain criteria when finalizing the schedule, including the impact on the General Fund.\n\nThe bill would require the board to set a deadline date as part of determining the schedule for LAO to complete its comprehensive assessments of major tax expenditures, as specified. The bill would require LAO to complete its comprehensive assessments of major tax expenditures and provide them to the board by the deadline date specified in the schedule.\n\nThe bill would require the board to determine the scope of each comprehensive assessment, which would include certain specified information, including a brief description of the beneficiaries of the tax expenditure, as specified, and would require the board to post a comprehensive assessment on its internet website after receipt. The bill would require the board to make recommendations to the Legislature regarding the major tax expenditures, and to provide a report to the Legislature that compiles all of its recommendations regarding those tax expenditures, after a vote of the members of the board, by January 1, 2029, as specified. The bill would also require the board to submit the report to the Senate Committee on Budget and Fiscal Review, the Senate Committee on Governance and Finance, the Assembly Committee on Budget, and the Assembly Committee on Revenue and Taxation, and post it on its internet website. The bill would require the Senate Committee on Governance and Finance and the Assembly Committee on Revenue and Taxation, after receipt of the report by the Legislature, to hold a joint public hearing on the report by August 15 of the second year of the legislative session.\n\nThe bill would make these provisions inoperative 6 months after the hearing described above, and repeal them the following January. The bill would make findings and declarations relating to these provisions."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Gonzalez", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Gonzalez\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1349", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1349", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1349&version=20250SB134999INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1349", "note": ""}], "extras": {"impact_clause": "An act to add and repeal Sections 42 and 43 of the Revenue and Taxation Code, relating to taxation.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:05+00:00", "_id": "ecd6b014-0fca-11f1-9ce2-72e66fa16e68"}