{"legislative_session": "20252026", "identifier": "AB2011", "title": "Nonquantitative treatment limitations.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Nonquantitativetreatmentlimitations"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Knox-Keene Health Care Service Plan Act of 1975, provides for the licensure and regulation of health care service plans by the Department of Managed Health Care and makes a willful violation of the act a crime. Existing law also provides for the regulation of health insurers by the Department of Insurance.\n\nExisting federal law, the federal Paul Wellstone and Pete Domenici Mental Health Parity and Addiction Equity Act of 2008 (MHPAEA) , requires group health plans and health insurance issuers that provide both medical and surgical benefits and mental health or substance use disorder benefits to ensure that financial requirements and treatment limitations applicable to mental health or substance use disorder benefits are no more restrictive than the predominant requirements or limitations applied to substantially all medical and surgical benefits. Existing state law requires every health care service plan and disability insurance policy issued, amended, or renewed on or after January 1, 2021, that provides hospital, medical, or surgical coverage to provide coverage for medically necessary treatment of mental health and substance use disorders under the same terms and conditions applied to other medical conditions, as specified.\n\nThis bill would prohibit a health care service plan or insurer from relying upon discriminatory factors or evidentiary standards to design a nonquantitative treatment limitation (NQTL) to be imposed on mental health or substance use disorder benefits, as specified. To ensure that an NQTL applicable to mental health or substance use disorder benefits in a classification is no more restrictive than the predominant NQTL applied to substantially all medical/surgical benefits in the classification, the bill would require a health care service plan or insurer to collect and evaluate relevant data to assess the impact of the NQTL on outcomes related to access to mental health and substance use disorder benefits and medical/surgical benefits. The bill would require specified health care service plans or insurers to perform and document comparative analyses of the design and application of each NQTL applicable to mental health or substance use disorder benefits in accordance with prescribed requirements and submit the analyses to the respective departments by January 1, 2027, and annually thereafter. If the departments make a final determination of noncompliance, the bill would require the health care service plan or insurer to, among other things, notify all enrollees or insureds of its noncompliance with the requirements of parity. If a health care service plan or insurer receives a final determination of noncompliance with these provisions with respect to an NQTL or with the requirements of the MHPAEA, the bill would deem the NQTL to be a violation of parity and authorize the respective department to direct the plan or insurer not to impose the NQTL, as provided. The bill would define terms for purposes of these provisions and make related findings and declarations. Because a violation of these requirements by a health care service plan would be a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-17", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 20.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Hart", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Hart\"}", "organization_id": null}, {"name": "Wiener", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Wiener\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2011", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2011", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/17/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2011&version=20250AB201199INT", "media_type": "application/pdf"}], "date": "2026-02-17", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2011", "note": ""}], "extras": {"impact_clause": "An act to add Section 1374.77 to the Health and Safety Code, and to add Section 10144.43 to the Insurance Code, relating to health care coverage.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:27+00:00", "_id": "1d8d9bd2-0fcb-11f1-9ce2-72e66fa16e68"}