{"legislative_session": "20252026", "identifier": "AB2428", "title": "Criminal fees.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Criminalfees"], "abstracts": [{"note": "summary", "abstract": "Existing law imposes various fees, contingent upon a criminal arrest, prosecution, or conviction, for the cost of administering the criminal justice system, including traffic violator school fees, costs for when a minor is adjudged a ward of the court, as specified, or costs incurred by a state or local agency for the disposal of various substances if the person is a manufacturer of a controlled substance, as specified.\n\nThis bill would repeal the authority to collect many of those fees, among others. The bill would make the unpaid balance of most court-imposed costs unenforceable and uncollectible and would require any portion of a judgment imposed by those costs to be vacated. The bill would relieve a person who is sentenced to state prison or confined in a county jail from being required to pay any trial court filing fees or costs related to the person's underlying criminal conviction.\n\nExisting law requires, among others, the state and certain cities, to accept personal checks in addition to any other authorized form of payment drawn, as specified, for the payment of certain obligations if the person issuing the check meets specified conditions.\n\nThis bill would authorize those entities to accept personal checks, in addition to any other authorized form of payment, as payment for court-ordered debt relating to a criminal proceeding without regard to those conditions. The bill would prohibit a public entity from imposing a charge to recover processing and collection costs for returned checks for court-ordered debt relating to a criminal proceeding.\n\nThe bill would make related findings and declarations.\n\nThe bill would also make various conforming changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Celeste Rodriguez", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Celeste Rodriguez\"}", "organization_id": null}, {"name": "Rogers", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Rogers\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2428", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2428", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2428&version=20250AB242899INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2428", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 6157 and 71386 of, and to repeal and add Section 68635 of, the Government Code, to amend Section 11374.5 of, to add Section 11470.5 to, and to repeal Section 11470.2 of, the Health and Safety Code, to amend Sections 597.3, 1203.1a, 1203.1i, 1205.3, 1209.5, 4011.1, and 4018.6 of, and to add Section 1210.2 to, the Penal Code, to amend Sections 42007 and 42008.8 of the Vehicle Code, and to repeal Section 730.5 of the Welfare and Institutions Code, relating to fees.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:37+00:00", "_id": "236a0018-0fcb-11f1-9ce2-72e66fa16e68"}