{"legislative_session": "20252026", "identifier": "SB1400", "title": "Alameda Health System: hospital authority.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["AlamedaHealthSystem", "hospitalauthority"], "abstracts": [{"note": "summary", "abstract": "Existing law authorizes the Board of Supervisors of the County of Alameda to establish a hospital authority for the purpose of effecting a transfer of the management, administration, and control of the Alameda Health System. Existing law requires the hospital authority to be governed by a board that is appointed, both initially and continually, by the board of supervisors. Existing law requires the enabling ordinance to specify the membership of the hospital authority governing board, the qualifications for individual members, the manner of appointment, selection, or removal of governing board members, their terms of office, and all other matters that the board of supervisors deems necessary or convenient for the conduct of the hospital authority's activities. Existing law specifies that a hospital authority established pursuant to these provisions, but that does not obtain the administration, management, and control of the medical center or has those duties and responsibilities revoked by the board of supervisors, is not empowered with the powers provided to an independent hospital authority, as specified.\n\nThis bill would require the enabling ordinance to authorize the membership of the governing board to include, with the approval of the board of supervisors, a representative of any local public entity that contributes financial or other support to the hospital authority, as specified. The bill would authorize, at the board of supervisors' discretion and as specified in the enabling ordinance, the governing board to consist entirely of members of the board of supervisors or to include any number of the members of the board of supervisors or county officers or employees appointed to represent the interests of the county. The bill would prohibit the inclusion of members of the board of supervisors or county employees on the governing board from being a basis to determine that the hospital authority is not an independent entity or that the hospital authority has not obtained the administration, management, and control of the medical center.\n\nThis bill would also authorize the governing board to delegate day-to-day operational responsibilities to one or more subsidiary bodies it establishes, consisting of members possessing relevant expertise, and requires that delegation to involve reasonable safeguards to ensure that the governing board retains ultimate control over the hospital authority. The bill would authorize the hospital authority to affiliate with, or acquire ownership or control of, additional public or private hospitals, clinics, or programs to further its mission, at the discretion of the governing board."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Arreguín", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Arregu\\u00edn\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1400", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1400", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1400&version=20250SB140099INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1400", "note": ""}], "extras": {"impact_clause": "An act to amend Section 101850 of the Health and Safety Code, relating to health authorities.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:44:00+00:00", "_id": "77a97106-0f01-11f1-bd68-62084ebb1ff2"}