{"legislative_session": "20252026", "identifier": "AB2270", "title": "Low-income housing tax credit: farmworker housing.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Low-incomehousingtaxcredit", "farmworkerhousing"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes a low-income housing tax credit program for which the California Tax Credit Allocation Committee (CTCAC) provides procedures and requirements for the allocation, in modified conformity with federal law, of state insurance, personal income, and corporation tax credit amounts to qualified low-income housing projects that have been allocated, or qualify for, a federal low-income housing tax credit, and farmworker housing. Existing law limits the total annual amount of the state low-income housing credit for which a federal low-income housing credit is required to the sum of $70,000,000, as increased by any percentage increase in the Consumer Price Index for the preceding calendar year, any unused credit for the preceding calendar years, and the amount of housing credit ceiling returned in the calendar year. Existing law governing the taxation of insurers, the Personal Income Tax Law, and the Corporation Tax Law provided an allocation of $500,000,000 for the 2020 calendar year and, for calendar years beginning in 2021, also provides for an additional amount that may be allocated, up to $500,000,000, to specified low-income housing projects that are new buildings that are federally subsidized, as specified. Existing law provides that this additional amount is only available for allocation pursuant to an authorization in the annual Budget Act. Existing law requires specified regulatory action by CTCAC aimed at increasing production and containing costs, including a scoring system that maximizes the efficient use of public subsidy and benefit created through the low-income housing tax credit program, as specified.\n\nThis bill would require CTCAC to amend the regulatory scoring system to treat farmworker housing projects as large family projects, as specified in the existing CTCAC regulation. The bill would also require the CTCAC to use the same point allocations provided for rural set-aside projects in assigning points to farmworker housing based on the proximity of amenities to an eligible farmworker housing project.\n\nThis bill would include a change in state statute that would result in a taxpayer paying a higher tax within the meaning of Section 3 of Article XIIIA of the California Constitution, and thus would require for passage the approval of 23 of the membership of each house of the Legislature.\n\nThis bill would take effect immediately as a tax levy."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Arambula", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Arambula\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2270", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2270", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2270&version=20250AB227099INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2270", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 12206, 17058, and 23610.5 of the Revenue and Taxation Code, relating to taxation, to take effect immediately, tax levy.", "tags": ["fiscal committee", "urgency", "tax levy"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:15+00:00", "_id": "a4b6289c-0f01-11f1-bd68-62084ebb1ff2"}