{"legislative_session": "20252026", "identifier": "AB2190", "title": "Internet website accessibility.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Internetwebsiteaccessibility"], "abstracts": [{"note": "summary", "abstract": "The Unruh Civil Rights Act requires persons within the jurisdiction of the state to be free and equal and, regardless of the person's sex, race, color, religion, ancestry, national origin, disability, medical condition, genetic information, marital status, sexual orientation, citizenship, primary language, or immigration status to be entitled to the full and equal accommodations, advantages, facilities, privileges, or services in all business establishments, as prescribed, and makes a violation of the federal Americans with Disabilities Act of 1990 (ADA) a violation of the act.\n\nExisting law imposes liability upon a person who denies, aids, or incites a denial of, or makes any discrimination or distinction contrary to, rights afforded by law for actual damages suffered, exemplary damages, a civil penalty, and attorney's fees, as specified, to any person who was denied the specified rights. Existing law also imposes liability upon a person, firm, or corporation that denies or interferes with admittance to, or enjoyment of, public facilities or otherwise interferes with the rights of an individual with a disability, as specified, for damages and attorney's fees to a person who was denied those rights.\n\nThis bill would grant to an entity an affirmative defense to a claim seeking statutory damages under the provisions described above on the basis of a specific accessibility barrier on the entity's internet website, as defined, if the entity provided evidence to the plaintiff demonstrating within an unspecified number of days of receiving a written pre-lawsuit demand from the plaintiff that either (1) the entity published a digital accessibility report on the accessibility page of its internet website disclosing the specific access barrier and updated that report to reflect remediation of the access barrier or (2) that various things were true regarding the entity's efforts to identify and remediate access barriers on its internet website, including the entity had a reasonable and good faith basis to believe that the internet website was accessible and conformed with the internet website accessibility standard, as specified.\n\nThis bill would also prohibit a resource service provider from, in exchange for money or any other form of remuneration, negligently, recklessly, or knowingly construct, license, distribute, or maintain for online use a resource or part of an internet website that causes an entity's internet website to be inaccessible or not conformant with the internet accessibility standard if the resource or part of the internet website is within the control of the resource service provider to remediate or from making a false representation that a resource or part of an internet website is accessible or conforms to the internet accessibility standard. The bill would authorize a small business entity, as defined, and certain public attorneys, including the Attorney General, to bring a civil action to enforce that provision, as specified."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Wallis", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Wallis\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2190", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2190", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2190&version=20250AB219099INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2190", "note": ""}], "extras": {"impact_clause": "An act to add Part 2.54 (commencing with Section 55.58.1) to Division 1 of the Civil Code, relating to the internet.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:31+00:00", "_id": "1ff23536-0fcb-11f1-9ce2-72e66fa16e68"}