{"legislative_session": "20252026", "identifier": "AB2180", "title": "Local government: Proposition 218 Omnibus Implementation Act: proportional cost of service.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Localgovernment", "Proposition218OmnibusImplementationAct", "proportionalcostofservice"], "abstracts": [{"note": "summary", "abstract": "The California Constitution specifies various requirements with respect to the levying of assessments and property-related fees and charges by a local agency. As part of those requirements, the California Constitution mandates that such fees or charges that are extended, imposed, or increased satisfy certain requirements, including, but not limited to, that the amount of the fee or charge imposed upon any parcel or person as an incident of property ownership not exceed the proportional cost of the service attributable to the parcel.\n\nExisting law, known as the Proposition 218 Omnibus Implementation Act (act) , prescribes specific procedures and parameters for local jurisdictions to comply with these requirements and, among other things, authorizes an agency providing water, wastewater, sewer, or refuse collection services to adopt a schedule of fees or charges authorizing automatic adjustments that pass through increases in wholesale charges for water, sewage treatment, or wastewater treatment or adjustments for inflation under certain circumstances.\n\nThis bill would authorize a local government to demonstrate the proportional cost of the service attributable to the parcel by any method that reasonably allocates the ascertainable cost of providing service to all parcels, if substantiated as provided. The bill would, however, provide that for water or sewer service fee or charge impositions, a local government is not required to provide an exact measure of the cost of the service at each parcel and may instead impose uniform or tiered fees or charges to parcel or customer classes that are defined based on common characteristics indicative of likely water or sewer use. The bill would provide that the proportional cost of service within each tier of water service may be substantiated by using any reasonable basis for allocating costs attributed to the tier, as described."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ward", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ward\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2180", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2180", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2180&version=20250AB218099INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2180", "note": ""}], "extras": {"impact_clause": "An act to add Section 53751.5 to the Government Code, relating to local government finance.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:31+00:00", "_id": "1fd0da94-0fcb-11f1-9ce2-72e66fa16e68"}