{"legislative_session": "20252026", "identifier": "AB1766", "title": "Health curriculum framework: human trafficking and online safety.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Healthcurriculumframework", "humantraffickingandonlinesafety"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Instructional Quality Commission and requires the commission to, among other things, develop, and the State Board of Education to adopt, modify, or revise, model curriculum frameworks, as specified. Existing law requires the commission, when the health curriculum framework is next revised on or after January 1, 2025, to consider providing for inclusion, in that curriculum framework, content on sextortion, as defined.\n\nExisting law, the California Healthy Youth Act, requires school districts, defined to include county boards of education, county superintendents of schools, the California School for the Deaf, the California School for the Blind, and charter schools, to ensure that all pupils in grades 7 to 12, inclusive, receive comprehensive sexual health education and human immunodeficiency virus (HIV) prevention education from instructors trained in the appropriate courses, at least once in junior high or middle school and at least once in high school. Under the act, this instruction includes, among other things, information about human trafficking. Existing law requires school districts, as part of the requirement of the California Healthy Youth Act that pupils receive comprehensive sexual health education and HIV prevention education from instructors trained in the appropriate courses, to ensure the periodic conduction of continuation training to enable school district personnel to learn about new developments in the understanding of, among other things, human trafficking, and to receive instruction on current prevention resources, as provided.\n\nThis bill would require the commission, when the health curriculum framework is next revised on or after January 1, 2027, to consider providing for inclusion in that framework recommendations related to school districts, county offices of education, and charter schools providing annual, developmentally appropriate lessons for each grade served by the local educational agency about how to prevent human trafficking, how to prevent exploitation for labor and services, how to stay safe from sexually exploitative materials and deepfakes online, foundational digital citizenship skills, and skills-based content that builds protective factors, as provided. The bill would require the recommended lessons to follow a cumulative, age-appropriate progression from kindergarten to grades 1 to 12, inclusive, as provided. \n\nThe bill would also require the commission, when the health curriculum framework is next revised on or after January 1, 2027, to consider providing for inclusion in that framework recommendations related to a local educational agency providing at least 3 staff members, as provided, with annual training related to the above-described content related to human trafficking and online safety, as provided."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 12.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Krell", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Krell\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1766", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1766", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/09/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1766&version=20250AB176699INT", "media_type": "application/pdf"}], "date": "2026-02-09", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1766", "note": ""}], "extras": {"impact_clause": "An act to add Section 33546.5 to the Education Code, relating to pupil instruction.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:52+00:00", "_id": "3d8f6240-0e3a-11f1-a618-2a6200350f1a"}