{"legislative_session": "20252026", "identifier": "SB909", "title": "Public works.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Publicworks"], "abstracts": [{"note": "summary", "abstract": "Existing law requires that, except as specified, not less than the general prevailing rate of per diem wages be paid to workers employed on public works and imposes misdemeanor penalties for a willful violation of this requirement. Existing law defines \"public works\" for the purposes of regulating public contracts as, among other things, construction, alteration, demolition, installation, or repair work done under contract and paid for, in whole or in part, out of public funds. Existing law generally requires a contractor or subcontractor to be registered with the Department of Industrial Relations to be qualified to bid on, be listed in a bid proposal, or engage in the performance of any public work contract. Existing law requires a contractor or subcontractor to meet specific conditions to qualify for this registration, including that a contractor or subcontractor pay an initial application fee and an annual renewal fee set by the Director of Industrial Relations. Existing law authorizes the department to establish and adjust annual registration and renewal fees up to $800 by publishing the fees on the department's internet website.\n\nThis bill would exempt the establishment and adjustment of those fees from the Administrative Procedure Act and would remove the $800 fee limit. The bill would instead require the director to annually adjust registration and renewal fees, as specified, and would no longer require the director to publish the fees on the department's internet website.\n\nExisting law requires the Labor Commissioner to issue civil wage and penalty assessments to a contractor or subcontractor, or both, if, after an investigation, the commissioner determines there has been a violation of the laws regulating public works contractors, including the payment of prevailing wages. Existing law sets a penalty schedule for subcontractors and contractors for, among other things, failing to pay the prevailing wage rate or failing to keep accurate payroll records, as specified.\n\nExisting law establishes the State Public Works Enforcement Fund and directs all registration fees and other moneys, such as fines, to be deposited into the fund, to be available upon appropriation, for, among other purposes, the reasonable costs of administering registration with the Department of Industrial Relations.\n\nThis bill would increase those penalties, as specified, and require 50% of all penalties received, as specified, to be deposited into the State Public Works Enforcement Fund.\n\nThe bill would make related findings and declarations."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-01-26", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after February 26.", "date": "2026-01-27", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Smallwood-Cuevas", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Smallwood-Cuevas\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB909", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB909", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/26/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB909&version=20250SB90999INT", "media_type": "application/pdf"}], "date": "2026-01-26", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB909", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 1725.5, 1741, 1775, 1776, 1777.7, and 1813 of the Labor Code, relating to public works.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-09T09:08:20+00:00", "_id": "e118627e-0596-11f1-9704-d2e31143f527"}