{"legislative_session": "20252026", "identifier": "AB2461", "title": "Oil and gas: bonding requirements.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Oilandgas", "bondingrequirements"], "abstracts": [{"note": "summary", "abstract": "Under existing law, the Geologic Energy Management Division in the Department of Conservation regulates the drilling, operation, maintenance, and abandonment of oil and gas wells in the state. The State Oil and Gas Supervisor supervises the drilling, operation, maintenance, and abandonment of wells and the operation, maintenance, and removal or abandonment of tanks and facilities related to oil and gas production, as provided. Existing law divides the state into districts and requires the supervisor to appoint one chief deputy and at least one district deputy for each of the districts.\n\nExisting law requires a person who acquires the right to operate a well or production facility, as soon as it is reasonably possible, but no later than the date when the acquisition of the well or production facility becomes final, to notify the supervisor or the district deputy, in writing, of the person's operation, as provided. Existing law further requires a person who acquires the right to operate a well or production facility to file with the supervisor an individual indemnity bond or a blanket indemnity bond in an amount determined by the supervisor to be sufficient to cover, in full, all costs of plugging and abandonment, decommissioning the facility, and site restoration, as provided. Existing law requires a person who intends to acquire the right to operate a well or production facility, by purchase, transfer, assignment, conveyance, exchange, or other disposition, to submit a request to the supervisor for a determination of the amount of the bond required before completing the acquisition and prohibits that person from completing the acquisition until the determination is received and the bond has been filed with the supervisor.\n\n A person who violates, fails, neglects, or refuses to comply with requirements of the oil and gas laws, including the bonding requirements described above, is guilty of a misdemeanor, as provided.\n\nThis bill would make the above-described requirements applicable to a person who acquires, or intends to acquire, as applicable, the right to control a well or production facility and would make conforming changes, as provided. The bill would provide that, for purposes of filing an indemnity bond, a person who \"acquires a right to operate or control a well or production facility\" includes, but is not limited to, the direct or indirect sale or exchange in a single or series of related transactions by the stockholders of the operator of more than 50% of the voting stock of the operator and a liquidation or dissolution of the operator, among other transactions. By expanding the scope of a crime, the bill would impose a state-mandated local program.\n\nExisting law exempts from the above-described requirements relating to filing an indemnity bond a well that has an average daily production level that exceeds 15 barrels of oil or 60,000 cubic feet of natural gas during the 12 months preceding the date of acquisition or a natural gas storage well, as provided.\n\nThis bill would delete that exemption.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Hart", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Hart\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2461", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2461", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2461&version=20250AB246199INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2461", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 3202 and 3205.8 of the Public Resources Code, relating to oil and gas.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:38+00:00", "_id": "23f177fa-0fcb-11f1-9ce2-72e66fa16e68"}