{"legislative_session": "20252026", "identifier": "SB1056", "title": "Criminal procedure.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Criminalprocedure"], "abstracts": [{"note": "summary", "abstract": "Existing law requires a prosecuting attorney to disclose to the defendant or their attorney all relevant real evidence seized or obtained as a part of the investigation of the offenses charged that is in the possession of the prosecuting attorney or known to be in the possession of the investigating agencies. Existing law requires the disclosures to be made at least 30 days prior to the trial, unless good cause is shown why a disclosure should be denied, restricted, or deferred.\n\nExisting law prohibits an attorney from disclosing or permitting to be disclosed to a defendant, members of the defendant's family, or anyone else copies of child pornography evidence, unless specifically permitted to do so by the court after a hearing and a showing of good cause. Existing law authorizes an attorney to disclose or permit to be disclosed copies of child pornography evidence to persons employed by the attorney or to persons appointed by the court to assist in the preparation of a defendant's case if that disclosure is required for that preparation.\n\nThis bill would require the court, in a criminal case involving sexually explicit material depicting or involving an adult victim, to issue a protective order governing the disclosure of that material, with conditions sufficient to prevent unnecessary copying, transmission, or dissemination of the material.\n\nThis bill would prohibit an attorney from disclosing or permitting to be disclosed to a defendant, members of the defendant's family, or anyone else copies of sexually explicit material depicting or involving an adult victim, unless specifically permitted to do so by the court after a hearing and a showing of good cause. The bill would authorize an attorney to disclose or permit to be disclosed copies of evidence of sexually explicit material depicting or involving an adult victim to persons employed by the attorney or to persons appointed by the court to assist in the preparation of a defendant's case only in accordance with the terms of a protective order issued by the court if that disclosure is required for that preparation.\n\n This bill would clarify that these provisions do not relieve the prosecution from the duty to disclose the existence of any relevant or exculpatory evidence nor affect the admissibility of any relevant evidence in court."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 15.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Grayson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Grayson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1056", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1056", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1056&version=20250SB105699INT", "media_type": "application/pdf"}], "date": "2026-02-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1056", "note": ""}], "extras": {"impact_clause": "An act to add Section 1054.11 to the Penal Code, relating to criminal procedure.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-14T08:43:41+00:00", "_id": "43838996-0981-11f1-baff-1a052d2b7fdd"}