{"legislative_session": "20252026", "identifier": "AB1951", "title": "Civil actions: filing fees: refunds.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Civilactions", "filingfees", "refunds"], "abstracts": [{"note": "summary", "abstract": "Existing law provides that a civil action is commenced by filing a complaint by the court. Existing law provides that if a court clerk accepts for filing a complaint or other first paper, or any subsequent filing, and payment is made in an amount less than the required fee or by check that is later returned without payment, the clerk must notify the party who tendered the check that (1) the check was made out for an amount less than the required filing fee or has been returned without payment, whichever is applicable, (2) an administrative charge has been imposed to reimburse the court for the costs of processing the partial payment or returned check and for providing the specified notice, and (3) the party has 20 days from the date of mailing of the notice to pay the filing fee and administrative charge, except as specified. Existing law requires the clerk to void the filing if the party who tendered the returned check or the check in less than the required filing fee has not paid the full amount of the fee and the administrative charge within the 20-day period described above. Existing law provides that if the clerk performs a service or issues a document for which a fee is required and payment is made by check that is later returned without payment, the court may order further proceedings suspended as to the party for whom the check was tendered, and shall notify the party who tendered the check that proceedings have been suspended until receipt of payment of the required fee and the administrative charge by specified methods, but not by personal check or traveler's check.\n\nThis bill would additionally apply the provisions described above to filing fees paid by credit card, electronic funds transfer, as defined, or any other means approved by the court.\n\nExisting law provides that if an electronic filing is made to the clerk by an electronic filing service provider acting as the agent of the court for purposes of collecting and remitting filing fees, and fees owed to the electronic filing service provider remain unpaid for 5 days after notice to the attorney of record, the court clerk may notify the attorney of record that the attorney of record may be sanctioned for nonpayment of fees. Existing law authorizes the court to sanction the attorney of record if fees to the electronic service provider remain unsatisfied 20 days after notice by the clerk.\n\nThis bill would additionally apply the provisions described above, relating to electronic filing service providers and sanctions, to a self-represented party."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Dixon", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Dixon\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1951", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1951", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/13/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1951&version=20250AB195199INT", "media_type": "application/pdf"}], "date": "2026-02-13", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1951", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 411.20, 411.20.5, and 411.21 of, and to add Section 411.11 to, the Code of Civil Procedure, and to amend Section 6159 of the Government Code, relating to civil actions.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-14T08:44:48+00:00", "_id": "6b9857e0-0981-11f1-baff-1a052d2b7fdd"}