{"legislative_session": "20252026", "identifier": "SB837", "title": "Student financial aid: online technology platforms: guidance: training: media campaign.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Studentfinancialaid", "guidance", "mediacampaign", "onlinetechnologyplatforms", "training"], "abstracts": [{"note": "summary", "abstract": "Existing law requires each campus of the University of California, the California State University, and the California Community Colleges, each independent institution of higher education, and certain private postsecondary educational institutions to provide students with the Financial Aid Shopping Sheet as developed by the United States Department of Education to inform students or individuals who have been offered admission about financial aid award packages, as specified.\n\nExisting law establishes the Student Aid Commission as the primary state agency for the administration of state-authorized student financial aid programs available to students attending all segments of postsecondary education. Existing law authorizes the commission to, among other things, expend funds for purposes of disseminating information about all institutional, state, and federal student aid programs to potential applicants, and requires that distribution of information to primarily focus on potential applicants with the greatest financial need. Existing law requires the commission, in the event that the Financial Aid Shopping Sheet developed by the United States Department of Education is no longer available, to develop, in consultation with the Bureau for Private Postsecondary Education, a similar form that the above-described postsecondary educational institutions would be required to use instead. Existing law requires the form to provide students and their families with information including, but not limited to, grant and scholarship opportunities and net costs associated with attendance at an institution.\n\nExisting law, the Community College Student Financial Aid Outreach Program, requires the commission, in consultation with the office of the Chancellor of the California Community Colleges, to develop and administer the program for the purpose of providing financial aid training to high school and community college counselors and advisers who work with students planning to attend or attending a community college, as specified. Existing law requires the training to also address the specific needs of community college students intending to transfer to a four-year institution of higher education, foster youth and former foster youth, homeless youth and former homeless youth, and students with disabilities.\n\nThis bill would require the commission, on or before July 1, 2027, to develop guidance for school districts, county offices of education, charter schools, and public libraries on how to use online technology platforms to assist low-income pupils, foster youth, and undocumented families in accessing student financial aid. The bill would require the guidance to include information on how to use online technology platforms that do certain things, including, among other things, providing clear, accurate, and comprehensive information about the cost of colleges and universities and the availability of financial aid that is specifically tailored to the student's unique educational and financial circumstances. The bill would require the commission, on or before July 1, 2027, to offer a training program for school counselors and administrators and community-based organizations on the guidance, and to implement a multilingual media campaign targeting underserved communities to raise awareness of available online technology platforms relating to the guidance."}], "other_titles": [{"note": "", "title": "Postsecondary education: segments."}], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2025-02-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 24.", "date": "2025-02-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Read first time.", "date": "2025-02-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Com. on RLS.", "date": "2025-03-12", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on RLS.", "entity_type": "organization", "organization_id": null}]}, {"description": "From committee with author's amendments. Read second time and amended. Re-referred to Com. on RLS.", "date": "2025-03-26", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["amendment-passage", "committee-passage", "reading-1", "reading-2", "referral-committee"], "related_entities": [{"name": "Com. on RLS.", "entity_type": "organization", "organization_id": null}]}, {"description": "Re-referred to Com. on ED.", "date": "2025-04-02", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on ED.", "entity_type": "organization", "organization_id": null}]}, {"description": "Set for hearing April 30.", "date": "2025-04-09", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "April 30 set for first hearing canceled at the request of author.", "date": "2025-05-01", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Reyes", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Reyes\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB837", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB837", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/21/25 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB837&version=20250SB83799INT", "media_type": "application/pdf"}], "date": "2025-02-21", "classification": ""}, {"note": "03/26/25 - Amended Senate", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB837&version=20250SB83798AMD", "media_type": "application/pdf"}], "date": "2025-03-26", "classification": ""}], "documents": [{"note": "04/28/25- Senate Education", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202520260SB837&analysisId=385542&analyzingOffice=Senate+Education", "media_type": "application/pdf"}], "date": "2025-04-28", "classification": "analysis"}], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB837", "note": ""}], "extras": {"impact_clause": "An act to add Section 69514.7 to the Education Code, relating to student financial aid.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2025-12-14T23:37:23+00:00", "_id": "d766ab00-d945-11f0-bb80-a2dc17e61576"}