{"legislative_session": "20252026", "identifier": "AB2112", "title": "Integrated waste management plans: annual report.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Integratedwastemanagementplans", "annualreport"], "abstracts": [{"note": "summary", "abstract": "Existing law, the California Integrated Waste Management Act of 1989, administered by the Department of Resources Recycling and Recovery, establishes an integrated waste management program. Existing law requires each city, county, and regional agency, if any, to develop a source reduction and recycling element, household hazardous waste element, and nondisposal facility element of an integrated waste management plan. The act requires the source reduction and recycling element to divert from disposal 50% of all solid waste subject to the element through source reduction, recycling, and composting activities, with specified exceptions. Existing law requires each jurisdiction to submit an annual report to the department summarizing the jurisdiction's progress in reducing solid and household hazardous waste. Existing law requires the annual report to, among others, identify locations for new or expanded organic waste recycling facilities capable of safely meeting the additional organic waste recycling facility capacity need identified in the annual report.\n\nThis bill would, on and after August 1, 2027, clarify that the locations for new or expanded waste recycling facilities include, but are not limited to, a medium compostable material handling facility or operation and a small compostable material handling facility or operation, as defined. To the extent the bill would require a local jurisdiction to include additional information in its annual report, the bill would impose a state-mandated local program. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Bains", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bains\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2112", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2112", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2112&version=20250AB211299INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2112", "note": ""}], "extras": {"impact_clause": "An act to amend, repeal, and add Section 41821.4 of the Public Resources Code, relating to solid waste.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:29+00:00", "_id": "1eeb079e-0fcb-11f1-9ce2-72e66fa16e68"}