{"legislative_session": "20252026", "identifier": "AB2611", "title": "Electrical rate schedules: hardships: hot climate zones.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Electricalrateschedules", "hardships", "hotclimatezones"], "abstracts": [{"note": "summary", "abstract": "Existing law requires the Public Utilities Commission to designate a baseline quantity of gas and electricity that is necessary to supply a significant portion of the reasonable energy needs of the average residential customer. Existing law requires every electrical corporation and gas corporation to file a schedule of rates and charges providing baseline rates, as provided. Existing law requires the commission, in establishing residential electrical and gas rates, including baseline rates, to ensure that the rates are sufficient to enable the electrical corporation or gas corporation to recover a just and reasonable amount of revenue from residential customers as a class, while observing the principle that electricity and gas services are necessities, for which a low affordable rate is desirable, as provided.\n\nThis bill would require the commission to ensure that each electrical rate schedule does not cause an unreasonable hardship on public schools, or economically vulnerable residential customers, in hot climate zones, as specified. The bill would define several terms for that purpose, including, among others, \"unreasonable hardship\" to mean an electrical rate schedule that imposes a rate on a public school or economically vulnerable residential customer above the baseline rate during any hour when the temperature is above 90 degrees Fahrenheit for the duration of the hour, as provided.\n\nUnder existing law, a violation of any order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause a violation of a commission action implementing this bill's requirements would be a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Bains", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bains\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2611", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2611", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2611&version=20250AB261199INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2611", "note": ""}], "extras": {"impact_clause": "An act to add 739.20 to the Public Utilities Code, relating to electricity.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:41+00:00", "_id": "2636e270-0fcb-11f1-9ce2-72e66fa16e68"}