{"legislative_session": "20252026", "identifier": "AB2202", "title": "Pupil achievement: Closing the Achievement Gap Commission.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["ClosingtheAchievementGapCommission", "Pupilachievement"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the State Board of Education and requires the state board to study educational conditions and needs of the state and to make plans for the improvement of the administration and efficiency of the public schools of the state. Existing law establishes the State Department of Education under the administration of the Superintendent of Public Instruction and assigns to the department numerous responsibilities relating to the governance of the public elementary and secondary schools in the state.\n\nThis bill would establish the Closing the Achievement Gap Commission as an advisory body to the state board. The bill would require the membership of the commission to consist of 13 voting members and one nonvoting member with an advisory vote, as provided. The bill would require 9 members of the commission to be appointed by the Governor pursuant to a specified application process and would require those members to reflect geographic, demographic, and district-type diversity. The bill would limit members appointed to the commission to one 4-year term, as provided. The bill would require the commission to annually elect a chair and vice chair and meet at least 4 times annually in the first year after its creation, and as needed thereafter, at the call of the chair or the state board. The bill would require the commission to, among other things, continually assess the extent to which there are gaps in state support for local educational agencies in their efforts to close achievement gaps. The bill would require the commission, on or before December 1 of each year, to submit a report to the Governor, the appropriate policy and fiscal committees of the Legislature, the state board, and the department with recommendations and proposed actions that the state can take to help and support local educational agencies in closing the achievement gap. The bill would require the state board to consider those reports as an agenda item at a regularly scheduled public meeting or as provided and would require the department to post those reports on the department's internet website."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Muratsuchi", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Muratsuchi\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2202", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2202", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2202&version=20250AB220299INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2202", "note": ""}], "extras": {"impact_clause": "An act to add Article 7 (commencing with Section 33600) to Chapter 4 Part 20 of Division 2 of Title 2 of the Education Code, relating to pupil achievement.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:59+00:00", "_id": "41ba0d34-0e3a-11f1-a618-2a6200350f1a"}