{"legislative_session": "20252026", "identifier": "AB1826", "title": "Cannabis: recall, embargo, and destruction of cannabis and cannabis products.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Cannabis", "recall,embargo,anddestructionofcannabisandcannabisproducts"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Medicinal and Adult-Use Cannabis Regulation and Safety Act (MAUCRSA) , governs the licensure and regulation of commercial cannabis activities. Existing law places specified requirements on the packaging and labeling of cannabis and cannabis products. If the packaging or labeling does not conform to those requirements, the cannabis or cannabis product is deemed misbranded. Existing law prohibits engaging in certain commercial activities with cannabis or a cannabis product that is misbranded or adulterated.\n\nMAUCRSA establishes the Department of Cannabis Control for the administration and enforcement of its provisions. Existing law gives the department various enforcement powers and duties related to the recall, embargo, seizure, and destruction of cannabis and cannabis products that have been deemed misbranded or adulterated, or whose sale would otherwise be in violation of MAUCRSA. When the department has evidence that cannabis or a cannabis product has been adulterated or misbranded or when the department issues an embargo, existing law requires the department to notify the licensee.\n\n This bill would require those notifications to include certain documentation supporting the finding of adulteration or misbranding, or the finding of probable cause to issue an embargo, as specified.\n\nExisting law authorizes a licensee to conduct a voluntary recall of the affected cannabis or cannabis product and to remediate the cannabis or cannabis product, if approved by the department, otherwise, existing law requires the licensee to destroy the affected cannabis or cannabis product under the supervision of the department.\n\nThis bill would require the department, prior to a voluntary recall by the licensee, and within 5 business of delivery of the notification of adulteration or misbranding, to provide the licensee with an opportunity for a meet and confer on why the cannabis or cannabis product is considered adulterated or misbranded. The bill would prohibit the department from permitting destruction of the product until either the meet and confer process has concluded or the licensee has declined to meet and confer.\n\nExisting law authorizes the department to issue a mandatory recall if the cannabis or cannabis product creates or poses an immediate and serious threat to human life or health, as specified. Existing law requires the department to provide an opportunity for an informal proceeding on the recall within 5 days, as specified.\n\nThis bill would require the department to provide the evidence supporting the mandatory recall simultaneously with the issuance of the order. The bill would require the department to provide the licensee an opportunity for a meet and confer on the recall, instead of an informal proceeding, within 5 business days of the order, as specified. The bill would prohibit the department from requiring destruction of cannabis or cannabis product prior to the conclusion of either the meet and confer process or the licensee's decision not to meet and confer.\n\nExisting law requires the department to affix an embargo tag or other appropriate marking to cannabis or cannabis product that the department finds or has probable cause to believe is in violation of MAUCRSA, as specified. Existing law prohibits the embargoed cannabis or cannabis product from being removed or disposed of by sale or otherwise until the department or a court gives permission. Existing law authorizes the licensee to request that the department remove the tag or other marking to permit correction if the adulteration or misbranding can be corrected by proper labeling or additional processing, and other requirements are met. Existing law authorizes the department to remove the tag or other marking if it finds that the embargoed cannabis or cannabis product is not in violation of MAUCRSA, as specified.\n\nThis bill would require the department to work diligently to make a final determination on the embargo order, as provided, and would require the department to remove the embargo tag or other marking within 24 hours of finding that cannabis or a cannabis product is not in violation of MAUCRSA, as specified.\n\nExisting law authorizes the department to condemn cannabis or a cannabis product that is in violation of MAUCRSA, as specified, and imposes certain notice and hearing requirements on a proceeding for condemnation.\n\nThis bill would require a proceeding for condemnation to be initiated by the department within 10 days of the department's rejection of a corrective action plan submitted by the licensee, or within 10 days of the embargo if no corrective plan is submitted, as described. If the cannabis or cannabis product subject to condemnation is a perishable agricultural product, the bill would require the administrative law judge to schedule the hearing no later than 5 business days after the petition for condemnation is filed and to issue a decision within 48 hours of the conclusion of the hearing.\n\nThe bill would prohibit the department from requiring a licensee to conduct a voluntary recall, sign a waiver of liability, or waive any right to an informal meeting or an administrative or judicial hearing or appeal as a condition of the department taking certain actions. Those actions include approving a voluntary recall, authorizing remediation, supervising the destruction of the cannabis or cannabis product, removing an embargo tag, approving a corrective plan, and permitting the destruction of product."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Lackey", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Lackey\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1826", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1826", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/11/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1826&version=20250AB182699INT", "media_type": "application/pdf"}], "date": "2026-02-11", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1826", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 26039.1 and 26039.3 of the Business and Professions Code, relating to cannabis.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-12T09:00:58+00:00", "_id": "590bce54-07f1-11f1-8856-36e757393db5"}