{"legislative_session": "20252026", "identifier": "AB1591", "title": "California Podiatric Pipeline Program.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaPodiatricPipelineProgram"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Department of Health Care Access and Information under the control of the Director of the Department of Health Care Access and Information, to administer various health professions development programs. Existing law requires the department to maintain a Health Professions Career Opportunity Program to, among other things, implement programs at colleges and universities selected by the department and include in those programs pipeline programs that provide comprehensive academic enrichment, career development, mentorship, and advising in order to support students from underrepresented regions and backgrounds to pursue health careers. \n\nExisting law creates within the department the Health Professions Education Fund, for the primary purpose of providing scholarships and loans to students from underrepresented groups who are accepted to or enrolled in schools of medicine, dentistry, nursing, or other health professions. Existing law authorizes the department to receive private donations to be deposited into the fund and continuously appropriates all moneys in the fund to the department for those purposes.\n\nThis bill would enact the California Podiatric Pipeline Program Act, to require the department to establish and administer the California Podiatric Pipeline Program to promote careers in podiatric medicine and support the educational advancement of California residents pursuing the doctor of podiatric medicine degree, as specified. The bill would specify that the department may use funds from the Health Professions Education Fund for the purposes of this bill, subject to the requirements of the fund. \n\nThis bill would authorize the department to award planning or coordination grants to participating universities or colleges to support implementation of the program as funding is made available. The bill would also require the department, subject to an appropriation by the Legislature, to annually report to the Legislature regarding the number of students participating, the number matriculating into doctor of podiatric medicine programs, and recommendations for expanding residency opportunities for podiatric graduates."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-15", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 15.", "date": "2026-01-16", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Michelle Rodriguez", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Michelle Rodriguez\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1591", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1591", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/15/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1591&version=20250AB159199INT", "media_type": "application/pdf"}], "date": "2026-01-15", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1591", "note": ""}], "extras": {"impact_clause": "An act to add Article 6 (commencing with Section 128055) to Chapter 2 of Part 3 of Division 107 of the Health and Safety Code, relating to health professions.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-17T08:41:12+00:00", "_id": "472bc4b2-f380-11f0-bb0a-7e3de13bb327"}