{"legislative_session": "20252026", "identifier": "AB2489", "title": "Controlled substances: research.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Controlledsubstances", "research"], "abstracts": [{"note": "summary", "abstract": "Existing law, the California Uniform Controlled Substances Act, classifies controlled substances into 5 designated schedules, with the most restrictive limitations generally placed on controlled substances classified in Schedule I, and the least restrictive limitations generally placed on controlled substances in Schedule V. Existing law creates the Research Advisory Panel, as specified, to conduct hearings on, and in other ways study, research projects concerning controlled substances. Existing law authorizes the panel to approve research projects that have been registered with the Attorney General concerning the nature and effects of cannabis or hallucinogenic drugs and the treatment of abuse of controlled substances. Existing law authorizes a person who, under federal law, is entitled to use controlled substances for the purpose of research, instruction, or analysis to lawfully obtain and use those controlled substances upon approval by the panel, as specified.\n\nThis bill, the California Veterans' Right to Try Act, would, until January 1, 2028, authorize the Research Advisory Panel to submit an investigational new drug application to the United States Food and Drug Administration requesting approval for a clinical trial of Schedule I or Schedule II controlled substances, as specified. The bill would authorize the Research Advisory Panel to, upon the failure of the United States Food and Drug Administration to timely approve an application, provide expedited approval of the research project if the application meets certain requirements, including proof of an independent peer review of the study for scientific merit and rigor by certain entities. The bill would require a veteran, in order to participate, to have been diagnosed with 2 or more severe or life-threatening mental health conditions and have been deemed ineligible to participate in United States Food and Drug Administration approved trials.\n\nThis bill would make conforming changes and would make related findings and declarations."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Lowenthal", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Lowenthal\"}", "organization_id": null}, {"name": "Jeff Gonzalez", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Jeff Gonzalez\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2489", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2489", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2489&version=20250AB248999INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2489", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 11213 and 11392 of, and to add and repeal Article 1.5 (commencing with Section 11214) of Chapter 5 of Division 10 of, the Health and Safety Code, relating to controlled substances.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:20+00:00", "_id": "a752f990-0f01-11f1-bd68-62084ebb1ff2"}