{"legislative_session": "20252026", "identifier": "AB1959", "title": "Juvenile justice.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Juvenilejustice"], "abstracts": [{"note": "summary", "abstract": "Existing law allows a person sentenced to life imprisonment without the possibility of parole who was under 18 years of age at the time of the offense to petition the court for recall of their sentence and resentencing, as specified. Existing law prohibits a person from seeking recall and resentencing pursuant to these provisions if it is pleaded and proved that the person committed certain offenses and the victim was a public safety official, including any law enforcement personnel.\n\nThis bill would additionally prohibit a person from seeking recall and resentencing pursuant to these provisions where it was pled and proved that the defendant, within the same proceeding, has been convicted of more than one offense of murder in the first or 2nd degree, that the offense constitutes a mass shooting, as defined, or that the offense was committed in a school zone or on the property of a place of worship.\n\nExisting law, as amended by the Public Safety and Rehabilitation Act of 2016, enacted by Proposition 57 at the November 8, 2016, statewide general election, authorizes the district attorney to make a motion to transfer a minor from juvenile court to a court of criminal jurisdiction in a case in which a minor is alleged to have committed a felony when the minor was 16 years of age or older, or in a case in which a specified serious offense is alleged to have been committed by a minor when the minor was 14 or 15 years of age, but the minor was not apprehended prior to the end of juvenile court jurisdiction. \n\nThis bill would, consistent with the intent of Proposition 57, authorize the district attorney to make a motion to transfer a minor from juvenile court to a court of criminal jurisdiction when the minor is alleged to have committed certain specified offenses when the minor was 14 or 15 years of age."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 16.", "date": "2026-02-14", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Patel", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Patel\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1959", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1959", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/13/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1959&version=20250AB195999INT", "media_type": "application/pdf"}], "date": "2026-02-13", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1959", "note": ""}], "extras": {"impact_clause": "An act to amend Section 1170 of the Penal Code, and to amend Section 707 of the Welfare and Institutions Code, relating to juveniles.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:55+00:00", "_id": "3f610d58-0e3a-11f1-a618-2a6200350f1a"}