{"legislative_session": "20252026", "identifier": "AB2121", "title": "Community colleges: current expense of education: exclusions.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Communitycolleges", "currentexpenseofeducation", "exclusions"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the California Community Colleges, under the administration of the Board of Governors of the California Community Colleges, as one of the segments of public postsecondary education in this state. Existing law establishes community college districts throughout the state and authorizes these districts to provide instruction at community college campuses.\n\nExisting law requires the expenditure, during each fiscal year, for the payment of salaries of classroom instructors by a community college district, of 50% of the district's current expense of education. Existing law defines \"current expense of education\" as the gross total expended for certain expenses that include academic salaries, classified salaries, employee benefits, and books, supplies, and equipment replacement, but that generally exclude expenses for student transportation, food services, and community services.\n\nThis bill, notwithstanding the above-described provisions, would authorize a community college district, for a period of 5 fiscal years following the 2025–26 fiscal year, or until specified federal funding is restored, whichever occurs first, to exclude from its current expense of education any local unrestricted expenditures from the community college district's unrestricted general fund, as specified, that maintain student support functions that were previously funded though federal discretionary grants that have been terminated, nonrenewed, or defunded due to federal action on or after September 10, 2025. If a community college district exercises its authority pursuant to these provisions, the bill would require the community college district to annually certify eligibility to the office of the Chancellor of the California Community Colleges and would require the chancellor's office to maintain documentation and include as part of another specified report, any certifications it receives, as provided. The bill would make its provisions inoperative on July 1, 2031, or on the first day of the fiscal year following restoration of specified federal funding, whichever occurs first, and would repeal them on January 1 of the year following the inoperative date.\n\nThis bill would declare that it is to take effect immediately as an urgency statute."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Berman", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Berman\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2121", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2121", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2121&version=20250AB212199INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2121", "note": ""}], "extras": {"impact_clause": "An act to add and repeal Section 84363 of the Education Code, relating to community colleges, and declaring the urgency thereof, to take effect immediately.", "tags": ["fiscal committee", "urgency"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:12+00:00", "_id": "a2e554b6-0f01-11f1-bd68-62084ebb1ff2"}