{"legislative_session": "20252026", "identifier": "SB1310", "title": "Voter registration: prospective jurors.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Voterregistration", "prospectivejurors"], "abstracts": [{"note": "summary", "abstract": "Existing law permits a United States citizen who is 18 years of age, a resident of California, and not imprisoned for a felony to register to vote and to vote. Existing law provides procedures for the Secretary of State and a county elections official to register a person to vote, and to update and to cancel the person's voter registration.\n\nExisting law provides criteria that disqualify a person from serving on a jury, including if the person is not a United States citizen or not a resident of the jurisdiction where they are summoned. Existing law requires prospective jurors to be selected at random from sources that represent cross sections of the population of the area served by the court. Existing law provides that voter registration lists are appropriate source lists for the selection of jurors.\n\nThis bill would require a jury commissioner to provide notice to the Secretary of State and the county elections official if the jury commissioner receives information from a juror affidavit that contains an attestation by the prospective juror under penalty of perjury that they are not qualified for jury service for a reason that would also make them ineligible to vote. The bill would require the elections official who receives this information and determines the person is ineligible to vote to inactivate the person's voter registration and send notice to the person that provides them an opportunity to confirm their eligibility. The bill would require an elections official to update the voter registration for a prospective juror who is registered to vote but whose residence address is in a county other than the county in which they were summoned.\n\nBy establishing new duties for local elections officials, the bill would create a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Choi", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Choi\"}", "organization_id": null}, {"name": "Alvarado-Gil", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Alvarado-Gil\"}", "organization_id": null}, {"name": "Tangipa", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Tangipa\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1310", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1310", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1310&version=20250SB131099INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1310", "note": ""}], "extras": {"impact_clause": "An act to add Section 205.5 to the Code of Civil Procedure, and to add Section 2215 to the Elections Code, relating to elections.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:43:59+00:00", "_id": "76ef9a4c-0f01-11f1-bd68-62084ebb1ff2"}