{"legislative_session": "20252026", "identifier": "SB719", "title": "School accountability: financial and performance audits.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Schoolaccountability", "financialandperformanceaudits"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the California Board of Accountancy, which is within the Department of Consumer Affairs, and requires the California Board of Accountancy to license and regulate accountants in this state. Existing law requires the California Board of Accountancy to adopt regulations as necessary to implement, interpret, and make specific certain peer review requirements, including, among other things, regulations specifying the requirements for board recognition of a peer review program, as provided.\n\nExisting law authorizes the Controller to perform quality control reviews of audit working papers to determine whether audits are performed in conformity with those specified standards. Existing law authorizes a county superintendent of schools or a county board of education to refer an independent auditor of a local educational agency to the California Board of Accountancy if an audit of a local educational agency was conducted in a manner that may constitute unprofessional conduct, as specified.\n\nExisting law requires county superintendents of schools to provide for an audit of all funds under their jurisdiction and control, and requires the governing board of each local educational agency to either provide for an audit of the books and accounts of the local educational agency or make arrangements with county superintendents of schools to provide for that auditing. Existing law requires those audits to be made by a certified public accountant or a public accountant, licensed by the California Board of Accountancy, and selected by the local educational agency, as applicable, from a directory of certified public accountants and public accountants deemed by the Controller as qualified to conduct audits of local educational agencies.\n\nThis bill would require the California Board of Accountancy to adopt regulations as necessary to implement, interpret, and make specific the peer review requirements for firms that conduct local educational agency financial and compliance audits, as provided. The bill would require the Controller to conduct a quality control review of a certified public accountant or a public accountant listed in the above-described directory in specified situations, including, among others, after their first audit of a local educational agency is completed and every 3 years for those auditing charter schools to ensure that all are periodically reviewed. The bill would authorize a county superintendent of schools, a chartering authority, the Controller, or the Superintendent of Public Instruction to refer an independent auditor of a local educational agency to the California Board of Accountancy if, among other things, material deficiencies are discovered in a quality control review, as provided.\n\nThe bill would require, commencing with the 2026–27 fiscal year, and every 2 years thereafter, certified public accountant firms, certified public accountants or public accountants, and audit staff that conduct audits of local educational agencies to (1) have completed 24 hours of continuing education on specified topics and (2) have prior experience conducting financial and compliance audits for local educational agencies or have gained the necessary competence through training or other professional development activities, as provided. The bill would require the Controller to convene and lead a broad-based workgroup with representatives from specified entities to recommend local educational agency-specific topics for that training."}], "other_titles": [{"note": "", "title": "Charter schools: audits."}], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2025-02-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 24.", "date": "2025-02-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Read first time.", "date": "2025-02-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Com. on RLS.", "date": "2025-03-12", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on RLS.", "entity_type": "organization", "organization_id": null}]}, {"description": "From committee with author's amendments. Read second time and amended. Re-referred to Com. on RLS.", "date": "2025-03-25", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["amendment-passage", "committee-passage", "reading-1", "reading-2", "referral-committee"], "related_entities": [{"name": "Com. on RLS.", "entity_type": "organization", "organization_id": null}]}, {"description": "Re-referred to Coms. on B. P. & E.D. and ED.", "date": "2025-04-02", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Coms. on B. P. & E.D. and ED.", "entity_type": "organization", "organization_id": null}]}, {"description": "Set for hearing April 21.", "date": "2025-04-03", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "April 21 hearing postponed by committee.", "date": "2025-04-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Cabaldon", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Cabaldon\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB719", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB719", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/21/25 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB719&version=20250SB71999INT", "media_type": "application/pdf"}], "date": "2025-02-21", "classification": ""}, {"note": "03/25/25 - Amended Senate", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB719&version=20250SB71998AMD", "media_type": "application/pdf"}], "date": "2025-03-25", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB719", "note": ""}], "extras": {"impact_clause": "An act to amend Section 5076 of the Business and Professions Code, and to amend Sections 14504.2 and 41020 of the Education Code, relating to school accountability.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2025-12-03T15:14:59+00:00", "_id": "d59c37c0-d05a-11f0-bf47-a2666b876d6e"}