{"legislative_session": "20252026", "identifier": "SB1198", "title": "Vehicles: reckless driving: impoundment.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Vehicles", "impoundment", "recklessdriving"], "abstracts": [{"note": "summary", "abstract": "Under existing law, a court is authorized to suspend the driving privilege of a licensed driver convicted of a violation relating to the speed of vehicles or reckless driving for a period of not to exceed 30 days for a first conviction, for a period of not to exceed 60 days upon a 2nd convection, and for a period of not to exceed 6 months upon a 3rd or any subsequent conviction.\n\nThis bill would authorize a court, for a conviction of reckless driving, to suspend the driving privilege for a period of not less than 30 days and not more than 90 days upon a first conviction, and would require a court to suspend the driving privilege for a period of 6 months upon a 2nd conviction, and for a period of not less than 3 years upon a 3rd or any subsequent conviction.\n\nExisting law authorizes a peace officer to arrest a person and seize the motor vehicle of the person if a peace officer determines that the person was engaged in a motor vehicle speed contest, reckless driving, or an exhibition of speed on a highway or in an offstreet parking facility. Existing law allows a vehicle seized under this provision to be impounded for up to 30 days. Existing law requires an impounding agency to release a motor vehicle to the registered owner or their agent prior to the conclusion of the impoundment period if, among other reasons, the person alleged to have been engaged in the motor vehicle speed contest was not authorized by the registered owner to operate the motor vehicle at the time of the commission of the offense, or if the registered owner was neither the driver nor a passenger of the motor vehicle or was unaware that the driver was using the motor vehicle to engage in the prohibited activities.\n\nIf a peace officer determines that a person was engaged in reckless driving on a highway or in an offstreet parking facility, this bill would authorize the seized motor vehicle to be impounded for not less than 60 days and not more than 90 days if the person has a reckless driving conviction that occurred within 3 years before the current offense. If an impounding agency releases a motor vehicle to the registered owner or agent prior to the conclusion of the impoundment period, the bill would require the registered owner to provide evidence that the driver did not have authorization from the registered owner to operate the motor vehicle, as specified, or require the registered owner to sign an affidavit under penalty of perjury that the registered owner was unaware that the driver was using the vehicle to engage in reckless driving. By expanding the scope of the crime of perjury, this bill would create a state-mandated local program. The bill would allow a registered owner or their agent to obtain their vehicle prior to the conclusion of the impoundment period based on the reason that the registered owner was not the driver or passenger of the motor vehicle or was unaware that the driver was engaging in reckless driving once. The bill would prohibit a registered owner from using this reason to obtain the motor vehicle prior to the conclusion of the impoundment period for a 2nd or any subsequent arrest that involves the same driver and vehicle.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Menjivar", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Menjivar\"}", "organization_id": null}, {"name": "Archuleta", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Archuleta\"}", "organization_id": null}, {"name": "Petrie-Norris", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Petrie-Norris\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1198", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1198", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1198&version=20250SB119899INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1198", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 13200 and 23109.2 of, and to add Section 23109.4 to, the Vehicle Code, relating to vehicles.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:03+00:00", "_id": "eb51c60c-0fca-11f1-9ce2-72e66fa16e68"}