{"legislative_session": "20252026", "identifier": "AB1814", "title": "Peace officer training: driving under the influence.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Peaceofficertraining", "drivingundertheinfluence"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Commission on Peace Officer Standards and Training, and requires the commission to, among other things, establish a certification program for peace officers, as defined. Existing law requires the commission, in consultation with specified subject matter experts, to develop guidelines and a course of instruction and training for law enforcement officers, including, but not limited to, hate crimes, elder and dependent abuse, and stalking.\n\nThis bill would require, no later than July 1, 2027, the commission to establish and maintain a training course relating to the detection and apprehension of drivers whose behavior indicates that they may be driving under the influence of drugs or alcohol. The bill would require the course to be at least 3 hours and to include certain topics, such as standardized field sobriety testing, physiology of drugs, and report writing, among others. The bill would require peace officers assigned to traffic enforcement to complete the course within one year of their assignment and every 2 years thereafter. The bill would authorize a peace officer to complete other specified training courses, in lieu of this requirement. Because this bill would require additional training for local peace officers, it would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 13.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Alanis", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Alanis\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1814", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1814", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/10/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1814&version=20250AB181499INT", "media_type": "application/pdf"}], "date": "2026-02-10", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1814", "note": ""}], "extras": {"impact_clause": "An act to add Section 13519.16 to the Penal Code, relating to peace officers.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-18T09:02:52+00:00", "_id": "9b8e1b90-0ca8-11f1-b63b-c6889cfda9fe"}