{"legislative_session": "20252026", "identifier": "AB2172", "title": "Property taxation: county assessment appeals boards: assessment appeals commissioners.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Propertytaxation", "assessmentappealscommissioners", "countyassessmentappealsboards"], "abstracts": [{"note": "summary", "abstract": "Existing property tax law authorizes a county board of supervisors to create assessment appeals boards for the county to equalize the valuation of taxable property within the county for purposes of taxation. Existing property tax law requires an assessment appeals board to consist of 3 members or of 5 members acting as a 3-member panel, selected as specified. Existing law also sets forth minimum qualifications for a member of an assessment appeals board.\n\nThis bill, commencing January 1, 2027, and until January 1, 2034, would authorize the county board of supervisors to alternatively provide by ordinance that all property tax assessment appeals in the county be heard and decided by a single-member appeals board, the single member of which would be known as an assessment appeals commissioner. The bill would set forth minimum qualifications for the commissioner, as specified. The bill would require the State Board of Equalization to adopt rules and guidelines necessary to ensure consistent hearing procedures, public access, and decisionmaking standards for these commissioners. The bill would prohibit a commissioner from hearing any new appeals after December 31, 2031, but would permit the commissioner to continue to hear and decide appeals received after January 1, 2027, but on or before December 31, 2031, following December 31, 2031. This bill would additionally require, if a county authorizes commissioners to hear and decide assessment appeals, the county to provide a process by which the appellant may request that their appeal is heard by a 3- or 5-member board.\n\nThis bill would specify that, for purposes of implementing the bill's provisions with respect to other provisions relating to assessment appeals boards, a reference to an assessment appeals board also includes a single-member appeals board, as applicable, and a reference to member means a commissioner with respect to a single-member appeals board. The bill would make related findings and declarations."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Gipson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Gipson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2172", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2172", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2172&version=20250AB217299INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2172", "note": ""}], "extras": {"impact_clause": "An act to amend, repeal, and add Sections 1622 and 1622.1 of, and to add and repeal Sections 1620.5 and 1622.3 of, the Revenue and Taxation Code, relating to taxation.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:30+00:00", "_id": "1fb54fd6-0fcb-11f1-9ce2-72e66fa16e68"}