{"legislative_session": "20252026", "identifier": "AB1819", "title": "Automated external defibrillators.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Automatedexternaldefibrillators"], "abstracts": [{"note": "summary", "abstract": "Existing law requires specified occupied structures that are constructed on or after January 1, 2017, or constructed before that date and subject to subsequent modifications, to have an automated external defibrillator (AED) , as specified. Existing law requires a person or entity that acquires an AED to, among other things, notify an agent of the local emergency medical services agency of the existence, location, and type of AED acquired, ensure that the AED is maintained and tested according to the manufacturer's guidelines, and ensure that the AED is tested at least biannually and after each use. Existing law provides that a person or entity that acquires an AED is not liable for civil damages resulting from the act or omission in the rendering of emergency care if certain requirements relating to the operation and maintenance of an AED are met.\n\nThis bill would additionally require senior centers, including senior centers run by a local government, as defined, to have an AED. The bill would require a senior center to meet specified training and maintenance standards relating to the AED. The bill would provide that if a senior center employee uses, does not use, or attempts to use an AED, the employee and the members of the senior center's board of directors are not liable for civil damages, except in the case of personal injury or wrongful death that results from gross negligence or willful or wanton misconduct by the employee. The bill would provide that the owners, managers, employees, or otherwise responsible authorities of a senior center are not liable for civil damages resulting from an act or omission in the course of rendering emergency care or treatment, unless specified criteria are met. To the extent this bill imposes additional duties on a local government, this bill would create a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 13.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Sanchez", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Sanchez\"}", "organization_id": null}, {"name": "Dahle", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Dahle\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1819", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1819", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/10/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1819&version=20250AB181999INT", "media_type": "application/pdf"}], "date": "2026-02-10", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1819", "note": ""}], "extras": {"impact_clause": "An act to amend Section 19300 of, and to add Section 19301 to the Health and Safety Code, relating to public safety.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-12T09:00:58+00:00", "_id": "58fb97e6-07f1-11f1-8856-36e757393db5"}