{"legislative_session": "20252026", "identifier": "AB2468", "title": "School accountability: pupils with disabilities: inclusion.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Schoolaccountability", "inclusion", "pupilswithdisabilities"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes a single system for providing support to local educational agencies and schools and for specified federal educational programs. Existing law provides that the purpose of the statewide system of support is to build the capacity of local educational agencies, as specified.\n\nExisting law requires the State Department of Education and the California Collaborative for Educational Excellence to establish a process, administered by the department, to select, subject to approval by the executive director of the State Board of Education, an expert lead agency based on specific expertise in an area of need to conduct activities and build statewide capacity to address that area of need within the statewide system of support, as well as geographic lead agencies for other specified purposes, as provided.\n\nThis bill, contingent upon an appropriation for these purposes, commencing in the 2027–28 fiscal year, would require the California Collaborative for Educational Excellence, through one or two county offices of education designated by the collaborative, to administer the Supporting Innovative Practices project and to expand the project and build on its alignment and partnerships with statewide improvement initiatives. The bill would provide that the purposes of the project are, among others, to improve pupil outcomes by increasing opportunities for pupils with disabilities to access education in general education settings and to support the educator workforce to serve pupils with disabilities. The bill would require the project to conduct specified activities, including providing technical assistance to local educational agencies and charter schools focused on supporting evidence-based practices to increase access by pupils with disabilities to education in general education settings, and supporting progress toward a high school diploma for children and pupils with disabilities. The bill would authorize the department to contract with the collaborative for the project to provide technical assistance to local educational agencies and charter schools identified as not meeting state performance plan indicators, as provided. By imposing new duties on county offices of education, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Patel", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Patel\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2468", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2468", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2468&version=20250AB246899INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2468", "note": ""}], "extras": {"impact_clause": "An act to add Section 52073.6 to the Education Code, relating to school accountability.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:38+00:00", "_id": "24063668-0fcb-11f1-9ce2-72e66fa16e68"}