{"legislative_session": "20252026", "identifier": "AB2383", "title": "Electricity: large energy use facilities.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Electricity", "largeenergyusefacilities"], "abstracts": [{"note": "summary", "abstract": "Existing law vests the Public Utilities Commission with regulatory authority over public utilities, including electrical corporations. Existing law authorizes the commission to fix the rates and charges for every public utility and requires that those rates and charges be just and reasonable. Existing law authorizes the commission to investigate a single rate, classification, rule, contract, practice, or the entire schedule of rates, classifications, rules, contracts, and practices, of any public utility, and to establish new rates, classifications, rules, contracts, practices, or schedules. \n\nThis bill would require the commission, on or before January 1, 2028, in a new or existing proceeding, to provide for a classification of retail electricity consumers that are large energy use facilities, as defined, that is separate and distinct from classifications of service for other commercial or industrial retail electricity consumers and has its own rate schedule. The bill would require any rate schedule adopted by the commission for large energy use facilities to meet specified requirements, and would require the commission, in deciding whether to approve an electrical corporation's proposed rate schedule, to ensure the rates meet certain requirements, as provided. The bill would specify that, until January 1, 2028, an electrical corporation and a large energy use facility are not required to use the above-described classification of service if the commission has not approved the electrical corporation's rate schedule for that classification of service.\n\nThis bill would require the commission to require an electrical corporation that is providing electricity service to a large energy use facility to enter into a contract with the large energy use facility that covers the provision of transmission, generation, or distribution of electricity service, as applicable, and would require any contract entered into between an electrical corporation and a large energy use facility pursuant to these provisions to meet certain requirements. The bill would specify that these provisions apply to a large energy use facility that receives electricity service from an electrical corporation on or after January 1, 2027.\n\nUnder existing law, a violation of the Public Utilities Act or any order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause the above provisions would be a part of the act, and because a violation of a commission action implementing the above provisions would be a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Zbur", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Zbur\"}", "organization_id": null}, {"name": "Petrie-Norris", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Petrie-Norris\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2383", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2383", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2383&version=20250AB238399INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2383", "note": ""}], "extras": {"impact_clause": "An act to add Article 14.7 (commencing with Section 945) to Chapter 4 of Part 1 of Division 1 of, and to repeal Section 945.2 of, the Public Utilities Code, relating to electricity.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:36+00:00", "_id": "22cbc0b0-0fcb-11f1-9ce2-72e66fa16e68"}