{"legislative_session": "20252026", "identifier": "AB2042", "title": "Civil actions: setting aside default or default judgment.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Civilactions", "settingasidedefaultordefaultjudgment"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law permits a defendant in a debt enforcement action, brought by a buyer of consumer debt who has obtained a default or default judgment against the defendant, to file a motion to set aside the default or default judgment and for leave to defend the action if the defendant did not receive actual notice of the action in time to defend against it. Existing law requires such a motion to be filed within 6 years after entry of the default or default judgment or 180 days after the first actual notice of the action, or, in the case of identity theft or mistaken identity, within a reasonable amount of time but in no case later than 180 days after the first actual notice of the action.\n\nThis bill would clarify that a defendant who did not receive actual notice may file a motion to set aside and for leave to defend even if the service of the summons of the action was lawfully effected.\n\n(2) Existing law prescribes methods for the service of a summons in a civil action. Under existing law, a party that was not served in accordance with those methods may file a motion to set aside or vacate a default or default judgment and for leave to defend the action or move for dismissal. The party making such a motion is required to proffer evidence that service was not lawfully effected. This proffer rebuts the presumption of facts stated in the process server's return and place the burden of proving by a preponderance of the evidence that service of the summons and complaint was lawful on the party seeking the default or default judgment. Existing law makes these provisions operative on January 1, 2027.\n\nThis bill would clarify that the provisions described above apply to any proof of service filed on or after January 1, 2027, and that those provisions do not alter a court's existing authority to determine a motion for relief from a judgment that involves a proof of service filed before January 1, 2027. The bill would also clarify that a party who is not served may move for dismissal as permitted by existing law."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-17", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 20.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Kalra", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Kalra\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2042", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2042", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/17/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2042&version=20250AB204299INT", "media_type": "application/pdf"}], "date": "2026-02-17", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2042", "note": ""}], "extras": {"impact_clause": "An act to amend Section 1788.61 of the Civil Code, and to amend Section 473.2 of the Code of Civil Procedure, relating to civil actions.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:11+00:00", "_id": "a2037d7a-0f01-11f1-bd68-62084ebb1ff2"}