{"legislative_session": "20252026", "identifier": "AB2187", "title": "Public contracts: contracts for services.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Publiccontracts", "contractsforservices"], "abstracts": [{"note": "summary", "abstract": "Existing law that governs state acquisition of goods and services exempts certain consulting services contracts from advertising and bidding requirements, including contracts that can only be performed by a public entity, as defined. \n\nThis bill would additionally exempt contracts that can only be performed by a federally recognized California Native American tribe from the above-described advertising and bidding requirements.\n\nExisting law requires a state agency to secure at least 3 competitive bids or proposals for each contract for services. Existing law exempts specified contracts from this requirement, including a contract that is with, among other entities, another state agency, a local governmental entity, an auxiliary organization of the California State University, or an auxiliary organization of a California community college.\n\nThis bill would additionally exempt a contract that is with a federally recognized California Native American tribe from the above-described provisions and would authorize a federally recognized California Native American tribe to include a subcontract with any subdivision, subsidiary, or business enterprise wholly owned by a federally recognized California Native American tribe for the purpose of fulfilling an interagency agreements if the contracting federally recognized California Native American tribe provides a limited waiver of sovereign immunity and a justification of cost of service to show market equivalence of similar services. \n\nExisting law prohibits a person, firm, or subsidiary thereof that has been awarded a consulting services contract from submitting a bid for, or being awarded a contract for, the provision of services, the procurement of goods or supplies, or any other related action that is required, suggested, or otherwise deemed appropriate in the end product of the consulting services contract, with certain exceptions. \n\nThis bill would exempt California Native American tribes awarded a consulting services contract for tribal cultural resources purposes, as defined, from the above-described provisions."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ramos", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ramos\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2187", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2187", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2187&version=20250AB218799INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2187", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 10335.5, 10340, and 10365.5 of the Public Contract Code, relating to public contracts.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:13+00:00", "_id": "a39af410-0f01-11f1-bd68-62084ebb1ff2"}