{"legislative_session": "20252026", "identifier": "AB1570", "title": "Health care coverage: diagnostic imaging.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Healthcarecoverage", "diagnosticimaging"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Knox-Keene Health Care Service Plan Act of 1975, provides for the licensure and regulation of health care service plans by the Department of Managed Health Care, and makes a willful violation of the act a crime. Existing law provides for the regulation of health insurers by the Department of Insurance. Existing law requires a health care service plan contract issued, amended, delivered, or renewed on or after January 1, 2000, or an individual or group policy of disability insurance or self-insured employee welfare benefit plan to provide coverage for mammography for screening or diagnostic purposes upon referral by specified professionals. Under existing law, mammography performed pursuant to those requirements or that meets the current recommendations of the United States Preventive Services Task Force is provided to an enrollee or an insured without cost sharing.\n\nThis bill would require a health care service plan contract, a policy of health insurance that provides hospital, medical, or surgical coverage, or a self-insured employee welfare benefit plan issued, amended, or renewed on or after January 1, 2028, to provide coverage without imposing cost sharing for, among other things, screening mammography and medically necessary diagnostic breast imaging, including diagnostic breast imaging following an abnormal mammography result and for an enrollee or insured indicated to have a risk factor associated with breast cancer, except as specified.\n\n The California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 12.", "date": "2026-01-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Wilson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Wilson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1570", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1570", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1570&version=20250AB157099INT", "media_type": "application/pdf"}], "date": "2026-01-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1570", "note": ""}], "extras": {"impact_clause": "An act to amend Section 1367.65 of the Health and Safety Code, and to amend Section 10123.81 of the Insurance Code, relating to health care coverage.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-30T08:54:52+00:00", "_id": "57a0bee0-fdb9-11f0-8b06-feaf0b904648"}