{"legislative_session": "20252026", "identifier": "AB1906", "title": "Cervical cancer screening.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Cervicalcancerscreening"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Knox-Keene Health Care Service Plan Act of 1975, provides for the licensure and regulation of health care service plans by the Department of Managed Health Care, and makes a willful violation of the act a crime. Existing law provides for the regulation of health insurers by the Department of Insurance. Existing law requires a health care service plan contract or health insurance policy issued, amended, or renewed on or after January 1, 2002, to provide coverage for an annual cervical cancer screening test upon the referral of the patient's health care provider.\n\nExisting law provides for the Medi-Cal program, administered by the State Department of Health Care Services and under which health care services are provided to low-income individuals pursuant to a schedule of benefits. The Medi-Cal program is, in part, governed and funded by federal Medicaid program provisions. An annual cervical cancer test for screening or diagnostic purposes, upon the referral of a patient's physician, is a covered benefit under the Medi-Cal program to the extent required or permitted by federal law.\n\nThis bill would require a health care service plan contract or health insurance policy issued, amended, or renewed on or after January 1, 2027, to provide coverage without cost sharing for an annual cervical cancer screening home test kit upon the referral of the patient's health care provider. Because a willful violation of the bill's requirements relative to health care service plans would be a crime, the bill would impose a state-mandated local program. The bill would also include cervical cancer home test kits, upon the referral of a patient's health care provider, as a covered benefit under the Medi-Cal program on or after January 1, 2027, without cost sharing, to the extent required or permitted by federal law.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 15.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Aguiar-Curry", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Aguiar-Curry\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1906", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1906", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1906&version=20250AB190699INT", "media_type": "application/pdf"}], "date": "2026-02-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1906", "note": ""}], "extras": {"impact_clause": "An act to amend Section 1367.66 of the Health and Safety Code, to amend Section 10123.18 of the Insurance Code, and to amend Section 14132.17 of the Welfare and Institutions Code, relating to health care coverage.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-15T08:45:38+00:00", "_id": "b3b9f7c6-0a4a-11f1-8cce-128f59e91945"}