{"legislative_session": "20252026", "identifier": "SB997", "title": "North Fork Kings Groundwater Sustainability Agency: lien authority.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["NorthForkKingsGroundwaterSustainabilityAgency", "lienauthority"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Sustainable Groundwater Management Act, requires all groundwater basins designated as high- or medium-priority basins by the Department of Water Resources to be managed under a groundwater sustainability plan or coordinated groundwater sustainability plans, except as specified. The act authorizes any local agency or combination of local agencies overlying a groundwater basin to decide to become a groundwater sustainability agency for that basin. The act deems certain agencies created by statute to manage groundwater the exclusive local agencies within their respective statutory boundaries with powers to comply with the act and authorizes these agencies to opt out of being the exclusive groundwater management agency.\n\nExisting law establishes the North Fork Kings Groundwater Sustainability Agency, requires the agency to be a groundwater sustainability agency under the Sustainable Groundwater Management Act for that portion of the Kings Subbasin that lies within the boundaries of the agency, and requires the agency to develop and implement a groundwater sustainability plan to achieve sustainable groundwater management within the territory of the agency. Existing law generally specifies the powers of the agency, including the power to impose fees, including, but not limited to, permit fees and fees on groundwater extraction or other regulated activity, to fund the costs of a groundwater sustainability program.\n\nThis bill would authorize the agency to impose civil penalties on any person who extracts groundwater in excess of the amount that person is authorized to extract under a rule, regulation, ordinance, or resolution adopted by the agency. If any charges for water and other services, or civil penalties imposed by the agency pursuant to its authority, remain unpaid, the bill would authorize the amount of unpaid charges or penalties, in the discretion of the agency, to be secured at any time by filing for record in the office of the county recorder of any county a certificate specifying the amount of the charges or penalties and the name and address of the person liable for the charges. The bill would require that, from the time of recordation of the certificate, the amount required to be paid together with interest and penalties would constitute a lien upon all real property in the county owned by the person or afterwards, and before the lien expired, acquired by that person. The bill would require that the lien has the force, priority, and effect of a judgment lien, and that the lien shall continue for 10 years from the date of the filing of the certificate unless sooner released or otherwise discharged. The bill would also authorize the lien to be extended, as provided."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-09", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 12.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Caballero", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Caballero\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB997", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB997", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/09/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB997&version=20250SB99799INT", "media_type": "application/pdf"}], "date": "2026-02-09", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB997", "note": ""}], "extras": {"impact_clause": "An act to amend the heading of Article 8 (commencing with Section 801) of, and to add Sections 802 and 803 to, the North Fork Kings Groundwater Sustainability Agency (Chapter 392 of the Statutes of 2016), relating to groundwater agencies.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-18T09:02:21+00:00", "_id": "88fab7ae-0ca8-11f1-b63b-c6889cfda9fe"}