{"legislative_session": "20252026", "identifier": "AB1974", "title": "Firearms: voluntary firearm storage program.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Firearms", "voluntaryfirearmstorageprogram"], "abstracts": [{"note": "summary", "abstract": "Existing law requires a person, who claims title to a firearm that is in the custody of a court or law enforcement agency and wishes to have it returned, to make an application for a determination by the Department of Justice as to whether the applicant is eligible to possess a firearm. Under existing law, a law enforcement agency or court that has taken custody of a firearm is prohibited from returning the firearm to an individual unless specified requirements are met, including, but not limited to, requiring the person to be eligible to possess a firearm and verifying that the firearm is not listed as stolen and the firearm has been recorded in the Automated Firearms System in the name of the person, as specified. Existing law requires any weapon that was carried unlawfully for specified crimes to be surrendered to specified law enforcement entities. Existing law requires weapons surrendered pursuant to these provisions to be destroyed by the law enforcement entity.\n\nThis bill would authorize a law enforcement agency, as defined, to create a voluntary firearm storage program that allows a person to voluntarily transfer custody of their firearm to the local law enforcement agency for temporary safekeeping purposes to prevent firearm violence, suicide, and other injury. The bill would authorize a law enforcement agency adopting this program to provide clear instructions on the procedure to voluntarily transfer custody of a firearm and to provide explicit instructions on the process for requesting return of the firearm, as specified. Upon receipt of a firearm, the bill would authorize a law enforcement agency to, among other things, check a certain database to ensure the firearm has not previously been reported lost, stolen, or involved in a crime and ensure that the requesting person is eligible to possess firearms when the firearm is returned to the person. The bill would require a law enforcement agency to destroy a firearm that a person failed to retrieve at the end of a time period specified by the law enforcement agency."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 16.", "date": "2026-02-14", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Stefani", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Stefani\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1974", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1974", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/13/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1974&version=20250AB197499INT", "media_type": "application/pdf"}], "date": "2026-02-13", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1974", "note": ""}], "extras": {"impact_clause": "An act to add Section 25010 to the Penal Code, relating to firearms.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-19T09:00:59+00:00", "_id": "826df012-0d71-11f1-814c-2ab210762532"}