{"legislative_session": "20252026", "identifier": "AB1787", "title": "Electricity: rates: optional dynamic rate tariff.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Electricity", "optionaldynamicratetariff", "rates"], "abstracts": [{"note": "summary", "abstract": "Existing law vests the Public Utilities Commission with regulatory authority over public utilities, including electrical corporations. Existing law authorizes the commission to fix the rates and charges for every public utility and requires that those rates and charges be just and reasonable. Existing law requires each electrical corporation to identify a separate rate component to fund certain programs that enhance system reliability and provide in-state benefits, and requires that the rate component be a nonbypassable element of the local distribution service.\n\nThis bill would require a large electrical corporation, if the commission approves the large electrical corporation's request to upgrade its smart meter infrastructure and related information management and billing systems on or after January 1, 2027, to offer to each of its customers from whom the incremental costs of those upgrades are recovered at least one optional dynamic rate tariff upon the upgraded smart meter infrastructure being placed into service and its costs being recoverable in rates, as specified. The bill would prohibit the commission from approving a request of a large electrical corporation to recover costs associated with a smart meter infrastructure upgrade and related information management and billing systems costs unless specified conditions are met. The bill would require the commission, if it orders a large electrical corporation to implement an optional dynamic rate tariff, to ensure, among other things, the large electrical corporation makes the same time-varying transmission and distribution rates available to both bundled customers and unbundled customers located in the same geographic area.\n\nUnder existing law, a violation of the Public Utilities Act or an order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause the above provisions would be part of the act and a violation of a commission action implementing this bill's requirements would be a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 13.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Irwin", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Irwin\"}", "organization_id": null}, {"name": "Schultz", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Schultz\"}", "organization_id": null}, {"name": "Rogers", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Rogers\"}", "organization_id": null}, {"name": "Stern", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Stern\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1787", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1787", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/10/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1787&version=20250AB178799INT", "media_type": "application/pdf"}], "date": "2026-02-10", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1787", "note": ""}], "extras": {"impact_clause": "An act to add Section 729.3 to the Public Utilities Code, relating to electricity.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:22+00:00", "_id": "1a7d60da-0fcb-11f1-9ce2-72e66fa16e68"}