{"legislative_session": "20252026", "identifier": "SB1311", "title": "Dentistry: dental assistants: infection control course.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Dentistry", "dentalassistants", "infectioncontrolcourse"], "abstracts": [{"note": "summary", "abstract": "The Dental Practice Act establishes the Dental Board of California to license and regulate the practice of dentistry. Existing law requires the board to license and regulate dental auxiliaries, including, among others, dental assistants, as defined, and sets forth duties and functions that those dental auxiliaries are authorized to perform. Existing law requires an unlicensed dental assistant not enrolled in a board-approved program for registered dental assisting or an alternative dental assisting program to complete an infection control certification course, as specified. In this regard, existing law allows the unlicensed dental assistant to complete a board-approved 8-hour course, with 6 hours being didactic instruction and 2 hours being laboratory instruction, as specified.\n\nThis bill would allow an unlicensed dental assistant to complete the Dental Assisting National Board's Infection Control examination instead of completing an infection control course. The bill would also revise the requirements for those infection control courses to allow an unlicensed dental assistant to complete one of specified courses approved by the board or a course with at least 4 hours of didactic instruction and at least 2 hours of laboratory instruction using video or a series of video training tools, as specified.\n\nExisting law makes the employer of a dental assistant responsible for ensuring that the dental assistant has successfully completed a board-approved 8-hour course in infection control before performing any basic supportive dental procedures involving potential exposure to blood, saliva, or other potentially infectious material.\n\nThis bill would instead require the employer to ensure the dental assistant has successfully completed a course or examination in infection control, as described above, before performing those procedures.\n\nThis bill would declare that it is to take effect immediately as an urgency statute."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Wahab", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Wahab\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1311", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1311", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1311&version=20250SB131199INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1311", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 1750 and 1755 of the Business and Professions Code, relating to healing arts, and declaring the urgency thereof, to take effect immediately.", "tags": ["fiscal committee", "urgency"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:43:59+00:00", "_id": "76f14734-0f01-11f1-bd68-62084ebb1ff2"}