{"legislative_session": "20252026", "identifier": "AB2084", "title": "Corporation Tax Law: tax-exempt organizations: revocation of tax-exempt status.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CorporationTaxLaw", "revocationoftax-exemptstatus", "tax-exemptorganizations"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Corporation Tax Law, exempts organizations that are organized and operated for nonprofit purposes, as specified, from taxes imposed by that law if the Franchise Tax Board issues a determination exempting the organization from tax, except as provided. To receive a determination of exemption from the board, existing law requires the organization to either submit an application for exemption or to submit documentation of exemption from federal income tax law, as provided. For organizations that submit documentation of their federal exemption, existing law requires the board to suspend or revoke, as applicable, an organization's state exemption upon notification that the organization's federal exemption is suspended or revoked.\n\nThis bill, in the case of a revocation of an organization's federal tax-exempt status, would instead require the board to provide written notice of its intent to revoke upon notification that the organization's federal exemption is revoked. The bill would provide an organization that has received this notice a 90-day period to cure by submitting either evidence that the federal revocation was in error or reinstated or by submitting an application for exemption independent of federal exemption. The bill would provide that an organization that makes a submission within the 90-day period to cure maintains their state exemption until a final determination by the board. If the organization does not make a submission or the board denies the submission, the bill would require the board to revoke the organization's state exemption."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Bauer-Kahan", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bauer-Kahan\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2084", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2084", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2084&version=20250AB208499INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2084", "note": ""}], "extras": {"impact_clause": "An act to amend Section 23701 of the Revenue and Taxation Code, relating to taxation.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-19T09:01:01+00:00", "_id": "8379f136-0d71-11f1-814c-2ab210762532"}