{"legislative_session": "20252026", "identifier": "SB1142", "title": "Digital Dignity Act.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["DigitalDignityAct"], "abstracts": [{"note": "summary", "abstract": "Existing law prohibits the false impersonation of another person in either their personal or official capacity with the intent to steal or defraud, as specified. Existing law protects all people from defamation, including libel and slander, as provided. Existing law makes any person who knowingly uses another's name, voice, signature, photograph, or likeness for commercial purposes, as specified, without that person's prior consent liable for damages, as specified. Existing law provides that a party seeking relief pursuant to those provisions may also seek an injunction or temporary restraining order according to specified procedures.\n\nThis bill would enact the Digital Dignity Act and would clarify that false impersonation includes the use of a digital replica, as defined, with the intent to impersonate another for purposes of prescribed criminal provisions. The act would subject a person who, by distributing content with actual knowledge that the content includes the use of a digital replica, violates the prescribed criminal provisions, is found liable for defamation in a civil action, or uses another's name, voice, signature, photograph, or likeness for commercial purposes to additional specified liability, as provided.\n\nThe Digital Dignity Act would require a product, service, internet website, or application that is both a generative AI tool and a large online platform that allows users to create a digital replica of other individuals to implement and maintain a mechanism by which users can revoke access to their digital replica created by other people using the large online platform's generative AI tool at any time, as prescribed. The act would authorize a city attorney or the Attorney General to bring a civil action to enforce these provisions and to seek a specified civil penalty and injunctive relief. The act would require a generative AI tool provider to maintain, for no less than 90 days, records sufficient to allow compliance with a court order issued pursuant to a civil action by the city attorney or Attorney General, as prescribed."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Becker", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Becker\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1142", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1142", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1142&version=20250SB114299INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1142", "note": ""}], "extras": {"impact_clause": "An act to add Chapter 22.6.1 (commencing with Section 22650) to Division 8 of the Business and Professions Code, to amend Sections 3344 and 3344.1 of, and to add Section 3344.2 to, the Civil Code, and to add Chapter 9 (commencing with Section 540) to Title 13 of Part 1 of the Penal Code, relating to personal rights.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:56:48+00:00", "_id": "1737fc06-0e3a-11f1-a618-2a6200350f1a"}