{"legislative_session": "20252026", "identifier": "AB2769", "title": "Adoption Assistance Program: eligibility.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["AdoptionAssistanceProgram", "eligibility"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Adoption Assistance Program (AAP) for the purpose of benefiting children residing in foster homes by providing the stability and security of permanent homes. Under existing law, a child is eligible for AAP benefits if they meet, among other requirements, an age requirement wherein the child is (1) under 18 years of age, (2) under 21 years of age with a mental or physical handicap, or (3) under 21 years of age, has attained 16 years of age before the adoption assistance agreement became effective, and one or more of specified conditions are met.\n\nThis bill would add a 4th age eligibility category for a nonminor who is 18 years of age, is under an adoption assistance agreement that became effective before the nonminor's 16th birthday, was, prior to attaining 18 years of age, attending high school or the equivalent level of vocational or technical training on a full-time basis or pursuing a high school equivalency certificate, continues in such attendance, continues to reside with the adoptive parent, and remains otherwise eligible. This bill would make that nonminor age eligible until the date of completion of the program they are attending or the nonminor's 19th birthday, whichever occurs first. The bill would, to the extent that federal financial participation is unavailable for adoption assistance payments continued pursuant to this eligibility expansion, require the department to ensure that state-realigned funding is available for those payments, as specified. By expanding eligibility of a county-administered program, thereby imposing duties on counties, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Ahrens", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ahrens\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2769", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2769", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2769&version=20250AB276999INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2769", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 16120 and 16123 of the Welfare and Institutions Code, relating to public social services.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:45+00:00", "_id": "286bfc7e-0fcb-11f1-9ce2-72e66fa16e68"}