{"legislative_session": "20252026", "identifier": "AB2563", "title": "Sex discrimination: scope.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Sexdiscrimination", "scope"], "abstracts": [{"note": "summary", "abstract": "(1) The United States and California Constitutions guarantee all persons the right to equal protection of the laws. The California Constitution further recognizes the right of all persons to pursue and obtain safety, happiness, and privacy, guarantees an individual's reproductive freedom in their most intimate decisions, and prohibits disqualification of a person from entering or pursuing a business, profession, vocation, or employment because of, among other things, sex.\n\nThis bill would require, under all state laws, that any provision that prohibits discrimination on the basis of sex, discrimination on the basis of gender, or similar discrimination be interpreted to prohibit sex discrimination. The bill would define \"sex discrimination\" to include, among other things, discrimination based on any of specified actual or perceived characteristics or actions, including based on degree of conformity to sex or gender stereotypes.\n\nThis bill would provide that this interpretation reflects the existing protections of specified state constitutional laws, as described above. The bill would require these provisions to be liberally construed to effectuate the purposes of these constitutional protections.\n\n(2) Existing law, the Unruh Civil Rights Act (act) , provides that all persons within the jurisdiction of this state are entitled to full and equal accommodations, advantages, facilities, privileges, or services in all business establishments regardless of their sex, race, color, religion, ancestry, national origin, disability status, medical condition, genetic information, marital status, sexual orientation, citizenship, primary language, or immigration status. That act defines \"sex\" to include, among other things, pregnancy, childbirth, or medical conditions related to pregnancy or childbirth.\n\nThis bill would further define, for purposes of the act, \"sex\" to include any actual or perceived characteristics set forth under the above-described definition of \"sex discrimination.\"\n\n(3) Existing law, the California Fair Employment and Housing Act (FEHA) , makes certain discriminatory employment and housing practices unlawful, and authorizes a person claiming to be aggrieved by an alleged unlawful practice to file a verified complaint with the Civil Rights Department. The FEHA defines various terms in connection with unlawful practices, including the term \"sex.\"\n\nThis bill would further define \"sex\" to include any actual or perceived characteristics set forth under the above-described definition of \"sex discrimination.\""}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Pacheco", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Pacheco\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2563", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2563", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2563&version=20250AB256399INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2563", "note": ""}], "extras": {"impact_clause": "An act to add Section 14.3 to the Business and Professions Code, to amend Section 51 of, and to add Section 14.1 to, the Civil Code, to add Section 17.5 to the Code of Civil Procedure, to add Section 1207 to the Commercial Code, to add Section 12.4 to the Corporations Code, to add Section 212.4 to the Education Code, to add Section 353.7 to the Elections Code, to add Section 212 to the Evidence Code, to add Section 136 to the Family Code, to add Section 23 to the Financial Code, to add Section 9.4 to the Fish and Game Code, to add Section 52 to the Food and Agricultural Code, to amend Section 12926 of, and to add Section 27 to, the Government Code, to add Section 26 to the Harbors and Navigation Code, to add Section 29 to the Health and Safety Code, to add Section 49 to the Insurance Code, to add Section 12.3 to the Labor Code, to add Section 20 to the Military and Veterans Code, to add Section 5.5 to the Penal Code, to add Section\n\t 71 to the Probate Code, to add Section 1105 to the Public Contract Code, to add Section 19 to the Public Resources Code, to add Section 23 to the Public Utilities Code, to add Section 12.3 to the Revenue and Taxation Code, to add Section 37 to the Streets and Highways Code, to add Section 23 to the Unemployment Insurance Code, to add Section 552 to the Vehicle Code, to add Section 27 to the Water Code, and to add Section 28 to the Welfare and Institutions Code, relating to sex discrimination.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:40+00:00", "_id": "257e8928-0fcb-11f1-9ce2-72e66fa16e68"}