{"legislative_session": "20252026", "identifier": "AB1660", "title": "Public guardians and public administrators.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Publicguardiansandpublicadministrators"], "abstracts": [{"note": "summary", "abstract": "Existing law requires a public guardian to apply for appointment as a guardian or conservator of the person, the estate, or the person and estate, if there is an imminent threat to a person's health or safety or the person's estate, there is no one else who is qualified and willing to act, as specified, the appointment would be in the best interests of the person, and the person is domiciled in the county. Existing law similarly requires a court to order a public guardian of a county to apply for appointment as a guardian or conservator if it appears that there is no one else who is qualified and willing to act, that the appointment as guardian or conservator appears to be in the best interests of the person, and the person is domiciled in the county. Existing law grants public guardians a variety of powers, including the right to take control of real or personal property, issue written certification of this fact, and to restrain any person from entering, encumbering, or disposing of any real or personal property held in a trust, as specified. Existing law requires a financial institution or other person, without inquiring into the truth of the written certification and without court order or letters being issued, to provide the public guardian or public conservator with specified information and to take specified actions.\n\nExisting law establishes the public administrator as an officer of a county. Existing law regulates the administration of estates of decedents and permits the public administrator to be appointed to administer these estates under certain circumstances. Existing law grants public administrators a variety of powers in this regard, including the right to take control of a decedent's property, issue written certification of this fact, and summarily dispose of property, as specified. Existing law requires a financial institution, government or private agency, retirement fund administrator, insurance company, licensed securities dealer, or other person, without inquiring into the truth of the written certification, without requiring a death certificate, without charge, and without court order or letters being issued, to perform specified functions, including providing the public administrator complete information concerning property held in the name of the decedent, including names and addresses of beneficiaries or joint owners, as specified.\n\nThis bill would require a court to award sanctions of no less than $1,000 per violation for fees paid and costs incurred for failure of a financial institution, government or private agency, retirement fund administrator, insurance company, licensed securities dealer, or other person, as specified, to comply with these requirements."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-29", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 1.", "date": "2026-01-30", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Schiavo", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Schiavo\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1660", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1660", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/29/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1660&version=20250AB166099INT", "media_type": "application/pdf"}], "date": "2026-01-29", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1660", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 2901, 2901.5, 7603, and 7660 and of the Probate Code, relating to probate.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-02T08:57:53+00:00", "_id": "424ef1de-0015-11f1-9492-2aa782526795"}