{"legislative_session": "20252026", "identifier": "AB1612", "title": "Incineration of controlled substances: California Environmental Quality Act: law enforcement exemption.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaEnvironmentalQualityAct", "Incinerationofcontrolledsubstances", "lawenforcementexemption"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Uniform Controlled Substances Act, authorizes the forfeiture and seizure of property involved in, or purchased with the proceeds from, a controlled substance offense. \n\nThe California Environmental Quality Act (CEQA) requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of, an environmental impact report on a project that it proposes to carry out or approve that may have a significant effect on the environment or to adopt a negative declaration if it finds that the project will not have that effect. CEQA also requires a lead agency to prepare a mitigated negative declaration for a project that may have a significant effect on the environment if revisions in the project would avoid or mitigate that effect and there is no substantial evidence that the project, as revised, would have a significant effect on the environment. \n\nThis bill would authorize a local police department, sheriff's office, or state law enforcement agency to purchase and install an incinerator for the sole purpose of destroying seized controlled substances, as provided. The bill would require the local police department, sheriff's office, or state law enforcement agency to follow specified federal regulations and to notify the State Air Resources Board and the local air quality management district or local air pollution control district of the project, as specified. The bill would authorize multiple law enforcement agencies to purchase and install an incinerator for these purposes through a memorandum of understanding that details cost sharing. The bill would exempt a project to purchase and install an incinerator that complies with these requirements from CEQA. Because a lead agency would be required to determine the applicability of this exemption, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 21.", "date": "2026-01-22", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Alanis", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Alanis\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1612", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1612", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/21/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1612&version=20250AB161299INT", "media_type": "application/pdf"}], "date": "2026-01-21", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1612", "note": ""}], "extras": {"impact_clause": "An act to add Article 7.5 (commencing with Section 41984) to Chapter 3 of Part 4 of Division 26 of the Health and Safety Code, and to add Section 21080.82 to the Public Resources Code, relating to environmental hazards.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-24T08:41:04+00:00", "_id": "6b23b7b4-f900-11f0-8337-c6b6702feb4c"}