{"legislative_session": "20252026", "identifier": "AB2573", "title": "Voter registration information: elected officials and candidates.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Voterregistrationinformation", "electedofficialsandcandidates"], "abstracts": [{"note": "summary", "abstract": "Under existing law, the residence address, telephone number, and email address of a registered voter is confidential, except that under certain circumstances a county elections official must disclose that information to any candidate for federal, state, or local office, to any committee for or against any initiative or referendum measure, and to any person for election, scholarly, journalistic, political, or governmental purposes. Existing law exempts from that disclosure requirement the residence address, telephone number, and email address of a federal, state, or local elected official or candidate, unless the official or candidate opts out or the information is sought for bona fide journalistic or governmental purposes.\n\nThis bill would recast the provisions creating that exemption. The bill would permit the information of an elected official or candidate's immediate family member who lives at the same residence to be made confidential. For an elected official or candidate's residence address, telephone number, and email address to be confidential, the elected official or candidate would have to make a written request to the county elections official and, for a candidate, qualify to appear on the ballot. The bill would require the Secretary of State to notify county elections officials when a state or federal candidate qualifies to appear on the ballot, and it would require county elections officials to notify the Secretary of State under certain circumstances if the confidential designation is added to, or removed from, a federal or state elected official or candidate's voter registration record. The Secretary of State and county elections officials would be required to implement the provisions creating the exemption immediately once the statewide voter registration database and county election management systems have made conforming changes, but the bill states that it does not authorize any reduction in current, ongoing implementation efforts. To the extent the bill imposes additional requirements on local elections officials, the bill imposes a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Sharp-Collins", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Sharp-Collins\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2573", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2573", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2573&version=20250AB257399INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2573", "note": ""}], "extras": {"impact_clause": "An act to amend Section 2166.9 of the Elections Code, relating to elections.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:21+00:00", "_id": "a861cfd2-0f01-11f1-bd68-62084ebb1ff2"}