{"legislative_session": "20252026", "identifier": "SB903", "title": "Mental health professionals: artificial intelligence.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Mentalhealthprofessionals", "artificialintelligence"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Board of Behavioral Sciences in the Department of Consumer Affairs to regulate licensees under the Licensed Marriage and Family Therapist Act, the Educational Psychologist Practice Act, the Clinical Social Worker Practice Act, and the Licensed Professional Clinical Counselor Act. \n\nExisting law regulates the use of artificial intelligence, as defined. Existing law requires a health facility, clinic, physician's office, or office of a group practice that uses generative artificial intelligence to generate written or verbal patient communications pertaining to patient clinical information to ensure those communications include a disclaimer that indicates to the patient that a communication was generated by artificial intelligence and instructions describing how a patient may contact a human health care provider, employee, or other appropriate person. \n\nThis bill would prohibit a licensed professional, as defined, from engaging in the use of artificial intelligence to assist in providing supplementary support in therapy or psychotherapy where the client's therapeutic session is recorded or transcribed unless the patient or their authorized representative is informed that artificial intelligence will be used and provides consent, as specified. The bill would also prohibit an individual, corporation, or entity from providing, advertising, or otherwise offering therapy or psychotherapy, including through the use of internet-based artificial intelligence, to the public in this state unless the therapy or psychotherapy services are conducted by an individual who is a licensed professional. The bill would additionally prohibit a licensed professional from allowing artificial intelligence to make independent therapeutic decisions or take other specified actions related to communications with clients, as specified. The bill would authorize the department to investigate actual, alleged, or suspected violations of these provisions and impose civil penalties, as prescribed."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-01-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after February 21.", "date": "2026-01-22", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Padilla", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Padilla\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB903", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB903", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/21/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB903&version=20250SB90399INT", "media_type": "application/pdf"}], "date": "2026-01-21", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB903", "note": ""}], "extras": {"impact_clause": "An act to add Chapter 13.6 (commencing with Section 4989.80) to Division 2 of the Business and Professions Code, relating to healing arts.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-16T09:01:42+00:00", "_id": "1ceb62b8-0b16-11f1-8107-d26818b831da"}