{"legislative_session": "20252026", "identifier": "SB1069", "title": "Motor vehicle pollution control devices: aftermarket parts: approval process.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Motorvehiclepollutioncontroldevices", "aftermarketparts", "approvalprocess"], "abstracts": [{"note": "summary", "abstract": "Existing law prohibits the disconnection, modification, or alteration of required motor vehicle pollution control devices, except with respect to an alteration, modification, or modifying device, apparatus, or mechanism that is covered by a resolution of the State Air Resources Board that makes specified findings. Existing law requires the state board to undertake a public process to review the existing procedures for exempting parts under those resolutions with the goal of streamlining the process for issuing executive orders. Existing law authorizes the state board to adopt a schedule of fees to cover all or a portion of the state board's reasonable costs for the certification, audit, and compliance of aftermarket parts sold in the state, as specified.\n\nThis bill would require the state board, within 30 days of the receipt of an application for the issuance of an executive order to exempt an aftermarket part and any associated fees, to determine whether the application is complete and, within 60 days of determining that an application is complete, to approve or deny the application, as specified. The bill would require the state board to approve or deny an amended application within 30 days of the denial of the original application. If the state board does not approve or deny an application within those timelines, the bill would require the state board to refund the applicant 50% of any fee collected for the application. The bill would also require the state board to submit a report to the Legislature on review and issuance timelines for executive orders issued to exempt aftermarket parts on or before March 1, 2028, and biennially thereafter until March 1, 2034."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}], "sponsorships": [{"name": "Grayson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Grayson\"}", "organization_id": null}, {"name": "Cortese", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Cortese\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1069", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1069", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/13/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1069&version=20250SB106999INT", "media_type": "application/pdf"}], "date": "2026-02-13", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1069", "note": ""}], "extras": {"impact_clause": "An act to add Section 43019.4 to, and to add and repeal Section 43019.5 of, the Health and Safety Code, relating to air pollution.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-15T08:44:33+00:00", "_id": "8d0574fc-0a4a-11f1-8cce-128f59e91945"}