{"legislative_session": "20252026", "identifier": "AB2301", "title": "Community colleges: Baccalaureate Degree in Nursing Pilot Program.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["BaccalaureateDegreeinNursingPilotProgram", "Communitycolleges"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the California Community Colleges, under the administration of the Board of Governors of the California Community Colleges. Existing law establishes community college districts throughout the state, under the administration of community college district governing boards, and authorizes these districts to provide instruction at the community college campuses they operate. Existing law establishes a statewide baccalaureate degree program that authorizes up to a total of 30 baccalaureate degree programs at community college districts to be approved per academic year, as provided.\n\nThis bill would require the office of the Chancellor of the California Community Colleges to develop a Baccalaureate Degree in Nursing Pilot Program that authorizes select community college districts to offer a Bachelor of Science in Nursing degree. The bill would limit the pilot program to 10 community college districts statewide and would require the chancellor's office to identify and select eligible community college districts based on specified criteria. The bill would require the chancellor's office to develop a process designed to assist community college districts with nursing programs that are applying for national accreditation for the purpose of qualifying for the pilot program, as provided. The bill would require each participating community college district to give priority registration for enrollment in the pilot program to students with an associate degree in nursing from that community college district. The bill would require the Legislative Analyst's Office to conduct an evaluation of the pilot program to determine the effectiveness of the program and the need to continue or expand the program, as specified, to be submitted to the Legislature on or before July 1, 2034. The bill would repeal these provisions as of January 1, 2036."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Soria", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Soria\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2301", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2301", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2301&version=20250AB230199INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2301", "note": ""}], "extras": {"impact_clause": "An act to add and repeal Article 3.2 (commencing with Section 78045) of Chapter 1 of Part 48 of Division 7 of Title 3 of the Education Code, relating to postsecondary education.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:58:01+00:00", "_id": "42d55dea-0e3a-11f1-a618-2a6200350f1a"}