{"legislative_session": "20252026", "identifier": "SB1373", "title": "Mental health diversion.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Mentalhealthdiversion"], "abstracts": [{"note": "summary", "abstract": "Existing law authorizes the court to grant pretrial diversion to a defendant diagnosed with a mental disorder if the defendant satisfies certain eligibility requirements and if the court determines that the defendant is suitable for diversion. Existing law provides that a defendant is eligible for diversion if they have been diagnosed with certain mental disorders and the court finds that the mental disorder was a significant factor in the commission of the charged offense, unless there is clear and convincing evidence that the disorder was not a motivating, causal, or contributing factor to the defendant's involvement in the alleged offense. Existing law excludes a defendant from diversion for specified charged offenses, including, among others, murder, voluntary manslaughter, rape, or continuous sexual abuse of a child, as specified.\n\nThis bill would require the court to find that the defendant's mental disorder was a significant factor in the commission of the offense only if the mental disorder had been diagnosed within 5 years of the current offense. The bill would add to the list of crimes for which a defendant is prohibited from being placed into a diversion program to include, among other things, attempted murder, kidnapping, carjacking, and human trafficking and would prohibit a defendant with 2 prior felonies or a prior offense under the Three Strikes provisions from being granted diversion.\n\nExisting law makes a defendant suitable for this diversion program if, among other criteria, the defendant will not pose an unreasonable risk of danger to public safety if treated in the community, as specified.\n\nThe bill would instead make the defendant suitable for diversion if they do not pose a risk of danger to public safety and would add to the list of things the court may specifically consider in making that determination, including the defendant's prior history in a pretrial diversion plan and the severity of injury to the victim. The bill would authorize a court to deny diversion if it finds that it is more likely than not that the defendant, if treated in the community, will pose a risk of danger to public safety.\n\nExisting law authorizes a court to require the defendant to make a prima facie showing that they will meet the minimum requirements of eligibility for diversion and that the defendant and the offense are suitable for diversion and authorizes the court, if that showing is not made, to summarily deny diversion and grant alternate relief.\n\nThis bill, if the court intends to summarily grant diversion or any other relief, would require the court to conduct an additional hearing. By increasing the duties on local prosecutors, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Grove", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Grove\"}", "organization_id": null}, {"name": "Niello", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Niello\"}", "organization_id": null}, {"name": "Rubio", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Rubio\"}", "organization_id": null}, {"name": "Krell", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Krell\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1373", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1373", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1373&version=20250SB137399INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1373", "note": ""}], "extras": {"impact_clause": "An act to amend Section 1001.36 of the Penal Code, relating to criminal procedure.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:06+00:00", "_id": "ed1198a0-0fca-11f1-9ce2-72e66fa16e68"}