{"legislative_session": "20252026", "identifier": "AB685", "title": "Los Angeles and Ventura Wildfire Small Business Recovery Act.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill", "appropriation"], "subject": ["LosAngelesandVenturaWildfireSmallBusinessRecoveryAct"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Office of Small Business Advocate (OSBA) within the Governor's Office of Business and Economic Development, also known as GO-Biz, to advocate for causes of small business and to provide small businesses with the information they need to survive in the marketplace. Existing law also establishes the California Small Business Technical Assistance Program (SB-TAP) within OSBA, under the direct authority of the Small Business Advocate, for the purpose of assisting small businesses through free or low-cost one-on-one consulting and low-cost training by entering into grant agreements with one or more small business technical assistance centers. Under existing law, OSBA administers the Capital Infusion Program (CIP) pursuant to the SB-TAP, as specified.\n\nThis bill would establish the Los Angeles and Ventura Wildfire Small Business Recovery Act to provide assistance to small businesses directly impacted by the January 2025 wildfires in the Counties of Los Angeles and Ventura. For this purpose, the bill would appropriate $50,000,000 from the General Fund to the Los Angeles and Ventura Wildfire Small Business Recovery Fund, which the bill would create in the State Treasury. The bill would require OSBA to administer the fund and to allocate moneys in the fund to both the CIP and the SB-TAP. The bill would also require OSBA to establish a separate program to provide relief for employees of small businesses directly impacted by those wildfires. The bill would require Go-Biz to submit a report to the Legislature detailing the allocation and expenditure of funds pursuant to these provisions and would repeal the act on January 1, 2031.\n\nThe bill would make legislative findings and declarations as to the necessity of a special statute for the Counties of Los Angeles and Ventura.\n\nThis bill would declare that it is to take effect immediately as an urgency statute."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2025-02-14", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 17.", "date": "2025-02-15", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Referred to Com. on E.D., G., & H.I.", "date": "2025-03-03", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on E.D., G., & H.I.", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Solache", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Solache\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB685", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB685", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/14/25 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB685&version=20250AB68599INT", "media_type": "application/pdf"}], "date": "2025-02-14", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB685", "note": ""}], "extras": {"impact_clause": "An act to add and repeal Article 7.5 (commencing with Section 12100.70) of Chapter 1.6 of Part 2 of Division 3 of Title 2 of the Government Code, relating to economic recovery, making an appropriation therefor, and declaring the urgency thereof, to take effect immediately.", "tags": ["fiscal committee", "urgency"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2025-12-14T23:38:11+00:00", "_id": "f38b50ce-d945-11f0-bb80-a2dc17e61576"}