{"legislative_session": "20252026", "identifier": "AB2493", "title": "Electrical corporations: interconnection: transmission: auditor.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Electricalcorporations", "auditor", "interconnection", "transmission"], "abstracts": [{"note": "summary", "abstract": "Existing law vests the Public Utilities Commission with regulatory authority over public utilities, including electrical corporations. Existing law requires the commission, if it determines that the rules, practices, equipment, appliances, facilities, or service of a public utility, or the methods of manufacture, distribution, transmission, storage, or supply used by the public utility, are unjust, unreasonable, unsafe, improper, inadequate, or insufficient, to determine and fix the rules, practices, equipment, appliances, facilities, service, or methods to be observed, furnished, constructed, enforced, or employed. \n\nThis bill would require the commission to require each electrical corporation to retain an independent third-party auditor to review certain transmission- and interconnection-related submissions made by the electrical corporation, the electrical corporation's progress on completing network upgrades following approval in a generator interconnection agreement or transmission plan approved by the Independent System Operator, and the electrical corporation's compliance with any remedial actions ordered by the commission, as specified. The bill would require the third-party auditor to report to the commission on an annual basis, as provided. Within 90 days of receiving the auditor's report, the bill would require the commission to issue a resolution directing an electrical corporation to take remedial actions necessary to address any deficiencies identified by the auditor, as specified.\n\nUnder existing law, a violation of the Public Utilities Act or any order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause the above-described provisions would be part of the act and a violation of a commission action implementing the above-described provisions would be a crime, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Petrie-Norris", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Petrie-Norris\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2493", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2493", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2493&version=20250AB249399INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2493", "note": ""}], "extras": {"impact_clause": "An act to add Section 769.4 to the Public Utilities Code, relating to electricity.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:20+00:00", "_id": "a760928a-0f01-11f1-bd68-62084ebb1ff2"}