{"legislative_session": "20252026", "identifier": "AB1746", "title": "CalWORKs: childcare request forms.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CalWORKs", "childcarerequestforms"], "abstracts": [{"note": "summary", "abstract": "Existing federal law provides for allocation of federal funds through the federal Temporary Assistance for Needy Families (TANF) block grant program to eligible states. Existing law provides for the California Work Opportunity and Responsibility to Kids (CalWORKs) program, under which, through a combination of state and county funds and federal funds received through the TANF program, each county provides cash assistance and other benefits to qualified low-income families. Existing law provides for state-subsidized childcare programs and childcare for recipients of benefits under the CalWORKs program and establishes 3 stages of childcare services managed by county welfare departments and agencies contracting with the State Department of Social Services.\n\nExisting law requires an applicant for, or a recipient of, CalWORKs benefits to be provided written notice, both at the time of application and when they sign an original or amended welfare-to-work plan, informing them of, among other things, the availability of paid childcare to allow them to be employed or participate in welfare-to-work activities. Existing law requires an applicant for, or recipient of, CalWORKs benefits to be asked to sign a copy of the written notice acknowledging that they have been informed of and received the notice, as specified.\n\nThis bill would instead require a county to provide an applicant for, or a recipient of, CalWORKs benefits with a CalWORKs childcare request form, as specified, at various times, including, among others, at the time of application, upon approval for CalWORKs benefits, and each time they are provided with an annual certificate of eligibility. The bill would require a county, upon receipt, to approve or deny the above-described childcare request form within 10 working days. The bill would require an applicant for, or recipient of, CalWORKs benefits to be asked to sign a copy of the form acknowledging that they have been informed of and received the form, as specified. The bill would make other conforming changes related to replacing the written notice with the form. The bill would require the department to implement these provisions through an all-county letter or similar instruction on or before June 1, 2027, until regulations are adopted. By imposing additional duties on counties, the bill would impose a state-mandated local program. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 12.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Davies", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Davies\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1746", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1746", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/09/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1746&version=20250AB174699INT", "media_type": "application/pdf"}], "date": "2026-02-09", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1746", "note": ""}], "extras": {"impact_clause": "An act to amend Section 11323.3 of the Welfare and Institutions Code, relating to CalWORKs.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-18T09:02:51+00:00", "_id": "9aea17c0-0ca8-11f1-b63b-c6889cfda9fe"}