{"legislative_session": "20252026", "identifier": "AB2417", "title": "Community colleges: part-time faculty: retirement.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Communitycolleges", "part-timefaculty", "retirement"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the California Community Colleges, administered by the Board of Governors of the California Community Colleges, as one of the segments of public postsecondary education in the state. Existing law requires the board to appoint a chief executive officer, known as the Chancellor of the California Community Colleges. Existing law establishes community college districts throughout the state, under the administration of community college district governing boards, and authorizes these districts to provide instruction at the community college campuses they operate.\n\nExisting law, the Teachers' Retirement Law, establishes the State Teachers' Retirement System (STRS) and creates the Defined Benefit Program of the State Teachers' Retirement Plan, which provides a defined benefit to members of the program, based on final compensation, credited service, and age at retirement, subject to certain variations. STRS is administered by the Teachers' Retirement Board. Existing law also creates the Cash Balance Benefit Program, which is administered by the board, to provide a retirement plan for the benefit of participating employees who provide creditable service for less than 50% of full time.\n\nExisting federal law requires public employers, which includes community college employers, to provide their employees with either social security coverage or membership in a qualified retirement plan. Existing law requires employers subject to STRS, including community college employers, to make available criteria for membership, including optional membership, in a timely manner to persons employed to provide creditable service subject to coverage by the Defined Benefit Program and to inform part-time and substitute employees that they may elect membership in the Defined Benefit Program at any time while employed, as specified.\n\n This bill would require the office of the Chancellor of the California Community Colleges to develop, as specified, informational materials regarding the Defined Benefit Program, the Cash Balance Benefit Program, and social security. The bill would require the informational materials to include, among other things, the differences between membership and contributions made to these retirement options. The bill would require a person classified as a temporary employee, as specified, who is employed by a community college district to perform credible service to be provided with the option of membership in the Defined Benefit Program, the Cash Balance Benefit Program, if offered, or social security, as provided. To the extent that the bill would impose new duties on a community college district, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Zbur", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Zbur\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2417", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2417", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2417&version=20250AB241799INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2417", "note": ""}], "extras": {"impact_clause": "An act to add Section 87483.5 to the Education Code, relating to community colleges.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:36+00:00", "_id": "2345ce5a-0fcb-11f1-9ce2-72e66fa16e68"}