{"legislative_session": "20252026", "identifier": "SB1295", "title": "Energy storage systems: procurement.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Energystoragesystems", "procurement"], "abstracts": [{"note": "summary", "abstract": "Existing law requires the Public Utilities Commission to determine appropriate targets, if any, for each load-serving entity, as defined, to procure viable and cost-effective energy storage systems to be achieved by December 31, 2020. Existing law requires the commission to direct the state's 3 largest electrical corporations to file applications for programs and investments to accelerate widespread deployment of distributed energy storage systems.\n\nThis bill would require the commission, in addition to the requirements described above, on or before January 1, 2030, to consider procurement strategies for the installation of a statewide total of up to 40,000 megawatts of energy storage systems. As part of the procurement strategies considered by the commission, the bill would require the commission to consider appropriate targets, if any, for load-serving entities to procure viable and cost-effective energy storage systems, to be achieved on or before December 31, 2040. If the commission imposes an energy storage system procurement target on load-serving entities, the bill would authorize each load-serving entity to meet up to 50% of its procurement target through energy storage systems that it owns, that are interconnected at the transmission or distribution level, or that are located on the customer side of the meter, as specified. The bill would require the commission to reconsider procurement strategies and appropriate targets not less than once every 3 years.\n\nUnder existing law, a violation of any order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause a violation of a commission action implementing the bill's requirements would be a crime, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Stern", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Stern\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1295", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1295", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1295&version=20250SB129599INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1295", "note": ""}], "extras": {"impact_clause": "An act to add Section 2837.5 to the Public Utilities Code, relating to electricity.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:04+00:00", "_id": "ec4aabc8-0fca-11f1-9ce2-72e66fa16e68"}