{"legislative_session": "20252026", "identifier": "AB2463", "title": "Public Utilities Commission: rates: baseline capital-market risk framework: returns on equity.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["PublicUtilitiesCommission", "baselinecapital-marketriskframework", "rates", "returnsonequity"], "abstracts": [{"note": "summary", "abstract": "Existing law vests the Public Utilities Commission with regulatory authority over public utilities, including electrical corporations and gas corporations. Existing law authorizes the commission to fix the rates and charges for every public utility and requires that those rates and charges be just and reasonable.\n\nThis bill would require the commission, on or before April 1, 2027, to open a rulemaking to conduct a systemwide review of the methodologies used to determine the cost of capital and authorized return on equity for each electrical corporation and gas corporation. The bill would require the commission to establish and apply a baseline capital-market risk framework to serve as the analytical foundation for determining authorized returns on equity for electrical corporations and gas corporations, as provided. The bill would require the commission to develop and adopt a strategy for adjusting authorized returns on equity for each electrical corporation and gas corporation based on specified load growth or sales volume thresholds. The bill would require the commission to conduct a comprehensive review of the cost of capital adjustment mechanism applicable to each electrical corporation and gas corporation, evaluate the authorized return on equity applicable to each electrical corporation's infrastructure that serves transmission-level customers, and to evaluate alternative incentive-based return models that link a portion of shareholder earnings to performance outcomes, as provided.\n\nUnder existing law, a violation of an order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause a violation of a commission action implementing this bill's requirements would be a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Petrie-Norris", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Petrie-Norris\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2463", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2463", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2463&version=20250AB246399INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2463", "note": ""}], "extras": {"impact_clause": "An act to add Sections 759.5, 759.6, 759.7, 759.8, 759.9, and 759.10 to the Public Utilities Code, relating to the Public Utilities Commission.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:19+00:00", "_id": "a6ff759a-0f01-11f1-bd68-62084ebb1ff2"}