{"legislative_session": "20252026", "identifier": "AB52", "title": "Native American resources.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["NativeAmericanresources"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law finds and declares it to be the public policy and in the public interest of California to encourage the voluntary conveyance of conservation easements to qualified nonprofit organizations. Existing law defines the term \"conservation easement\" for these purposes, and authorizes certain entities and organizations to acquire and hold conservation easements, including a federally recognized California Native American tribe or a nonfederally recognized California Native American tribe that is on the contact list maintained by the Native American Heritage Commission, to protect a California Native American prehistoric, archaeological, cultural, spiritual, or ceremonial place, if the conservation easement is voluntarily conveyed.\n\nThis bill would instead authorize a California Native American tribe that is on the above-described contact list, to protect a California Native American prehistoric, archaeological, cultural, spiritual, or ceremonial place, to acquire and hold conservation easements, if the conservation easement is voluntarily conveyed or otherwise conveyed pursuant to the California Environmental Quality Act.\n\n(2) Existing law establishes the Office of Land Use and Climate Innovation to serve the Governor and the Governor's cabinet as staff for long-range planning and research and to constitute as the comprehensive state planning agency. Existing law requires the office to, among other things, encourage the formation and proper functioning of, and provide planning assistance to, city, county, district, and regional planning agencies. In connection with these responsibilities, existing law requires the office to develop and adopt guidelines for the preparation of and the content of the mandatory elements required in city and county general plans, as prescribed. By March 1, 2005, existing law requires the guidelines to contain advice, developed in consultation with the Native American Heritage Commission, for consulting with California Native American tribes, as specified.\n\nThis bill would instead require, by March 1, 2026, the guidelines to contain advice, developed in consultation with California Native American tribes that are on the contact list administered and maintained by the commission, as described, and the commission, for consulting with and obtaining tribal information and knowledge from California Native American tribes, as specified. The bill would make related conforming changes.\n\n(3) The Planning and Zoning Law and the Subdivision Map Act require local governments to hold public hearings regarding various land use actions contemplated by those governments and provide notice of those public hearings, as specified. Existing law requires specified notices to be mailed or delivered at least 10 days before the hearing to any person who has filed a written request for notice with either the clerk of the governing body or with any other person designated by the governing body to receive these requests. Existing law defines a \"person\" to include a California Native American tribe that is on the contact list maintained by the commission.\n\nThis bill would instead require notice to be given, as described above, to any California Native American tribe that is on the contact list administered and maintained by the commission, as specified, that has filed a written request, as described above.\n\n(4) The Planning and Zoning Law requires a city, county, or city and county to prepare a general plan for its jurisdiction that contains certain mandatory elements and requires the local planning agency to provide opportunities for the involvement of citizens, California Native American Indian tribes, public agencies, public utility companies, and civic, education, and other community groups through public hearings and other appropriate means during the preparation or amendment of a general plan. Existing law also requires a city or county, before the adoption or any amendment of a general plan, to conduct consultations with California Native American tribes, as specified, for the purpose of preserving or mitigating impacts to places, features, and objects, as described, that are located within the city's or county's jurisdiction. Existing law defines \"consultation\" for these purposes and requires, among other things, the consultation between governmental agencies and Native American tribes to be conducted in a way that is mutually respectful of each party's sovereignty.\n\nThis bill would revise the definition of \"consultation\" to mean, among other things, the meaningful and timely process of seeking, discussing, and considering carefully the views of others, in a manner that is cognizant of all parties' cultural values. The bill would require tribal consultation for specified purposes, including to identify and determine tribal resources, places, features, and objects, as described. The bill would impose specific requirements when there are tribal consultations with federally recognized and nonfederally recognized California Native American tribes, including, among others, that a California Native American tribe that is not federally recognized and is on the contact list administered and maintained by the commission, as specified, has the right to participate in the review process related to a consultation, as provided. The bill would recast certain provisions and make related conforming changes for these purposes. By imposing additional duties on local governmental agencies, the bill would impose a state-mandated local program. \n\n(5) The California Environmental Quality Act (CEQA) requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of, an environmental impact report (EIR) on a project that it proposes to carry out or approve that may have a significant effect on the environment or to adopt a negative declaration if it finds that the project will not have that effect. CEQA also requires a lead agency to prepare a mitigated negative declaration for a project that may have a significant effect on the environment if revisions in the project would avoid or mitigate that effect and there is no substantial evidence that the project, as revised, would have a significant effect on the environment.\n\nCEQA requires a lead agency, before releasing an environmental review document for a project, to begin consultation with a California Native American tribe that is traditionally and culturally affiliated with the geographic area of the proposed project, as provided. CEQA authorizes the parties, as a part of the consultation, to propose mitigation measures capable of avoiding or substantially lessening potential significant impacts to a tribal cultural resource or alternatives that would avoid significant impacts to a tribal cultural resource. CEQA requires public agencies, when feasible, to avoid damaging effects to tribal cultural resources and specifies mitigation measures that should be considered to avoid or minimize significant adverse impacts on tribal cultural resources. CEQA specifies that the consultation is considered to be concluded if the parties agree to the mitigation measures or if a party, acting in good faith and after reasonable effort, concludes that mutual agreement cannot be reached. CEQA authorizes the lead agency to certify the EIR or adopt a negative declaration or mitigation negative declaration for a project with a significant impact on an identified tribal cultural resource if the consultation process with a California Native American tribe has concluded or if the California Native American tribe fails to provide comments to the lead agency or otherwise fails to engage in the consultation process.\n\nThis bill would revise and recast provisions related to the consultation process between the lead agency and California Native American tribes to, among other things, specify that the purpose of the consultation process is to identify and determine tribal cultural resources and identify mitigation measures, among other purposes. The bill would require the lead agency or local government to invite culturally affiliated nonfederally recognized California Native American tribes to participate in processes required under CEQA. The bill would specify that the duration of the consultation is from the point in time when the California Native American tribe requests the consultation to the completion of the implementation of the mitigation measures for the project. The bill would specify that the first step of the consultation is considered completed if the parties agree to the mitigation measure or a party, in good faith and after reasonable effort, concludes that mutual agreement cannot be reached. The bill would authorize a lead agency to certify an EIR or adopt a negative declaration or mitigated negative declaration for the project if the first step of the consultation is completed. The bill would revise and recast mitigation measures that a public agency should take to avoid or minimize the significant adverse impacts on tribal cultural resources if the consultation process fails to result in agree-upon mitigation measures, as provided. By imposing additional duties on local agencies and local governments in their implementation of CEQA, the bill would impose a state-mandated local program.\n\n(6) Existing law establishes the Native American Heritage Commission and requires the commission to perform various duties related to Native American matters, including the identification and the cataloging of places of special religious or social significance to Native Americans, and known graves and cemeteries of known Native Americans on private properties. Existing law defines \"California Native American tribe\" to be a federally recognized or a nonfederally recognized Native American tribe in California that is on the contact list maintained by the commission. Existing law requires state and local agencies to cooperate with the commission in carrying out the commission's duties, including transmitting, at the commission's expense, copies of appropriate sections of all EIRs of projects relating to property identified by the commission as of special religious significance to Native Americans or that is reasonably foreseeable to be that type of property.\n\nThis bill would require the commission to prepare and maintain a verified inventory of Native American sacred places, to be known as the California Sacred Lands File, on public and private lands. The bill would require the commission to administer and maintain the contact list of California Native American tribes and would require the contact list to include delineation of lands and geographic areas that are culturally affiliated with California Native American tribes. The bill would instead specify the cooperation provided by state or local agencies includes transmitting copies, electronic or physical, of certain information related to projects relating to property identified by the commission as of special religious significance or that is reasonably foreseeable to be that type of property, and would require state and local agencies to appear at commission meetings when a matter within their authority is on the commission's agenda. By imposing additional duties on local agencies, the bill would impose a state-mandated local program.\n\nExisting law prohibits a public agency or private party using or occupying public property or operating on public property from interfering with the free expression or exercise of Native American religion or causing severe or irreparable damage to Native American sanctified cemeteries, places of worship, religious or ceremonial sites, or sacred shrines located on public property, except as provided. Existing law, upon the discovery of Native American human remains, imposes certain requirements on the landowner. Existing law exempts public properties of all cities, counties, and cities and counties located within the limits of the city, county, and city and county from the above prohibition and requirements, except for parklands in excess of 100 acres.\n\nThis bill would repeal the exemption for public properties of cities, counties, and cities and counties. The bill would, upon the discovery of multiple Native American human remains during ground-disturbing land development activities, prohibit the disturbance, impairment, or harm to the location of the discovery. The bill would require the landowner to engage in conferral with the most likely descendant to include culturally appropriate treatment of those human remains, as provided. For discovery occurring during activities related to projects that are subject to CEQA, the bill would require the project to contain an open-space preservation area with an appropriate buffer for the preservation in place and protection of those human remains and the burial area site. The bill would require the landowner to take certain actions to protect the site.\n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that with regard to certain mandates no reimbursement is required by this act for a specified reason.\n\nWith regard to any other mandates, this bill would provide that, if the Commission on State Mandates determines that the bill contains costs so mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [{"note": "", "title": "Native American Heritage Commission: powers and duties."}], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2024-12-02", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee January 2.", "date": "2024-12-03", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Referred to Coms. on NAT. RES. and L. GOV.", "date": "2025-03-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Coms. on NAT. RES. and L. GOV.", "entity_type": "organization", "organization_id": null}]}, {"description": "From committee chair, with author's amendments: Amend, and re-refer to Com. on NAT. RES. Read second time and amended.", "date": "2025-03-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["amendment-introduction", "amendment-passage", "reading-1", "reading-2"], "related_entities": []}, {"description": "Re-referred to Com. on NAT. RES.", "date": "2025-03-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on NAT. RES.", "entity_type": "organization", "organization_id": null}]}, {"description": "In committee: Hearing postponed by committee.", "date": "2025-04-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "From committee chair, with author's amendments: Amend, and re-refer to Com. on NAT. RES. Read second time and amended.", "date": "2025-04-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["amendment-introduction", "amendment-passage", "reading-1", "reading-2"], "related_entities": []}, {"description": "Re-referred to Com. on NAT. RES.", "date": "2025-04-22", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on NAT. RES.", "entity_type": "organization", "organization_id": null}]}, {"description": "Assembly Rule 56 suspended. (Page 1265.)", "date": "2025-04-24", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "(Pending re-refer to Com. on L. GOV.)", "date": "2025-04-24", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "In committee: Set, first hearing. Hearing canceled at the request of author.", "date": "2025-04-28", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Aguiar-Curry", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Aguiar-Curry\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB52", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB52", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "12/02/24 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB52&version=20250AB5299INT", "media_type": "application/pdf"}], "date": "2024-12-02", "classification": ""}, {"note": "03/10/25 - Amended Assembly", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB52&version=20250AB5298AMD", "media_type": "application/pdf"}], "date": "2025-03-10", "classification": ""}, {"note": "04/21/25 - Amended Assembly", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB52&version=20250AB5297AMD", "media_type": "application/pdf"}], "date": "2025-04-21", "classification": ""}], "documents": [{"note": "04/26/25- Assembly Natural Resources", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202520260AB52&analysisId=385256&analyzingOffice=Assembly+Natural+Resources", "media_type": "application/pdf"}], "date": "2025-04-26", "classification": "analysis"}], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB52", "note": ""}], "extras": {"impact_clause": "An act to amend Section 815.3 of the Civil Code, to amend Sections 65040.2, 65092, 65351, 65352, 65352.3, 65560, and 65562.5 of, and to repeal and add Section 65352.4 of, the Government Code, and to amend Sections 5097.9, 5097.94, 5097.95, 5097.98, 21073, 21074, 21080.3.1, 21080.3.2, 21082.3, and 21084.3 of, to repeal Section 5097.96 of, and to repeal and add Section 21083.09 of, the Public Resources Code, relating to Native American resources.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2025-12-23T08:45:07+00:00", "_id": "aefe4b68-dfdb-11f0-98ae-9e5dcb84f9b6"}