{"legislative_session": "20252026", "identifier": "AB2467", "title": "Pupil enrollment: military dependents.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Pupilenrollment", "militarydependents"], "abstracts": [{"note": "summary", "abstract": "Existing law provides that each person between 6 and 18 years of age not exempted is subject to compulsory full-time education and requires a person subject to compulsory education to attend the public full-time day school or continuation school or classes in the school district in which the residence of the parents or legal guardian is located. Existing law requires a school district to accept enumerated documentation, including property tax payment records, as reasonable evidence of a pupil's residence. Existing law states that a pupil complies with the residency requirements if the pupil's parent is transferred or is pending transfer to a military installation within the state while on active military duty pursuant to an official military order. Existing law authorizes a parent to use one of several enumerated addresses, including that of a temporary on-base billeting facility, for purposes of school application, enrollment, and registration.\n\nThis bill would expand the list of addresses authorized for the purposes identified above to include, among others, an off-base hotel. To the extent the bill imposes additional duties on school districts, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above.\n\nThis bill would declare that it is to take effect immediately as an urgency statute."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Committee on Education", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Committee on Education\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2467", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2467", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2467&version=20250AB246799INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2467", "note": ""}], "extras": {"impact_clause": "An act to amend Section 48204.3 of the Education Code, relating to pupil enrollment, and declaring the urgency thereof, to take effect immediately.", "tags": ["fiscal committee", "local program", "urgency"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:19+00:00", "_id": "a7093076-0f01-11f1-bd68-62084ebb1ff2"}