{"legislative_session": "20252026", "identifier": "AB1917", "title": "Criminal procedure: information.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Criminalprocedure", "information"], "abstracts": [{"note": "summary", "abstract": "Existing law provides a district attorney with the discretion to file criminal charges against an individual. Existing law requires a preliminary examination to be conducted, as specified, before an information is filed. Upon completion of a preliminary hearing, existing law requires the district attorney to file an information against the defendant charging the defendant with either the offense or offenses named in the order of commitment or any offense or offenses shown by the evidence taken before the magistrate to have been committed. Under existing law, when an action is dismissed by a magistrate, as specified, the prosecutor may make a motion in the superior court within 15 days to compel the magistrate to reinstate the complaint or a portion of the complaint and to reinstate the custodial status of the defendant under the same terms and conditions as when the defendant last appeared before the magistrate. \n\nThis bill, the Respect Judicial Decisions Act, would instead only allow the information to charge the defendant with the offense or offenses named in the order of commitment. The bill would require the district attorney to make a motion to reinstate an offense or offenses dismissed at the preliminary hearing before the district attorney can file an information charging the dismissed offense or offenses. The bill would authorize the district attorney to file an amended information that includes the reinstated offenses if that motion is granted. The bill would also authorize the district attorney to make that motion to reinstate the complaint or a portion of the complaint when an individual count or counts alleging an offense were dismissed. By placing new duties on prosecutors, this bill would impose a state-mandated local program. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 15.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Schultz", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Schultz\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1917", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1917", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1917&version=20250AB191799INT", "media_type": "application/pdf"}], "date": "2026-02-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1917", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 739, 871.5, and 1009 of the Penal Code, relating to criminal procedure.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:25+00:00", "_id": "1c3d65fa-0fcb-11f1-9ce2-72e66fa16e68"}