{"legislative_session": "20252026", "identifier": "AB2101", "title": "Human trafficking: notice and training: disaster sites.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Humantrafficking", "disastersites", "noticeandtraining"], "abstracts": [{"note": "summary", "abstract": "Existing law requires specified businesses and other establishments, including, among others, airports, intercity passenger rail or light rail stations, bus stations, and truck stops, to post a notice, as developed by the Department of Justice, that contains information relating to slavery and human trafficking, including information regarding specified nonprofit organizations that a person can call for services or support in the elimination of slavery and human trafficking.\n\nThis bill would additionally require designated disaster sites and designated mitigation sites, as those terms are defined, to post the above-described notice.\n\nExisting law requires a business or other establishment that operates intercity passenger rail or light rail stations or bus stations to provide at least 20 minutes of training to specified employees in recognizing the signs of human trafficking and how to report those signs to the appropriate law enforcement agency. Existing law requires that training to include, among other things, the definition of human trafficking, including sex trafficking and labor trafficking, and guidance on how to identify individuals who are most at risk for human trafficking.\n\nThis bill would, starting June 1, 2027, require an entity that operates in a designated disaster site or designated mitigation site to provide at least 20 minutes of training to all employees involved in specified disaster recovery or mitigation tasks. The bill would authorize the training to be developed or administered by a nonprofit or private entity with professional experience related to human trafficking and would require the training to be delivered in the language that is the most widely spoken language among the employees that will receive the training. The bill would require the training to include the same elements as the training described in the above-paragraph and examples and case scenarios relevant to how trafficking occurs at designated disaster sites and designated mitigation sites, as specified."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Gipson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Gipson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2101", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2101", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2101&version=20250AB210199INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2101", "note": ""}], "extras": {"impact_clause": "An act to amend Section 52.6 of the Civil Code, relating to human trafficking.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:29+00:00", "_id": "1ec5d406-0fcb-11f1-9ce2-72e66fa16e68"}