{"legislative_session": "20252026", "identifier": "AB2310", "title": "Illegal dumping.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Illegaldumping"], "abstracts": [{"note": "summary", "abstract": "Existing law makes it unlawful to dump waste matter in certain locations, such as upon a public or private highway or road, upon private property without the consent of the owner, or in or upon a public park or other public property, as specified. Existing law also makes it unlawful to place, deposit, or dump rocks, concrete, asphalt, or dirt in certain locations, as specified. A person violating these provisions is guilty of an infraction, as specified. Existing law makes a violation of these provisions in commercial quantities, as defined, a misdemeanor punishable by imprisonment in a county jail and by a fine, as specified. Under existing law, a private owner is not restricted in the use of their own private property, unless the placing, depositing, or dumping of the waste matter on the property creates a public health and safety hazard, a public nuisance, or a fire hazard, as determined by a local health or fire department or the Department of Forestry and Fire Protection.\n\nThis bill would make it a crime to transport waste matter, rocks, concrete, asphalt, dirt, or other construction debris for the purpose of placing, depositing, or dumping it in the locations described above. The bill would make a person violating these provisions 4 or more times guilty of a misdemeanor, as specified. The bill would also make it unlawful to transport for the purpose of placing, depositing, or dumping waste matter, rocks, concrete, asphalt, dirt or other construction debris in commercial quantities, as defined, in the locations described above. For a person who violates these provisions in commercial quantities in excess of 25 cubic yards, the bill would make that violation a misdemeanor punishable in a county jail for not more than one year and by a fine, as specified. For commercial quantities in excess of 50 cubic yards, the bill would make a violation punishable as a misdemeanor or a felony, as specified. By expanding the application of a crime and creating new crimes, this bill would impose a state-mandated local program. The bill would specify that a private owner or a person with the owner's permission is prohibited from placing, depositing, dumping, or transporting waste matter, rocks concrete, asphalt, dirt, or construction debris on their property if the activity requires a permit or license from a state or local agency and one was not obtained, or creates a public health and safety hazard, a public nuisance, or a fire hazard, as determined by specified entities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Carrillo", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Carrillo\"}", "organization_id": null}, {"name": "Irwin", "classification": "author", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Irwin\"}", "organization_id": null}, {"name": "Harabedian", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Harabedian\"}", "organization_id": null}, {"name": "Schiavo", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Schiavo\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2310", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2310", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2310&version=20250AB231099INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2310", "note": ""}], "extras": {"impact_clause": "An act to amend Section 374.3 of the Penal Code, relating to crimes.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:58:01+00:00", "_id": "42ea59d4-0e3a-11f1-a618-2a6200350f1a"}