{"legislative_session": "20252026", "identifier": "SB1057", "title": "Licensing: certified nurse assistants and home health aides.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Licensing", "certifiednurseassistantsandhomehealthaides"], "abstracts": [{"note": "summary", "abstract": "Existing law provides for the licensure and regulation of health facilities, clinics, home health agencies, and hospice agencies, as defined, by the State Department of Public Health. Existing law provides for the certification of nurse assistants and home health aides by the department. A violation of these provisions by a licensee is a crime.\n\nExisting law authorizes the department to deny an application for, initiate an action to suspend or revoke a certificate for, or deny a training and examination application for a nurse assistant or home health aide under specified circumstances. Existing law requires, with some exceptions, the department to deny a training and examination application and deny, suspend, or revoke a certificate if the applicant or certificate holder has been convicted of a violation of or attempted violation of one or more specified crimes.\n\nThis bill would instead authorize the department to deny an application for, a certificate for, or a training and examination application for, a nurse assistant or home health aide for various reasons, including if an applicant has been convicted of a crime, as specified, within the preceding 7 years from the date of the application that is substantially related to the qualifications, functions, or duties of a certified nurse assistant or home health aide, regardless of whether the applicant was incarcerated for that crime, as specified, and if the applicant has been subjected to formal discipline by the department or a licensing board in or outside California within the preceding 7 years from the date of the application for professional misconduct that would have been cause for discipline, as specified, and that is substantially related to the qualifications, functions, or duties of a certified nurse assistant or home health aide, as specified.\n\nThe bill would authorize an applicant or certificate holder whose application to be a nurse assistant or home health aide was denied or certificate was suspended or revoked on the basis of a criminal conviction to, during a period of 2 years after the department receives the criminal record report, provide the department with evidence of good character and rehabilitation or provide the department with evidence that the criminal conviction is no longer grounds for denial, as specified.\n\nThe bill would prescribe requirements for the department in requesting or acting on a nursing assistant or home health aide applicant's criminal history information, including if the department decides to deny a training and examination application or certificate. The bill would authorize the department to initiate an action to suspend or revoke a certificate for professional misconduct warranting cause for discipline, as specified. Upon a determination to revoke or suspend a certificate, the bill would prescribe the requirements for the department to notify the certificate holder in writing by certified mail, including providing information about the procedure for the certificate holder to challenge the determination or request reconsideration.\n\nBy expanding the scope of a crime, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 15.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Becker", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Becker\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1057", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1057", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1057&version=20250SB105799INT", "media_type": "application/pdf"}], "date": "2026-02-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1057", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 1338.5 and 1736.6 of, to repeal Section 1735 of, and to repeal and add Sections 1337.9 and 1736.5 of, the Health and Safety Code, relating to health facilities.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-18T09:01:47+00:00", "_id": "74625766-0ca8-11f1-b63b-c6889cfda9fe"}