{"legislative_session": "20252026", "identifier": "SB936", "title": "Nitrous oxide: sales.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Nitrousoxide", "sales"], "abstracts": [{"note": "summary", "abstract": "Existing law makes it a misdemeanor to possess nitrous oxide with the intent of inhaling it for specified purposes, including to cause intoxication. Existing law also makes it a misdemeanor to sell nitrous oxide to any person under 18 years of age. Existing law makes it a misdemeanor to dispense nitrous oxide to a person and knowing that the person will use it for specified prohibited purposes, if that person then causes death or great bodily injury to themselves or another person.\n\nExisting law, the Cigarette and Tobacco Products Licensing Act of 2003, requires a retailer, as defined, to hold a license from the California Department of Tax and Fee Administration to engage in the sale of cigarettes or tobacco products. Existing law, the Medicinal and Adult-Use Cannabis Regulation and Safety Act, the Medicinal and Adult-Use Cannabis Regulation and Safety Act (MAUCRSA) , among other things, consolidates the licensure and regulation of commercial medicinal and adult-use cannabis activities, including retail commercial cannabis activity.\n\nThis bill would, except as specifically exempted, prohibit the sale and distribution of a nitrous oxide container that is capable of holding more than 8 grams of nitrous oxide or from which an individual may directly inhale nitrous oxide. The bill would also prohibit the sale and distribution of a nitrous oxide that has, or is marketed as having, the taste or smell of any food. The bill would prohibit the sale and distribution of a device that allows an individual to inhale nitrous oxide from the container or hold nitrous oxide for the purposes of inhalation. The bill would punish a violation of these provisions as an infraction, as specified. The bill would also authorize a court to suspend the business license, including a license to sell tobacco products or cannabis, if the business has a prior conviction for violating these prohibitions.\n\nBecause this bill would create new crimes, it would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-01-29", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}], "sponsorships": [{"name": "Blakespear", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Blakespear\"}", "organization_id": null}, {"name": "Umberg", "classification": "author", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Umberg\"}", "organization_id": null}, {"name": "Alanis", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Alanis\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB936", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB936", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/29/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB936&version=20250SB93699INT", "media_type": "application/pdf"}], "date": "2026-01-29", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB936", "note": ""}], "extras": {"impact_clause": "An act to add Section 381f to the Penal Code, relating to nitrous oxide.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-31T08:43:50+00:00", "_id": "f718741e-fe80-11f0-9d8f-d24e54b39ff3"}