{"legislative_session": "20252026", "identifier": "AB2308", "title": "Redevelopment: successor agency debt: City and County of San Francisco.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CityandCountyofSanFrancisco", "Redevelopment", "successoragencydebt"], "abstracts": [{"note": "summary", "abstract": "Existing law dissolved redevelopment agencies and community development agencies as of February 1, 2012, and provides for the designation of successor agencies to, among other things, wind down the affairs of the dissolved redevelopment agencies and make payments due for enforceable obligations. Existing law, among other powers granted to successor agencies generally, additionally vests the successor agency to the former Redevelopment Agency of the City and County of San Francisco with the authority, rights, and powers of that former redevelopment agency solely for the purpose of issuing bonds or incurring other indebtedness, subject to the approval of the oversight board of the successor agency, to finance the construction of affordable housing and infrastructure required by specified development agreements, including the infrastructure required by the Transbay Implementation Agreement. Under existing law, these bonds and indebtedness are considered indebtedness incurred by the dissolved redevelopment agency secured by moneys deposited in the Redevelopment Property Tax Trust Fund established for that agency.\n\nThis bill would specify this authority to issue bonds or incur other indebtedness to finance the infrastructure required by the Transbay Implementation Agreement includes entering into arrangements with the Transbay Joint Powers Authority and the City and County of San Francisco to extend the time period for pledges of gross sales proceeds and net tax increments.\n\nThis bill would make legislative findings and declarations as to the necessity of a special statute for the City and County of San Francisco."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Haney", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Haney\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2308", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2308", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2308&version=20250AB230899INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2308", "note": ""}], "extras": {"impact_clause": "An act to amend Section 34177.7 of the Health and Safety Code, relating to housing.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:34+00:00", "_id": "21bcb076-0fcb-11f1-9ce2-72e66fa16e68"}