{"legislative_session": "20252026", "identifier": "AB2248", "title": "Pupil services: educational counseling: advanced academic programs.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Pupilservices", "advancedacademicprograms", "educationalcounseling"], "abstracts": [{"note": "summary", "abstract": "Existing law authorizes the governing board of a school district to provide access to a comprehensive educational counseling program for all pupils enrolled in the school district. For schools that enroll pupils in grades 6 to 12, inclusive, existing law defines educational counseling to include, among other things, counseling to encourage participation in the early college, dual enrollment, advanced placement, and international baccalaureate programs.\n\nThis bill would require the governing board of each school district and the governing body of each charter school maintaining any of grades 9 to 12, inclusive, to ensure that all pupils in those grades, and their parents or guardians, receive, on or before October 1 of each year, a written notice of the advanced academic programs available to pupils, as provided. The bill would require the notice to include, among other information, the benefits of participating in advanced academic programs, including any available weighted grade-point-average credit, college credit, or other academic advantages, and how these benefits can help pupils save time and money toward a postsecondary degree. The bill would require each pupil to also receive notice of advanced academic programs through at least one direct communication. The bill would require schools to annually hold at least one informational session for parents and guardians about options for advanced academic programs and the enrollment processes, and to make reasonable efforts to notify all parents and guardians of the date, time, and location of the session. The bill would require the Superintendent of Public Instruction to issue guidelines to facilitate the implementation of these provisions. By imposing additional duties on local educational agencies, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Hoover", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Hoover\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2248", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2248", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2248&version=20250AB224899INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2248", "note": ""}], "extras": {"impact_clause": "An act to add Section 51229.5 to the Education Code, relating to pupil services.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:58:00+00:00", "_id": "4238d920-0e3a-11f1-a618-2a6200350f1a"}