{"legislative_session": "20252026", "identifier": "AB1682", "title": "Health care coverage: scalp cooling.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Healthcarecoverage", "scalpcooling"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Knox-Keene Health Care Service Plan Act of 1975, provides for the licensure and regulation of health care service plans by the Department of Managed Health Care, and makes a willful violation of the act a crime. Existing law provides for the regulation of health insurers by the Department of Insurance. Existing law requires coverage by health care service plans and health insurers for various screening and treatment services with respect to cancer.\n\nThis bill would require a health care service plan contract or health insurance policy, except as specified, that is issued, amended, delivered, or renewed on or after January 1, 2027, to provide coverage for scalp cooling, as defined, as prescribed by a health care provider in connection with chemotherapy for persons with cancer. Because a violation of these provisions with respect to a health care service plan would be a crime, this bill would impose a state-mandated local program.\n\nExisting law also provides for the Medi-Cal program, which is administered by the State Department of Health Care Services, under which qualified low-income individuals receive health care services pursuant to a schedule of benefits, including various cancer screenings and benefits relating to cancer treatment.\n\nSubject to the extent that federal financial participation is available and not otherwise jeopardized, and any necessary federal approvals have been obtained, this bill would expand the Medi-Cal schedule of benefits to include scalp cooling, as prescribed by a health care provider in connection with chemotherapy for persons with cancer. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-02", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 5.", "date": "2026-02-03", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Hart", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Hart\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1682", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1682", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/02/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1682&version=20250AB168299INT", "media_type": "application/pdf"}], "date": "2026-02-02", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1682", "note": ""}], "extras": {"impact_clause": "An act to add Section 1367.651 to the Health and Safety Code, to add Section 10123.811 to the Insurance Code, and to add Section 14132.65 to the Welfare and Institutions Code, relating to health care coverage.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-06T08:59:57+00:00", "_id": "3616736a-033a-11f1-b778-e65367eb5c0f"}