{"legislative_session": "20252026", "identifier": "AB1560", "title": "Lobbyist certification.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Lobbyistcertification"], "abstracts": [{"note": "summary", "abstract": "The Political Reform Act of 1974 requires individual lobbyists to prepare certifications, as specified, for filing with the Secretary of State. The act also requires lobbying firms and certain lobbyist employers to register with the Secretary of State. The act makes a violation of these provisions a misdemeanor. Under existing law, a person who violates the act is prohibited from acting as a lobbyist for a period of four years following the date of conviction, except as specified.\n\nThis bill would prohibit a person who has been convicted of a crime of public corruption, as defined, from serving as a lobbyist. The bill would prohibit the Secretary of State from accepting a lobbying certification from such a person, and it would also void an existing lobbying certification in the event of such a conviction. The bill would require a lobbying certification to include a statement that the applicant has not been convicted of a crime of public corruption.\n\nThe Political Reform Act of 1974, an initiative measure, provides that the Legislature may amend the act to further the act's purposes upon a 23 vote of each house of the Legislature and compliance with specified procedural requirements.\n\nThis bill would declare that it furthers the purposes of the act.\n\nA violation of the Political Reform Act of 1974 is punishable as a misdemeanor. By creating a new crime, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-08", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 8.", "date": "2026-01-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Tangipa", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Tangipa\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1560", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1560", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/08/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1560&version=20250AB156099INT", "media_type": "application/pdf"}], "date": "2026-01-08", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1560", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 86100 and 86103 of, and to add Section 86207 to, the Government Code, relating to the Political Reform Act of 1974.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-12T08:46:34+00:00", "_id": "334c8bde-ef93-11f0-a344-a2243f0df6c0"}