{"legislative_session": "20252026", "identifier": "AB2119", "title": "Criminal procedure: gender bias in sexual assault and domestic violence investigations.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Criminalprocedure", "genderbiasinsexualassaultanddomesticviolenceinvestigations"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes specified rights for victims and witnesses of crimes, including to be notified or informed regarding specified court proceedings and the right to have a support person present at any interviews with law enforcement for a victim of domestic violence or sexual assault. Existing law requires a law enforcement agency to inform a victim of the rights they may have.\n\nThis bill would state that a victim of sexual assault or domestic violence has the right to a fair, unbiased, and complete investigation by law enforcement, regardless of gender and would authorize a victim of one of these crimes to request a reinvestigation of their report by the district attorney. The bill would create a civil cause of action if a law enforcement agency violated these rights and would make that cause of action retroactive to investigations made before January 1, 2027. The bill would require a district attorney to establish a process for reviewing and investigating reported cases of sexual assault or domestic violence and would require that process to include a report to the victim explaining the decision whether or not to bring criminal accusations and which accusations to allege.\n\nExisting law prescribes the time after the commission of a crime in which a criminal action is required to be commenced, referred to as a statute of limitation. Existing law also prescribes situations in which a statute of limitation is tolled or extended.\n\nThis bill would provide that the statute of limitations for specified felony offenses involving sexual assault and domestic violence that have not expired as of January 1, 2027, shall commence to run beginning on January 1, 2027.\n\nExisting law establishes the Commission on Peace Officer Standards and Training and requires the commission to create courses of training that must be completed by persons before those persons can become peace officers. The commission is also required to create guidelines and training courses for peace officers on specified law enforcement topics, including the investigation of domestic violence complaints and sexual assault.\n\nThis bill would require those courses and guidelines to include trauma-informed methods for responding to victims, gender-neutral or gender-inclusive language in reporting, and best practices for bias prevention. The bill would require the commission to prepare a course on gender bias in responding to reports of sexual assault and domestic violence and would require that course to adhere to guidance provided by the Department of Justice, as specified. \n\nExisting law establishes the State Department of Public Health and charges it with providing education and outreach to the public on various issues relating to public health, such as lyme disease, human immunodeficiency virus and acquired immune deficiency syndrome, and hepatitis C.\n\nThis bill would require the department to develop materials to educate the public that all genders may be the victim of sexual assault and domestic violence, that all genders may perpetrate sexual assault and domestic violence, and that all genders have equal rights to safety, shelter, and legal protections and remedies.\n\nBecause this bill would create new duties for local law enforcement agencies, it would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Jackson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Jackson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2119", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2119", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2119&version=20250AB211999INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2119", "note": ""}], "extras": {"impact_clause": "An act to add Chapter 1.5 (commencing with Section 24198) to Division 20 of the Health and Safety Code, and to amend Sections 803, 13516, and 13519 of, to add Sections 422.875 and 13519.17 to, and to add Chapter 7.7 (commencing with Section 313.6) to Title 9 of Part 1 of, the Penal Code, relating to criminal procedure.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-19T09:01:01+00:00", "_id": "83cd9c6e-0d71-11f1-814c-2ab210762532"}