{"legislative_session": "20252026", "identifier": "AB2152", "title": "California Environmental Quality Act: exemption: fire stations.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaEnvironmentalQualityAct", "exemption", "firestations"], "abstracts": [{"note": "summary", "abstract": "The California Environmental Quality Act (CEQA) requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of, an environmental impact report on a project that it proposes to carry out or approve that may have a significant effect on the environment or to adopt a negative declaration if it finds that the project will not have that effect. CEQA also requires a lead agency to prepare a mitigated negative declaration for a project that may have a significant effect on the environment if revisions in the project would avoid or mitigate that effect and there is no substantial evidence that the project, as revised, would have a significant effect on the environment. \n\nThis bill would exempt from the requirements of CEQA a project, activity, or approval necessary for, or incidental to, the planning, design, site acquisition, construction, rehabilitation, or maintenance of a fire station of a public fire agency if the project is not located at certain sites and all construction, rehabilitation, and maintenance contracts in excess of $50,000 for the project are covered by a project labor agreement, as defined. The bill would require the lead agency, upon a determination that a project, activity, or approval is exempt from CEQA pursuant to these provisions, to file a notice of exemption with specified content with the Office of Land Use and Climate Innovation, as provided. Because the bill would impose additional duties on a lead agency in regards to the exemption, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Mark González", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Mark Gonz\\u00e1lez\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2152", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2152", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2152&version=20250AB215299INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2152", "note": ""}], "extras": {"impact_clause": "An act to add Section 21080.74 to the Public Resources Code, relating to environmental quality.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-19T09:01:02+00:00", "_id": "841bf63e-0d71-11f1-814c-2ab210762532"}