{"legislative_session": "20252026", "identifier": "AB2536", "title": "Horse racing: satellite wagering facilities: authorizations.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Horseracing", "authorizations", "satellitewageringfacilities"], "abstracts": [{"note": "summary", "abstract": "(1) The Horse Racing Law prohibits a satellite wagering facility, except a facility that is located at a track where live racing is conducted, from being located within 20 miles of any existing satellite wagering facility or of any track where a racing association conducts a live racing meeting, except, in the northern zone, the racing association or existing satellite wagering facility is authorized to waive this prohibition and consent to locating the new satellite wagering facility within 20 miles of the facility or track.\n\nThis bill would expand that exception to the entire state.\n\n(2) The Horse Racing Law authorizes the Department of Food and Agriculture to approve not more than 3 satellite wagering facilities that are licensed jointly to the 1a District Agricultural Association and the 5th District Agricultural Association and that are located on the fairgrounds of the 1a District Agricultural Association or within the boundaries of the City and County of San Francisco.\n\nThis bill would limit the department to approval of not more than 2 satellite wagering facilities, as described above.\n\n(3) The Horse Racing Law requires, before a satellite wagering facility may be licensed for the 1997 and subsequent calendar years, the department to conduct a one-year test at the proposed site in order to determine the impact of the proposed facility on total state parimutuel revenues and on attendance and wagering at existing racetracks and fair satellite wagering facilities in the Counties of Alameda, San Mateo, Santa Clara, and Solano.\n\nThis bill would delete that requirement.\n\n(4) The Horse Racing Law authorizes fairs to contract for the operation and management of a satellite wagering facility with an individual racing association or a partnership, joint venture, or other affiliation of 2 or more racing associations or fairs that are licensed to conduct thoroughbred meetings or simulcast wagering within the northern zone.\n\nThis bill would expand that authorization for fairs to contract, as specified above, for thoroughbred meetings or simulcast wagering within the state."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Blanca Rubio", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Blanca Rubio\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2536", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2536", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2536&version=20250AB253699INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2536", "note": ""}], "extras": {"impact_clause": "An act to amend Section 19605 of the Business and Professions Code, relating to horse racing.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:21+00:00", "_id": "a7f3aa5c-0f01-11f1-bd68-62084ebb1ff2"}