{"legislative_session": "20252026", "identifier": "AB1971", "title": "Property tax: exclusion from reassessment: home hardening retrofitting improvements.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Propertytax", "exclusionfromreassessment", "homehardeningretrofittingimprovements"], "abstracts": [{"note": "summary", "abstract": "The California Constitution generally limits ad valorem taxes on real property to 1% of the full cash value of that property. For purposes of this limitation, \"full cash value\" is defined as the assessor's valuation of real property as shown on the 1975–76 tax bill under \"full cash value\" or, thereafter, the appraised value of that real property when purchased, newly constructed, or a change in ownership has occurred. The California Constitution specifies that \"newly constructed\" does not include the construction or reconstruction of seismic retrofitting components, as defined by the Legislature. Existing law, pursuant to that constitutional authorization, defines seismic retrofitting components to mean seismic retrofitting improvements and improvements utilizing earthquake hazard mitigation technologies. Existing law, pursuant to constitutional authorization, also excludes from the definition of \"newly constructed\" the construction or installation of certain fire sprinkler systems, or other fire extinguishing systems, fire detection systems, or fire-related egress improvements.\n\nThis bill would exclude from the definition of \"newly constructed\" and \"new construction\" the construction or reconstruction of home hardening retrofitting improvements, which the bill would define as the installation of Class A roofs and multiplane windows, vent screening, the establishment of defensible space, and the use of noncombustible materials for the construction or reconstruction of fences, decks, sidings, eaves, and doors. The bill would except from the definition of \"home hardening retrofitting improvements,\" among other things, any portion of a construction or reconstruction which would bring the aggregate full cash value of the home hardening retrofitting improvements excluded from reassessment above $100,000. The bill would require the property owner, as a condition of eligibility for the exclusion, to receive a home hardening certification from certain certification programs, as specified, and to notify the assessor prior to, or within 30 days of, the completion of a project for which the property owner intends to claim the exclusion. The bill would require the property owner to file all documents necessary to support the exclusion with the county assessor within one year of the completion of the project and would authorize the State Board of Equalization to prescribe the manner and form of claiming the exemption. By imposing additional duties on local tax officials, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above.\n\nExisting law requires the state to reimburse local agencies annually for certain property tax revenues lost as a result of any exemption or classification of property for purposes of ad valorem property taxation.\n\nThis bill would provide that, notwithstanding those provisions, no appropriation is made and the state shall not reimburse local agencies for property tax revenues lost by them pursuant to the bill.\n\nThis bill would take effect immediately as a tax levy."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Bennett", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bennett\"}", "organization_id": null}, {"name": "Ahrens", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Ahrens\"}", "organization_id": null}, {"name": "Bauer-Kahan", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Bauer-Kahan\"}", "organization_id": null}, {"name": "Connolly", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Connolly\"}", "organization_id": null}, {"name": "Harabedian", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Harabedian\"}", "organization_id": null}, {"name": "Hart", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Hart\"}", "organization_id": null}, {"name": "Stern", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Stern\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1971", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1971", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/13/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1971&version=20250AB197199INT", "media_type": "application/pdf"}], "date": "2026-02-13", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1971", "note": ""}], "extras": {"impact_clause": "An act to add Section 74.1 to the Revenue and Taxation Code, relating to taxation, to take effect immediately, tax levy.", "tags": ["fiscal committee", "local program", "urgency", "tax levy"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-15T08:45:39+00:00", "_id": "b448c1fe-0a4a-11f1-8cce-128f59e91945"}