{"legislative_session": "20252026", "identifier": "AB1564", "title": "Medicinal cannabis: shipments.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Medicinalcannabis", "shipments"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Compassionate Use Act of 1996, an initiative measure enacted by Proposition 215 at the November 6, 1996, statewide general election, declares that its purpose is, among other things, to ensure that seriously ill Californians have the right to obtain and use marijuana for medical purposes, as specified, and exempts from state criminal liability certain patients and their primary caregivers who possess or cultivate marijuana for the personal medical purposes of the patient. \n\nThe Control, Regulate and Tax Adult-Use of Marijuana Act of 2016 (AUMA) , an initiative measure approved as Proposition 64 at the November 8, 2016, statewide general election, established a comprehensive system to legalize, control, and regulate the cultivation, processing, manufacture, distribution, testing, and sale of nonmedical marijuana. Existing law, the Medicinal and Adult-Use Cannabis Regulation and Safety Act (MAUCRSA) , among other things, consolidates the licensure and regulation of commercial medicinal and adult-use cannabis activities, including the retail sale of medicinal cannabis. MAUCRSA also authorizes specified licensees to provide free medicinal cannabis or medicinal cannabis products to medicinal cannabis patients if specified criteria are met.\n\nExisting law, the Medicinal Cannabis Patients' Right of Access Act, prohibits a local jurisdiction from adopting or enforcing any regulation that prohibits the retail sale by delivery within the local jurisdiction of medicinal cannabis to medicinal cannabis patients or their primary caregivers by medicinal cannabis businesses, as defined, or that has the effect of prohibiting the retail sale by delivery within the local jurisdiction of medicinal cannabis to medicinal cannabis patients or their primary caregivers, as specified.\n\nThis bill, until January 1, 2030, would authorize a licensed microbusiness with an M-license, as defined, whose licensed activities include retail sale, manufacturing, distribution, and outdoor cultivation to directly ship certain medicinal cannabis or medicinal cannabis products to a medicinal cannabis patient in the state, if the licensed microbusiness complies with specified requirements, including that the medicinal cannabis is shipped by a common carrier, as described, the amount shipped to a medicinal cannabis patient in a single day does not exceed specified possession limits, and the package is received and signed for by someone 21 years of age or older. The bill would require the shipment to comply with specified laws and regulations governing cannabis and cannabis products sold by licensed retailers, as provided. If the medicinal cannabis patient is a qualified patient that possesses a valid physician's recommendation, the bill would require the licensed microbusiness to certify in writing that they verified the recommendation and would require the retailer to keep a copy of that certification for no less than 7 years. The bill would amend the Medicinal Cannabis Patients' Right of Access Act to, among other things, prohibit a local jurisdiction from adopting or enforcing any regulation that prohibits the retail sale by delivery within or shipment into the local jurisdiction of medicinal cannabis to medicinal cannabis patients or their primary caregivers by a licensed microbusiness, as specified. The bill would also authorize free medicinal cannabis or medicinal cannabis products provided to medicinal cannabis patients in compliance with MAUCRSA to be shipped to those patients by a licensed microbusiness with an M-license, as provided.\n\nTo the extent this bill would impose additional duties on local jurisdictions, and to the extent the bill would expand the crime of perjury by requiring the licensed microbusiness to certify verification of physician recommendations, the bill would impose a state-mandated local program. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that with regard to certain mandates no reimbursement is required by this act for a specified reason.\n\nWith regard to any other mandates, this bill would provide that, if the Commission on State Mandates determines that the bill contains costs so mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 12.", "date": "2026-01-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Referred to Com. on B. & P.", "date": "2026-02-02", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on B. & P.", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Ahrens", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ahrens\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1564", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1564", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1564&version=20250AB156499INT", "media_type": "application/pdf"}], "date": "2026-01-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1564", "note": ""}], "extras": {"impact_clause": "An act to amend, repeal, and add Sections 26071, 26321, 26322, and 26323 of, and to add and repeal Section 26072 of, the Business and Professions Code, relating to cannabis.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-17T09:01:35+00:00", "_id": "42eca43a-0bdf-11f1-b31e-ca74f9f6c31f"}