{"legislative_session": "20252026", "identifier": "SB1417", "title": "Disaster preparedness: public water systems.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Disasterpreparedness", "publicwatersystems"], "abstracts": [{"note": "summary", "abstract": "Existing law, the California Emergency Services Act, requires all public water systems, as defined, with 10,000 or more service connections to review and revise their disaster preparedness plans in conjunction with related agencies, including, but not limited to, local fire departments and the Office of Emergency Services, to ensure that the plans are sufficient to address possible disaster scenarios. A person, as defined, who violates the provisions of this act is guilty of a misdemeanor.\n\nExisting law requires these public water systems, following a declared state of emergency, to furnish an assessment of their emergency response and recommendations to the Legislature within 6 months after each disaster, and to implement the recommendations in a timely manner. Existing law requires the office to establish emergency response and recovery plans in coordination with these public water systems.\n\nExisting law, the California Safe Drinking Water Act, requires the State Water Resources Control Board to administer provisions relating to the regulation of drinking water to protect public health.\n\nThis bill would require a disaster-impacted public water system, as defined, to conduct a disaster impact assessment within 6 months of a disaster, in coordination with the disaster-impacted county, as defined, before receiving state funding. The bill would require the assessment to include specified components, including determining whether the best interest of the affected residences, as defined, requires becoming a consolidated water system in order to ensure access to quality water and adequate supply, as provided. The bill would require the assessment to be provided to the State Water Resources Control Board. The bill would require a disaster-impacted public water system, in coordination with the disaster-impacted county, to adopt specified requirements into its assessment process, including making the coordinating bodies subject to the California Public Records Act, providing the opportunity for public comment, and arranging for live translations, as provided. Because a violation of these requirements by certain public water systems would constitute a misdemeanor, the bill would expand the scope of a crime, thereby imposing a state-mandated local program. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Pérez", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"P\\u00e9rez\"}", "organization_id": null}, {"name": "Haney", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Haney\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1417", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1417", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1417&version=20250SB141799INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1417", "note": ""}], "extras": {"impact_clause": "An act to add Section 8607.5 to the Government Code, relating to disaster preparedness.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:44:00+00:00", "_id": "77c9ecf6-0f01-11f1-bd68-62084ebb1ff2"}