{"legislative_session": "20252026", "identifier": "SB1238", "title": "Common interest developments: management.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Commoninterestdevelopments", "management"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law, the Davis-Stirling Common Interest Development Act (act) , provides for the creation and regulation of common interest developments.\n\nExisting civil law defines an agent as one who represents another, called the principal, in dealings with third persons.\n\nThis bill would revise the above-described definition of agent to include a person or company that facilitates activities pursuant to specified provisions of the act and that is required to provide a fiduciary duty to the board of a homeowner's association and its members.\n\nExisting law defines \"management services\" for purposes of a common interest development to mean specified acts performed or offered to be performed in an advisory capacity for an association, including implementing provisions of governing documents for the operation of the common interest development. \n\nThis bill would revise the above definition to specify that it means acts performed or offered to be performed by an agent, as defined above, in an advisory capacity for an association, as prescribed. \n\nExisting law defines \"professional association for common interest development managers\" to mean an organization that meets all of specified criteria, including having at least 200 members or certificants who are common interest development managers in California.\n\nThis bill would revise that definition to specify that it means an organization that employees an agent or agents, as defined, and that meets the above mentioned criteria. \n\n(2) Existing law requires the owner of a separate interest in a common interest development to provide specified documents to a prospective purchaser as soon as practicable before the transfer of title or execution of a real property sales contract, including a copy of all the governing documents for the association.\n\nThis bill would require the owner to provide additional information to a prospective purchaser, including, among other things, a separate disclosure regarding exterior elements and units requiring imminent repairs, if the association employs an association manager or management company. \n\n(3) Existing law prohibits the board of a common interest development from expending reserve funds for other than specified purposes, including repair, replacement, or maintenance of, or litigation involving major components, that the association is obligated to repair, replace, or maintain, and for which the reserve fund was established, subject to certain exceptions.\n\nThis bill would prohibit the board from expending reserve funds for other litigation, legal services, or to threaten litigation involving any real property owner of record or relative of the real property owner of record that is a member of the homeowner's association. The bill would make various other related and conforming changes to these provisions."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Wahab", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Wahab\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1238", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1238", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1238&version=20250SB123899INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1238", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 11500 and 11501 of the Business and Professions Code, and to amend Sections 2295, 4525, 5200, 5510, 5515, 5520, 5550, 5551, 5560, 5565, and 5570 of the Civil Code, relating to common interest developments.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:43:57+00:00", "_id": "764d163c-0f01-11f1-bd68-62084ebb1ff2"}