{"legislative_session": "20252026", "identifier": "SB888", "title": "Property taxation: disabled veterans' exemption: household income.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Propertytaxation", "disabledveterans'exemption", "householdincome"], "abstracts": [{"note": "summary", "abstract": "The California Constitution provides that all property is taxable, and requires that it be assessed at the same percentage of fair market value, unless otherwise provided by the California Constitution or federal law. The California Constitution and existing property tax law provide various exemptions from taxation, including, among others, a disabled veterans' exemption. Under existing law, the disabled veterans' exemption exempts from taxation part of the full value of property that constitutes the principal place of residence of a veteran, the veteran's spouse, or the veteran and veteran's spouse jointly, and the unmarried surviving spouse of a veteran, as provided, if the veteran incurred specified injuries or died while on active duty in military service, as described. Existing law exempts that part of the full value of the residence that does not exceed $100,000, or $150,000 if the household income of the claimant does not exceed $40,000, as adjusted for inflation, as specified.\n\nThis bill would, until January 1, 2037, exclude service-connected disability payments from the definition of \"household income\" for purposes of the disabled veterans' exemption. The bill would also correct an erroneous cross-reference in the above-described provisions. By imposing additional duties on local tax officials, the bill would impose a state-mandated local program.\n\nExisting law requires any bill authorizing a new tax expenditure to contain, among other things, specific goals, purposes, and objectives that the tax expenditure will achieve, detailed performance indicators, and data collection requirements.\n\nThis bill would include additional information required for any bill authorizing a new tax expenditure.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above.\n\nExisting law requires the state to reimburse local agencies annually for certain property tax revenues lost as a result of any exemption or classification of property for purposes of ad valorem property taxation.\n\nThis bill would provide that, notwithstanding those provisions, no appropriation is made and the state shall not reimburse local agencies for property tax revenues lost by them pursuant to the bill.\n\nThis bill would take effect immediately as a tax levy."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-01-14", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after February 14.", "date": "2026-01-15", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Seyarto", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Seyarto\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB888", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB888", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/14/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB888&version=20250SB88899INT", "media_type": "application/pdf"}], "date": "2026-01-14", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB888", "note": ""}], "extras": {"impact_clause": "An act to amend, repeal, and add Section 205.5 of the Revenue and Taxation Code, relating to taxation, to take effect immediately, tax levy.", "tags": ["fiscal committee", "local program", "urgency", "tax levy"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-27T08:44:45+00:00", "_id": "6e5d2db2-fb5c-11f0-9ff4-1ee6f1f535fe"}