{"legislative_session": "20252026", "identifier": "AB1881", "title": "California Indian Freedom Act of 2026.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaIndianFreedomActof2026"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes various protections for California Native American tribes, including prohibiting a public agency or private party using or occupying public property or operating on public property from interfering with the free expression or exercise of Native American religion as provided in the United States Constitution and the California Constitution. Existing law also requires a local government to provide formal notification to each California Native American tribe that is traditionally and culturally affiliated with the project site as an invitation to consult on the proposed project, as provided. Existing law requires the local government, during the consultation, to give deference to the tribal information, tribal knowledge and customs, and the significance of the resource to the California Native American tribe. Existing law prohibits any information, as described, that is submitted by a California Native American tribe during the environmental review process from being included in the environmental document or otherwise disclosed by the lead agency or any other public agency to the public, as specified, without the prior consent of the tribe that provided the information.\n\nExisting law, the California Public Records Act, requires each state and local agency, as defined, to make its records open to public inspection at all times during office hours, except as specifically exempted from disclosure by law. The act specifically exempts from disclosure records that are exempted or prohibited from disclosure by federal or state law and lists records subject to that exemption, specifying that the listed exemptions are not inclusive of all exemptions under the act. \n\nThis bill, the California Indian Freedom Act of 2026, would prohibit a governmental agency from substantially burdening a California Indian or California Native American tribe's exercise of religious beliefs or spiritual practices, including their access to and use of sacred sites and objects, and their ability to perform religious ceremonies and rites, even if the burden results from a rule of general applicability, unless the governmental agency demonstrates that application of the burden is in furtherance of a compelling governmental interest and is in the least restrictive means of furthering that interest. The act would apply to all state and local government actions, including, among others, permitting decisions, land use approvals, and enforcement actions. The bill would authorize a California Indian or tribe to assert a violation of these provisions as a claim or defense in any judicial or administrative proceeding, as specified. Before any governmental agency undertakes, approves, permits, funds, or authorizes a project that may impact a sacred site or cultural landscape, the bill would require the governmental agency to engage in early, meaningful and good-faith government-to-government consultation with an affected tribe. The bill would require a governmental agency to seek and document free, prior, and informed consent from affected tribes for any project that risks, among other things, physical destruction or alteration of a sacred site. The bill would require a government agency to avoid adverse impacts to sacred sites, as described, and allow California Indians access to sacred sites on public lands for Native American religious, ceremonial, or cultural activities, except as specified. The bill would require information identifying sacred sites, cultural landscapes, or religious practices to be confidential and would exempt this information from public record laws, including the California Public Records Act. The bill would revise the list of exempted records under the California Public Records Act to add the above-described exemption. The bill would define various terms for these purposes and would make related legislative findings. By imposing additional duties on local governmental agencies, this bill would impose a state-mandated local program. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason.\n\nThis bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nExisting constitutional provisions require that a statute that limits the right of access to the meetings of public bodies or the writings of public officials and agencies be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\nThis bill would make legislative findings to that effect.\n\nThe California Constitution requires local agencies, for the purpose of ensuring public access to the meetings of public bodies and the writings of public officials and agencies, to comply with a statutory enactment that amends or enacts laws relating to public records or open meetings and contains findings demonstrating that the enactment furthers the constitutional requirements relating to this purpose.\n\nThis bill would make legislative findings to that effect."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 15.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ramos", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ramos\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1881", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1881", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1881&version=20250AB188199INT", "media_type": "application/pdf"}], "date": "2026-02-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1881", "note": ""}], "extras": {"impact_clause": "An act to amend Section 7930.205 of the Government Code, and to add Chapter 1.79 (commencing with Section 5097.1000) to Division 5 of the Public Resources Code, relating to California Indians.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-18T09:02:53+00:00", "_id": "9c2a36ce-0ca8-11f1-b63b-c6889cfda9fe"}