{"legislative_session": "20252026", "identifier": "AB1801", "title": "Public agencies: approval: detention facilities.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Publicagencies", "approval", "detentionfacilities"], "abstracts": [{"note": "summary", "abstract": "Existing law prohibits a city, county, city and county, or public agency from approving or signing a deed, instrument, or other document related to a conveyance of land or issuing a permit for the building or reuse of existing buildings by any private corporation, contractor, or vendor to house or detain noncitizens for purposes of civil immigration proceedings, unless the city, county, city and county, or public agency has given notice to the public of the proposed conveyance or permitting action at least 180 days before execution of the conveyance or permit and solicited and heard public comments on the proposed conveyance or permit action in at least 2 separate meetings open to the public.\n\nThis bill would revise and recast those provisions to prohibit a city, county, city and county, or public agency from approving or executing, among other documents, any document signifying the public entity's approval for the building or reuse of existing buildings by any private corporation, contractor, or vendor to house or detain a person before the public entity has given notice to the public of the proposed action 180 days before execution or approval of the proposed action, promptly provided access to any documents related to the proposed action, as provided, and solicited and heard public comments on the proposed action in at least 2 separate meetings open to the public. The bill would prescribe the contents, the posting and publication, and the broadcast of the public notice. The bill would also prescribe the conduct of the meetings. The bill would make these provisions apply independently to a public entity.\n\nThe bill would specify that these provisions are declaratory of existing law."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 13.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Lee", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Lee\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1801", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1801", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/10/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1801&version=20250AB180199INT", "media_type": "application/pdf"}], "date": "2026-02-10", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1801", "note": ""}], "extras": {"impact_clause": "An act to amend Section 1670.9 of the Civil Code, relating to detention facilities.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-14T08:44:46+00:00", "_id": "6a408192-0981-11f1-baff-1a052d2b7fdd"}