{"legislative_session": "20252026", "identifier": "AB1672", "title": "Medi-Cal: Program of All-Inclusive Care for the Elderly: rates.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Medi-Cal", "ProgramofAll-InclusiveCarefortheElderly", "rates"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Medi-Cal program, which is administered by the State Department of Health Care Services and under which qualified low-income individuals receive health care services through various delivery systems, including fee-for-service and managed care. The Medi-Cal program is, in part, governed by, and funded pursuant to, federal Medicaid program provisions.\n\nExisting law establishes the California Program of All-Inclusive Care for the Elderly (PACE program) to provide community-based, risk-based, and capitated long-term care services as optional services for older individuals under the state's Medi-Cal State Plan and under contracts entered into between the federal Centers for Medicare and Medicaid Services, the department, and PACE organizations.\n\nExisting law requires the department to pay capitation rates to health plans participating in the Medi-Cal managed care program using actuarial methods. Existing law requires the department to develop and pay capitation rates to entities contracted pursuant to the PACE program, using actuarial methods consistent with those provisions, with specified exceptions. Existing law requires the department to consult with those contracted entities in developing a rate methodology.\n\nThis bill would delete the consultation-related requirement. Under the bill, and consistent with the requirements under federal law, capitation rates would be negotiated between the department and each contracting PACE organization. The bill would require the department, as part of this negotiation before submission for federal approval, to respond in writing to any comments made by a contracting PACE organization concerning prospective rates, provide the rationale for any assumptions or calculations concerning rates upon request, and make a good faith effort to reach agreement with the contracting PACE organization on capitation rates."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-02", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 5.", "date": "2026-02-03", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Referred to Com. on HEALTH.", "date": "2026-02-17", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on HEALTH.", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Solache", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Solache\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1672", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1672", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/02/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1672&version=20250AB167299INT", "media_type": "application/pdf"}], "date": "2026-02-02", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1672", "note": ""}], "extras": {"impact_clause": "An act to amend Section 14301.1 of the Welfare and Institutions Code, relating to Medi-Cal.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-18T09:02:50+00:00", "_id": "9a3ad864-0ca8-11f1-b63b-c6889cfda9fe"}