{"legislative_session": "20252026", "identifier": "AB1932", "title": "Department of Social Services: C.R.I.S.E.S. Grant Pilot Program.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CRISESGrantPilotProgram", "DepartmentofSocialServices"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the State Department of Social Services in the Health and Welfare Agency and sets forth its powers and duties relating to the administration of various programs relating to public social services.\n\nExisting law, until June 30, 2026, enacts the Community Response Initiative to Strengthen Emergency Systems Act, or the C.R.I.S.E.S. Act, for purposes of creating, implementing, and evaluating the C.R.I.S.E.S. Grant Pilot Program, which the act establishes. Existing law requires the department to administer the program if appropriate funding is made available to the department. Existing law requires, on or before January 1, 2023, the department to award grants to qualified grantees, which include city, county, and tribal departments of social services, disability services, health services, public health, or behavioral health, based on grant eligibility criteria developed in partnership with a stakeholder workgroup.\n\nThis bill would establish the Community Response Initiative to Strength Emergency Systems Act 2.0, or the C.R.I.S.E.S. Act 2.0, and the C.R.I.S.E.S. Grant Pilot Program 2.0. The bill requires, on or before January 1, 2028, the department to award grants to qualified community-based organization grantees based on grant eligibility criteria developed in partnership with a stakeholder workgroup.\n\nThe bill would require the department and the stakeholder workgroup to award each grantee a minimum award of $250,000 per year under the program. The bill would require funds awarded under the program to be utilized to create and strengthen community-based alternatives to law enforcement to lessen the reliance on law enforcement agencies as first responders to crisis situations unrelated to a fire department or emergency medical service response.\n\nThe bill would require a grantee to report at least annually to the department on the use of funding awarded under the program. The bill would require the department to convene a stakeholder workgroup consisting of specified individuals to make recommendations to the department regarding the implementation of the program, as specified. The bill would require the department to issue a public report, to be posted on its internet website 6 months following the end of the program, with specified information.\n\nThe bill would reestablish the Community Response Initiative to Strengthen Emergency Systems Program Fund within the State Treasury, and would authorize, upon appropriation by the Legislature, the moneys to be expended by the department for purposes of the program. The bill would prohibit the department from expending more than 5% of appropriated funds on administrative costs, as specified.\n\nThis bill would authorize the department to implement, interpret, or make specific the provisions of the program without taking regulatory action, as specified. The bill would grant immunity to the state from liability resulting from the activities of a grantee or community-based organization under the program.\n\nThis bill would make these provisions inoperative on June 30, 2031, and would repeal it as of January 1, 2032."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Elhawary", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Elhawary\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1932", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1932", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/13/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1932&version=20250AB193299INT", "media_type": "application/pdf"}], "date": "2026-02-13", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1932", "note": ""}], "extras": {"impact_clause": "An act to add and repeal Chapter 19.5 (commencing with Section 18999.950) of Part 6 of Division 9 of the Welfare and Institutions Code, relating to emergency services.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-16T09:02:20+00:00", "_id": "3341e4d8-0b16-11f1-8107-d26818b831da"}