{"legislative_session": "20252026", "identifier": "AB2194", "title": "Medi-Cal: special commissions.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Medi-Cal", "specialcommissions"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Medi-Cal program, administered by the State Department of Health Care Services, under which health care services are provided to qualified, low-income persons. The Medi-Cal program is, in part, governed and funded by federal Medicaid program provisions. Existing law authorizes a county board of supervisors to establish a commission to negotiate an exclusive contract with the department to provide, or arrange for the provision of, health care services under the Medi-Cal program.\n\nPursuant to the authority described above, the County of Orange established a 10-member commission, known as the Orange County Health Authority or CalOptima, to provide health care services under the Medi-Cal program. Existing law prescribes who can serve on the board and requires each member to serve a 4-year term, except as described.\n\nThis bill would require those terms to be staggered and would require, for the term beginning after January 1, 2027, 3 members to serve 2 years, with a 4-year term beginning thereafter. The bill would also require the commission to provide access to any books, documents, or records that are reasonably necessary to review the conduct of its activities to any authorized representative of the Board of Supervisors of the County of Orange. Because this bill would impose a unique requirement on how services are provided on a local government, the bill would impose a state-mandated local program.\n\nThis bill would make legislative findings and declarations as to the necessity of a special statute for County of Orange.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Valencia", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Valencia\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2194", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2194", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2194&version=20250AB219499INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2194", "note": ""}], "extras": {"impact_clause": "An act to amend Section 14087.59 of the Welfare and Institutions Code, relating to Medi-Cal.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:59+00:00", "_id": "419f8fae-0e3a-11f1-a618-2a6200350f1a"}