{"legislative_session": "20252026", "identifier": "SB1275", "title": "Sales and use tax exemption: vehicle license fee imposition: motor vehicles.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Salesandusetaxexemption", "motorvehicles", "vehiclelicensefeeimposition"], "abstracts": [{"note": "summary", "abstract": "(1) Existing state sales and use tax laws impose a tax on retailers measured by the gross receipts from the sale of tangible personal property sold at retail in this state or on the storage, use, or other consumption in this state of tangible personal property purchased from a retailer for storage, use, or other consumption in this state. The Sales and Use Tax Law provides various exemptions from those taxes.\n\nThis bill would, on and after January 1, 2027, and before January 1, 2032, exempt from those taxes the gross receipts from the sale of, and the storage, use, or other consumption of a new motor vehicle.\n\nExisting law requires a bill authorizing a new tax expenditure to contain, among other things, specific goals the tax expenditure will achieve, detailed performance indicators, and data collection requirements.\n\nThis bill would exclude the exemption from that requirement.\n\nThe Bradley-Burns Uniform Local Sales and Use Tax Law authorizes counties and cities to impose local sales and use taxes in conformity with the Sales and Use Tax Law, and existing laws authorize districts, as specified, to impose transactions and use taxes in accordance with the Transactions and Use Tax Law, which generally conforms to the Sales and Use Tax Law. Amendments to the Sales and Use Tax Law are automatically incorporated into the local tax laws.\n\nThis bill would provide that the exemption created by this bill does not apply to local sales and use taxes or transactions and use taxes.\n\nExisting law imposes or dedicates certain state sales and use tax rates for local funding, including through the Local Revenue Fund 2011.\n\nThis bill would provide that the exemption created by this bill does not apply to those state sales and use tax rates imposed or dedicated for local government funding, including those rates for which revenues are deposited into the Local Revenue Fund 2011.\n\n(2) The Vehicle License Fee Law imposes a license fee for the privilege of operating upon the public highways in this state of specified vehicles, including any vehicle of a type which is subject to registration under the Vehicle Code.\n\nThis bill would impose, on and after January 1, 2027, and before January 1, 2032, upon the first sale of a new motor vehicle to a consumer, an additional license fee equal to the amount of tax the purchaser would have paid but for the sales and use tax exemption provided for in this act. The bill would require the dealer to collect the license fee, as described, and remit the funds. The bill would require the Department of Motor Vehicles to report the amounts collected to the California Department of Tax and Fee Administration and deposit those moneys in the General Fund.\n\nThis bill would include a change in state statute that would result in a taxpayer paying a higher tax within the meaning of Section 3 of Article XIIIA of the California Constitution, and thus would require for passage the approval of 23 of the membership of each house of the Legislature.\n\n(3) This bill would take effect immediately as a tax levy."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "McNerney", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"McNerney\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1275", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1275", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1275&version=20250SB127599INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1275", "note": ""}], "extras": {"impact_clause": "An act to add and repeal Sections 6368.4 and 10752.3 of the Revenue and Taxation Code, relating to taxation, to take effect immediately, tax levy.", "tags": ["fiscal committee", "urgency", "tax levy"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:04+00:00", "_id": "ec176ad8-0fca-11f1-9ce2-72e66fa16e68"}