{"legislative_session": "20252026", "identifier": "AB1786", "title": "Public contracts: best value construction contracting for counties, cities, and joint powers authorities.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Publiccontracts", "bestvalueconstructioncontractingforcounties,cities,andjointpowersauthorities"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes a program to allow counties to select a bidder on the basis of best value, as defined, for construction projects in excess of $1,000,000. Existing law also authorizes counties to use a best value construction contracting method to award individual annual contracts, not to exceed $3,000,000, for repair, remodeling, or other repetitive work to be done according to unit prices, as specified. Existing law establishes procedures and criteria for the selection of a best value contractor and requires that bidders verify specified information under oath. Existing law requires the board of supervisors of a participating county to submit a report that contains specified information about the projects awarded using the best value procedures described above to the appropriate policy committees of the Legislature and the Joint Legislative Budget Committee before March 1, 2029. Existing law repeals the program provisions on January 1, 2030.\n\nThis bill would, instead, authorize a county, general law city, and eligible joint powers authority, as defined, to utilize this program, would make various conforming changes to the above-described provisions, and would extend the operation of those provisions until January 1, 2040. The bill would delete the provisions authorizing counties to use a best value construction contracting method to award individual annual contracts, not to exceed $3,000,000, for repair, remodeling, or other repetitive work to be done according to unit prices, as specified. With regard to the above-specified reporting requirement, the bill would, instead, require the governing body of a participating county, city, or eligible joint powers authority to submit the report, as specified, to the appropriate policy committees of the Legislature and the Joint Legislative Budget Committee before March 1, 2031. The bill would expand the crime of perjury by extending the operation of the program and expanding the program to general law cities and eligible joint powers authorities, thereby imposing a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 13.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Harabedian", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Harabedian\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1786", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1786", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/10/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1786&version=20250AB178699INT", "media_type": "application/pdf"}], "date": "2026-02-10", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1786", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 20155, 20155.1, 20155.3, 20155.4, 20155.5, 20155.6, 20155.7, and 20155.9 of, and to amend the heading of Article 3.7 (commencing with Section 20155) of Chapter 1 of Part 3 of Division 2 of, the Public Contract Code, relating to public contracts.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:06+00:00", "_id": "9f2f04fc-0f01-11f1-bd68-62084ebb1ff2"}