{"legislative_session": "20252026", "identifier": "SB1301", "title": "Residential property insurance: nonrenewals.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Residentialpropertyinsurance", "nonrenewals"], "abstracts": [{"note": "summary", "abstract": "Existing law creates the Department of Insurance, headed by the Insurance Commissioner, and generally regulates classes of insurance, including residential property insurance. Existing law requires an insurer to deliver to the named insured an offer of renewal, as specified, at least 45 days before the policy expiration and to deliver a notice of nonrenewal at least 75 days before the policy expiration. If the insurer fails to do so, existing law requires the existing policy, with no change in its terms and conditions, to remain in effect for 75 days from the date that the notice of nonrenewal is delivered or mailed to the named insured. Existing law requires nonrenewal notices to contain specified information.\n\nThis bill would, beginning July 1, 2027, require an insurer to either deliver to the named policyholder an offer of renewal at least 90 days before the policy expiration or a notice of nonrenewal or a notice of renewal with a reduction of limits or an elimination of coverage under the policy at least 180 days before the policy expiration. The bill would require the notice to contain specified information, including all information related to the basis for the nonrenewal or the reduction of limits or elimination of coverage, as specified. If the insurer fails to deliver an offer or notice to the named policyholder, the bill would require the existing policy to remain in effect for either 90 days from the date the offer of renewal is delivered or for 180 days from the date the notice of nonrenewal or notice of renewal with a reduction of limits or an elimination of coverage is delivered.\n\nThis bill would, beginning July 1, 2027, require an insurer that refuses to renew a policy or imposes a reduction of limits or an elimination of coverage to provide the policyholder with specified information, including a clear explanation of the grounds for the nonrenewal or reduction of limits or elimination of coverage. If an insurer issues a notice of nonrenewal or a notice of reduction of limits or elimination of coverage, the bill would require the insurer to provide the policyholder with a period of not less than 90 days to perform the necessary remediation or other change to the property or to provide additional information. The bill would require the insurer to provide an extension of up to 180 days, as specified, upon request of the policyholder. The bill would prohibit an insurer from refusing to issue or renew, or determine eligibility for, a residential property insurance policy on the basis of certain claims, on the basis of the policyholder's previous inquiry, or on the basis of the age of the roof under certain circumstances.\n\nOn or before April 1, 2028, and annually thereafter by that date, this bill would require an insurer to submit to the commissioner a report for the previous calendar year containing specified information, including the number of policies for which the insurer elected not to renew or imposed a reduction of limits or an elimination of coverage. On or before July 1, 2028, and annually thereafter by that date, the bill would require the commissioner to prepare and publish on the department's internet website an aggregated report for the previous calendar year of the information reported by insurers."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Allen", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Allen\"}", "organization_id": null}, {"name": "Pérez", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"P\\u00e9rez\"}", "organization_id": null}, {"name": "Harabedian", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Harabedian\"}", "organization_id": null}, {"name": "Wiener", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Wiener\"}", "organization_id": null}, {"name": "Connolly", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Connolly\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1301", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1301", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1301&version=20250SB130199INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1301", "note": ""}], "extras": {"impact_clause": "An act to amend, repeal, and add Section 678 of, and to add Sections 676.11, 676.12, 676.13, and 676.14 to, the Insurance Code, relating to insurance.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:43:58+00:00", "_id": "76da9002-0f01-11f1-bd68-62084ebb1ff2"}