{"legislative_session": "20252026", "identifier": "AB2748", "title": "Building standards: affordable housing developments: electric vehicle charging.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Buildingstandards", "affordablehousingdevelopments", "electricvehiclecharging"], "abstracts": [{"note": "summary", "abstract": "Existing law, the State Housing Law, establishes statewide construction and occupancy standards for buildings used for human habitation. Existing law requires the building department of every city or county to enforce within its jurisdiction all the provisions published in the California Building Standards Code and the provisions of the State Housing Law, as provided. Existing law makes any violation of the State Housing Law a misdemeanor punishable by a fine not exceeding $1,000, by imprisonment not exceeding 6 months, or by both.\n\nExisting law requires the California Building Standards Commission and the Department of Housing and Community Development to research and develop, and authorizes those entities to propose for adoption by the commission, mandatory building standards for the installation of electric vehicle charging stations in existing multifamily dwellings, hotels, motels, and nonresidential developments, as provided.\n\nThis bill would exempt a new or existing affordable housing development, as defined, for which a permit application is submitted between January 1, 2025, and December 31, 2035, from the requirements for installation of low power Level 2 or higher electric vehicle charging receptacles in the 2025 California Green Building Standards Code, as provided. The bill would, instead, require those affordable housing developments for which a permit application is submitted between January 1, 2025, and December 31, 2035, to comply with the applicable requirements for installation of low power Level 2 or higher electric vehicle charging receptacles in the 2022 edition of the California Building Standards Code. The bill would repeal these provisions on January 1, 2037. By adding to the duties of local officials, and by expanding the scope of a crime, this bill would impose a state-mandated local program.\n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that with regard to certain mandates no reimbursement is required by this act for a specified reason.\n\nWith regard to any other mandates, this bill would provide that, if the Commission on State Mandates determines that the bill contains costs so mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Quirk-Silva", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Quirk-Silva\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2748", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2748", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2748&version=20250AB274899INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2748", "note": ""}], "extras": {"impact_clause": "An act to add and repeal Section 17929.1 of the Health and Safety Code, relating to building standards.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:45+00:00", "_id": "282556f2-0fcb-11f1-9ce2-72e66fa16e68"}