{"legislative_session": "20252026", "identifier": "AB1751", "title": "Missing Middle Townhome Ownership Act.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["MissingMiddleTownhomeOwnershipAct"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Planning and Zoning Law, contains various provisions requiring a local government that receives an application for certain types of qualified housing developments to review the application under a streamlined, ministerial approval process depending on the type of housing development, as specified. Existing law, the Subdivision Map Act, vests the authority to regulate and control the design and improvement of subdivisions in the legislative body of a local agency and sets forth procedures governing the local agency's processing, approval, conditional approval or disapproval, and filing of tentative, final, and parcel maps, and the modification thereof. The act generally requires a subdivider to file a tentative map or vesting tentative map with the local agency, as specified, and the local agency, in turn, to approve, conditionally approve, or disapprove the map within a specified time period. Existing law, known as the Starter Home Revitalization Act of 2021, among other things, requires a local agency to ministerially consider, without discretionary review or a hearing, a parcel map or a tentative and final map for a housing development project that meets certain requirements, including that the housing development project on the lot proposed to be subdivided will contain 10 or fewer residential units, except as provided.\n\nThe California Environmental Quality Act (CEQA) requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of, an environmental impact report on a project that it proposes to carry out or approve that may have a significant effect on the environment or to adopt a negative declaration if it finds that the project will not have that effect. CEQA also requires a lead agency to prepare a mitigated negative declaration for a project that may have a significant effect on the environment if revisions in the project would avoid or mitigate that effect and there is no substantial evidence that the project, as revised, would have a significant effect on the environment. CEQA does not apply to the approval of ministerial projects. \n\nThis bill, the Missing Middle Townhome Ownership Act, would authorize a development proponent to submit an application for a townhome housing development project that is subject to a prescribed ministerial approval process if the development complies with certain procedural requirements and satisfies specified objective planning standards. The bill would also require a local agency to ministerially consider, without discretionary review or a hearing, a parcel map or a tentative and final map for a townhome development project that meets all of specified requirements, including that the proposed subdivision will result in parcels and residential units that will meet prescribed densities and that the newly created parcels are no smaller than 600 square feet. The act would define \"townhome\" for these purposes to mean a single-family dwelling unit that is less than or equal to 3 stories of occupiable square footage and shares a common wall, as specified, or is separated from one or more neighboring units by an air gap, and would define \"townhome development project\" to mean a housing development project consisting entirely of residential dwelling units that satisfy this definition of townhome. The bill would authorize a local agency to disapprove a townhome housing development project, or deny the issuance of a parcel map, a tentative map, or a final map for a townhome development project, allowed under the bill's provisions if it makes written findings based upon a preponderance of the evidence that the proposed townhome housing development project would have a specific, adverse impact, as provided in specified law, upon public health and safety and for which there is no feasible method to satisfactorily mitigate or avoid the specific, adverse impact. The bill would authorize a local agency to adopt an ordinance to implement its provisions and would provide that the adoption of such an ordinance is not a project under CEQA.\n\nBy establishing new ministerial approval processes relating to townhome development projects, as described above, this bill would expand the scope of the exemption from CEQA for ministerial projects. Further, by adding to the duties of local officials with respect to the review and approval of townhome development projects, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 12.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Quirk-Silva", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Quirk-Silva\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1751", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1751", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/09/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1751&version=20250AB175199INT", "media_type": "application/pdf"}], "date": "2026-02-09", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1751", "note": ""}], "extras": {"impact_clause": "An act to add Section 65852.29 to, and to add Chapter 9 (commencing with Section 66499.45) to Division 2 of Title 7 of, the Government Code, relating to housing.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-11T09:04:20+00:00", "_id": "a6ceac52-0728-11f1-b7c8-26f8b3304434"}