{"legislative_session": "20252026", "identifier": "SB222", "title": "Residential heat pump systems: water heaters and HVAC: installations.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Residentialheatpumpsystems", "installations", "waterheatersandHVAC"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law establishes the State Energy Resources Conservation and Development Commission and prescribes the authorities, duties, and responsibilities of the commission pertaining to energy matters. Existing law requires the commission, on or before January 1, 2019, in consultation with the Contractors State License Board, local building officials, and other stakeholders, to approve a plan that promotes compliance with specified regulations relating to building energy efficiency standards in the installation of central air-conditioning and heat pumps, as specified. Existing law authorizes the commission to adopt regulations to increase compliance with permitting and inspection requirements for central air-conditioning and heat pumps, and associated sales and installations, consistent with the above-described plan.\n\n The bill would require a city, county, or city and county, beginning July 1, 2027, to adopt and offer asynchronous inspections for installations of residential heat pump water heater or heat pump HVAC systems, as defined, that do not require a licensed contractor and building inspector to be simultaneously present during the inspection. The bill would authorize a building inspector to contact the licensed contractor who performed the installation by telephone call or real-time video conferencing during their inspection, and, if the building inspector determines during an asynchronous inspection that there is an issue with an installation of the heat pump water heater or heat pump HVAC system and that the licensed contractor who performed the installation must be present to perform tests or cure the installation, to require the licensed contractor who performed the installation to schedule an additional inspection in which the building inspector and the licensed contractor who performed the installation are required to be simultaneously present during the additional inspection. The bill would specify that these provisions do not require a local entity described above to discontinue offering inspections for the installation of a residential heat pump water heater or heat pump HVAC system where in a building inspector and licensed contractor who performed the installation are simultaneously present.\n\nThe bill would authorize a city, county, or city and county, on or before July 1, 2028, and except as specified, to issue up to one nondiscretionary permit per installation of a residential heat pump water heater or heat pump HVAC system in which the local entity administratively approves an application to install the residential heat pump water heater or heat pump HVAC system. The bill would specify that nothing in that provision is to be construed to prevent a local entity described above from issuing separate permits for a panel replacement or demolition work conducted as part of the residential heat pump installation.\n\nThe bill would authorize a city, county, or city and county to apply only certain planning or zoning or workforce labor standards on the installation of a residential heat pump water heater or residential heat pump HVAC system that are in addition to any state-level requirements, including additional standards that conform to local laws, including reach codes, designed to encourage the adoption of zero-emission equipment or improvement of building efficiency. The bill would prohibit a local entity described above from requiring a permit or inspection for plug-in ready window air-conditioner or window heat pump HVAC systems, provided that certain requirements are met, including that the appliance has a voltage rating of 120 volts or less and the appliance is a self-contained unit.\n\nThe bill would require a city, county, or city and county, on or before July 1, 2028, to implement an online, automated permitting process that issues permits in real time to a licensed contractor for the installation of a residential heat pump water heater or residential heat pump HVAC system that meets certain criteria, including that the installation is for a residential heat pump water heater or heat pump HVAC system that does not require installation of a new electrical panel or structural work, and if the installation is for a residential heat pump HVAC system, that the licensed contractor certifies under penalty of perjury that they have performed a load calculation to properly size the new residential heat pump HVAC equipment per certain provisions and provides the load calculation to the local authority having jurisdiction upon request. By expanding the crime of perjury, the bill would impose a state-mandated local program. The bill would specify the methods that a local entity described above may use to comply with the above-described requirement, including, among other things, an automated platform that can issue permits in real time. The bill would require, for an installation of a residential heat pump water heater or heat pump HVAC system, the local entity to publish and make publicly available, among other things, any required permitting documentation, on their internet website. The bill would require the local entity to allow an applicant to, among other things, submit a permit application and associated documentation electronically. The bill would exempt from these provisions a city with a population of fewer than 5,000 persons or a county with a population of fewer than 150,000 persons, as specified.\n\nThe bill would, except as provided, prohibit a city, county, or city and county from charging a permit fee for a residential heat pump water heater and heat pump HVAC system that exceeds the estimated reasonable cost of providing the service for which the fee is charged, subject to specified requirements, including that the permit fee for a residential heat pump water heater system does not exceed $150. The bill would, notwithstanding that provision, authorize a local entity described above to charge a permit fee, as specified, for the installation of a residential heat pump water heater or heat pump HVAC system that exceeds the above-described fee limit, as specified, if the local entity, as part of a written finding and an adopted resolution or ordinance, provides substantial evidence of the reasonable cost to issue the permit, and would prohibit a local entity described above from applying additional charges above the publicly listed fee.\n\nThe bill would require a local entity described above that applies to receive any funding from the commission to self-certify to the commission its compliance with any applicable portions of the bill's provisions. By imposing additional duties on local entities described above, the bill would impose a state-mandated local program.\n\nThe bill would include findings and declarations related to these provisions.\n\n(2) Existing law, the Davis-Stirling Common Interest Development Act, defines and regulates common interest developments. Among other things, the act makes a provision of the governing document or architectural or landscaping guidelines or policies void and unenforceable if, among other things, the provision prohibits, or includes conditions that have the effect of prohibiting, the use of low water-using plants as a group or as a replacement of existing turf.\n\nThis bill would additionally make any provision of the governing documents, architectural guidelines, or policies void and unenforceable if the provision prevents the replacement of a fuel-gas-burning appliance with an electric appliance. The bill would also make any covenant, restriction, or condition contained in any, among other specified agreements, deed, and any provision of a governing document, that effectively prohibits or restricts the installation or use of a residential heat pump water heater or heat pump HVAC system, void and unenforceable.\n\n(3) The bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\n(4) The California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, with regard to certain mandates, no reimbursement is required by this act for a specified reason.\n\nWith regard to any other mandates, this bill would provide that, if the Commission on State Mandates determines that the bill contains costs so mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [{"note": "", "title": "Climate disasters: civil actions."}], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2025-01-27", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after February 27.", "date": "2025-01-28", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Referred to Coms. on JUD. and INS.", "date": "2025-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Coms. on JUD. and INS.", "entity_type": "organization", "organization_id": null}]}, {"description": "Set for hearing April 8.", "date": "2025-03-25", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "From committee with author's amendments. Read second time and amended. Re-referred to Com. on JUD.", "date": "2025-03-28", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["amendment-passage", "committee-passage", "reading-1", "reading-2", "referral-committee"], "related_entities": [{"name": "Com. on JUD.", "entity_type": "organization", "organization_id": null}]}, {"description": "April 8 set for first hearing. Failed passage in committee. (Ayes 5. Noes 2. Page 705.) Reconsideration granted.", "date": "2025-04-08", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["committee-failure"], "related_entities": []}, {"description": "Set for hearing January 6 in HOUSING pending receipt.", "date": "2026-01-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "From committee with author's amendments. Read second time and amended. Re-referred to Com. on JUD.", "date": "2026-01-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["amendment-passage", "committee-passage", "reading-1", "reading-2", "referral-committee"], "related_entities": [{"name": "Com. on JUD.", "entity_type": "organization", "organization_id": null}]}, {"description": "Withdrawn from committee.", "date": "2026-01-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Re-referred to Com. on RLS.", "date": "2026-01-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on RLS.", "entity_type": "organization", "organization_id": null}]}, {"description": "Re-referred to Coms. on HOUSING and L. GOV.", "date": "2026-01-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Coms. on HOUSING and L. GOV.", "entity_type": "organization", "organization_id": null}]}, {"description": "From committee: Do pass and re-refer to Com. on L. GOV. (Ayes 10. Noes 0. Page 3183.) (January 6). Re-referred to Com. on L. GOV.", "date": "2026-01-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["committee-passage", "committee-passage-favorable", "referral-committee"], "related_entities": [{"name": "Com. on L. GOV.", "entity_type": "organization", "organization_id": null}]}, {"description": "Set for hearing January 14.", "date": "2026-01-08", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "From committee: Do pass as amended and re-refer to Com. on APPR. (Ayes 4. Noes 1. Page 3224.) (January 14).", "date": "2026-01-14", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["amendment-passage", "committee-passage", "committee-passage-favorable"], "related_entities": []}, {"description": "Read second time and amended. Re-referred to Com. on APPR.", "date": "2026-01-15", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["amendment-passage", "reading-1", "reading-2", "referral-committee"], "related_entities": [{"name": "Com. on APPR.", "entity_type": "organization", "organization_id": null}]}, {"description": "Set for hearing January 20.", "date": "2026-01-15", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "From committee: Be ordered to second reading pursuant to Senate Rule 28.8.", "date": "2026-01-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["committee-passage", "reading-2"], "related_entities": []}, {"description": "Read second time. Ordered to third reading.", "date": "2026-01-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1", "reading-2"], "related_entities": []}, {"description": "Read third time. Passed. (Ayes 29. Noes 8. Page 3279.) Ordered to the Assembly.", "date": "2026-01-26", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["passage", "reading-1", "reading-3"], "related_entities": []}, {"description": "In Assembly. Read first time. Held at Desk.", "date": "2026-01-26", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Wiener", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Wiener\"}", "organization_id": null}, {"name": "Allen", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Allen\"}", "organization_id": null}, {"name": "Becker", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Becker\"}", "organization_id": null}, {"name": "Stern", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Stern\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB222", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB222", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/27/25 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB222&version=20250SB22299INT", "media_type": "application/pdf"}], "date": "2025-01-27", "classification": ""}, {"note": "03/28/25 - Amended Senate", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB222&version=20250SB22298AMD", "media_type": "application/pdf"}], "date": "2025-03-28", "classification": ""}, {"note": "01/05/26 - Amended Senate", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB222&version=20250SB22297AMD", "media_type": "application/pdf"}], "date": "2026-01-05", "classification": ""}, {"note": "01/15/26 - Amended Senate", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB222&version=20250SB22296AMD", "media_type": "application/pdf"}], "date": "2026-01-15", "classification": ""}], "documents": [{"note": "04/04/25- Senate Judiciary", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202520260SB222&analysisId=383369&analyzingOffice=Senate+Judiciary", "media_type": "application/pdf"}], "date": "2025-04-04", "classification": "analysis"}, {"note": "12/30/25- Senate Housing", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202520260SB222&analysisId=393738&analyzingOffice=Senate+Housing", "media_type": "application/pdf"}], "date": "2025-12-30", "classification": "analysis"}, {"note": "01/09/26- Senate Local Government", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202520260SB222&analysisId=393818&analyzingOffice=Senate+Local+Government", "media_type": "application/pdf"}], "date": "2026-01-09", "classification": "analysis"}, {"note": "01/21/26- Sen. Floor Analyses", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202520260SB222&analysisId=393971&analyzingOffice=Sen.+Floor+Analyses", "media_type": "application/pdf"}], "date": "2026-01-21", "classification": "analysis"}], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB222", "note": ""}], "extras": {"impact_clause": "An act to add Section 4737 to the Civil Code, and to add Chapter 7.5 (commencing with Section 51297.50) to Part 1 of Division 1 of Title 5 of the Government Code, relating to housing.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-16T09:01:11+00:00", "_id": "0a755242-0b16-11f1-8107-d26818b831da"}