{"legislative_session": "20252026", "identifier": "AB2047", "title": "Firearms: 3-dimensional printing blocking technology.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["3-dimensionalprintingblockingtechnology", "Firearms"], "abstracts": [{"note": "summary", "abstract": "Existing law makes it a crime to knowingly or willfully cause another person to engage in the unlawful manufacture of firearms or knowingly or willfully aiding, abetting, prompting, or facilitating the unlawful manufacture of firearms, including the manufacture of assault weapons or .50 BMG rifles or the manufacture of any firearm using a 3-dimensional printer, as specified.\n\nThis bill would require the Department of Justice or other relevant state agency to engage in an investigation of known firearm blueprint design files and existing firearm blueprint detection algorithms, as defined. The bill would require, on or before July 1, 2027, the department or other relevant state agency to publish written guidance on performance standards for persons or entities engaged in the creation of firearm blueprint detection algorithm to be certified for use by 3-dimensional printer manufacturers, as specified. The bill would require the department or other relevant state agency that prepared the written guidance on performance standards to accept applications for certification of firearms blueprint detection algorithms and begin issuing certifications of algorithms that meet or exceed the performance standards on or before January 1, 2028, and would specify the grounds for revocation of certification pursuant to these provisions. The bill would require the department or other relevant state agency to publish written guidance on how to equip 3-dimensional printers with firearm blocking technology, as defined, and would require the performance standards to be publicly available on the department or other relevant state agency's website. \n\nThis bill would require, on or before July 1, 2028, any business that produces or manufactures 3-dimensional printers for sale or transfer in California to submit to the department an attestation for each make and model of printer they intend to make available for sale or transfer in California, confirming, among other things, that the manufacturer has equipped that make and model with a certified firearm blueprint detection algorithm. If the department verifies a printer make and model is properly equipped, the bill would require the department to issue a notice of compliance, as specified. The bill would require, on or before September 1, 2028, the department to publish a list of all the makes and models of 3-dimensional printers whose manufacturers have submitted complete self-attestations and would require the department to update the list no less frequently than on a quarterly basis and to make the list available on the department's internet website. The bill, beginning on March 1, 2029, would prohibit the sale or transfer of 3-dimensional printers that are not equipped with firearm blocking technology and that are not listed on the department's list of manufacturers with a certificate of compliance verification, except as specified. The bill would authorize a civil action to be brought against a person who sells, offers to sell, or transfers a printer without the firearm blocking technology. \n\nThis bill would also make it a crime to knowingly disable, deactivate, uninstall, or otherwise circumvent any firearm blocking technology installed in a 3-dimensional printer with intent to manufacture firearms or to distribute, sell, or transfer for consideration in California one or more modified versions of a 3-dimensional printer identified on the Department of Justice's list of 3-dimensional printers eligible for sale in California. By creating a new crime, this bill would impose a state-mandated local program.\n\nThis bill would make these provisions severable.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-17", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Bauer-Kahan", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bauer-Kahan\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2047", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2047", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/17/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2047&version=20250AB204799INT", "media_type": "application/pdf"}], "date": "2026-02-17", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2047", "note": ""}], "extras": {"impact_clause": "An act to add Title 21.1 (commencing with Section 3273.631) to Part 4 Division 3 of the Civil Code, and to add Section 29187 to the Penal Code, relating to firearms.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-18T09:02:56+00:00", "_id": "9db0f37a-0ca8-11f1-b63b-c6889cfda9fe"}