{"legislative_session": "20252026", "identifier": "AB1779", "title": "Alcoholism and drug abuse recovery and treatment programs: inducement of participants.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Alcoholismanddrugabuserecoveryandtreatmentprograms", "inducementofparticipants"], "abstracts": [{"note": "summary", "abstract": "Existing law provides for the licensure and regulation of drug testing laboratories and adult alcoholism or drug abuse recovery or treatment facilities and provides for the certification and regulation of adult alcoholism or drug abuse recovery or treatment programs by the State Department of Health Care Services and authorizes the department to enforce those provisions. Existing law authorizes a facility described above to offer transportation services to an individual who is seeking recovery or treatment services only if specified conditions are met, including, among other things, that any air transportation provided to the individual includes a return ticket that may be used by the individual upon discharge and that a return ticket not used by an individual upon discharge is made available to the individual upon request for a period of one year following the individual's discharge.\n\nThis bill would require a laboratory, facility, or program described above that provides air transportation to provide a ticket for round-trip transportation, to obtain written acknowledgment by the individual that the transportation is not tied to insurance benefits or program participation, to document the purpose and cost of the transportation, to compile information related to the provision of transportation, and to annually publish the compiled information on its internet website. The bill would require a laboratory, facility, or program to retain the information for a minimum of 5 years and to provide that information to the department upon request.\n\nThe bill would prohibit a laboratory, facility, or program described above from offering or providing any form of remuneration, including, but not limited to, a stipend or gift card, for specified purposes, including, among others, to influence or induce an individual to enter or stay in a treatment or recovery program or to recruit individuals for treatment, unless otherwise specified."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 12.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Davies", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Davies\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1779", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1779", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/09/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1779&version=20250AB177999INT", "media_type": "application/pdf"}], "date": "2026-02-09", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1779", "note": ""}], "extras": {"impact_clause": "An act to amend Section 11831.65 of, and to add Section 11831.66 to, the Health and Safety Code, relating to drug and alcohol programs.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-11T09:04:20+00:00", "_id": "a70900aa-0728-11f1-b7c8-26f8b3304434"}