{"legislative_session": "20252026", "identifier": "AB2221", "title": "Supervision of Trustees and Fundraisers for Charitable Purposes Act.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["SupervisionofTrusteesandFundraisersforCharitablePurposesAct"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Supervision of Trustees and Fundraisers for Charitable Purposes Act, requires the Attorney General to, among other things, establish and maintain a register of charitable corporations, unincorporated associations, and trustees subject to the act and of the particular trust or other relationship under which they hold property for charitable purposes. Existing law requires the Attorney General to establish rules and regulations necessary for the administration of these provisions. \n\nExisting law requires a charitable fundraising platform, as defined, before soliciting, permitting, or otherwise enabling charitable solicitations, to register with the Attorney General's Registry of Charities and Fundraisers, under oath, on a form provided by the Attorney General. Existing law requires a platform charity to have good standing, as defined, in order to facilitate acts of solicitation on a charitable fundraising platform. Existing law permits a charitable fundraising platform or platform charity to solicit, permit, or otherwise enable solicitations, or to receive, control, or distribute funds from donations, only for recipient charitable organizations or other charitable organizations in good standing. Existing law authorizes a charitable fundraising platform or platform charity to rely upon specified electronic lists to determine good standing of recipient charitable organizations or other charitable organizations, however, if those lists are not published, then a charitable fundraising platform or platform charity is not required to comply with this provision for that applicable agency for the length of time that agency's list is unavailable.\n\nThis bill would remove the provisions described above that authorize a charitable fundraising platform or platform charity to rely upon specified electronic lists to determine good standing of recipient charitable organizations, or other charitable organizations and excuse compliance if the list is not published. Instead, the bill would specify that the directive that charitable fundraising platforms or platform charities only solicit, permit, or otherwise enable solicitations, or receive, control, or distribute funds from donations for recipient charitable organizations or other charitable organizations in good standing does not apply to charitable organizations that are not subject to the registration requirements of the act.\n\nExisting law requires a charitable fundraising platform or platform charity that performs, permits, or otherwise enables acts of solicitation to, before a person can complete a donation or select or change a recipient charitable organization, provide conspicuous disclosures, including, among other things, a statement that a recipient charitable organization may not receive donations or grants or recommended donations, with an explanation identifying the most pertinent reasons why a recipient charitable organization may not receive the funds.\n\nThis bill would also require the statement described above to include an explanation of what alternative disposition will occur for the funds, as specified, and make other conforming changes.\n\nExisting law requires that the rules and regulations established by the Attorney General for the administration of the registry include, among other things, provisions that specify the requirements for holding donations or distributing donations and grants of recommended donations, including the maximum length of times it takes to send the donated funds, as specified.\n\nThis bill would instead require that the adopted rules and regulations specify the maximum amount of time it takes to send the donated funds to a recipient charitable organization that has not provided consent for a solicitation.\n\nThis bill would require that registration statements, notices, or reports and supporting documents filed by any individual or legal entity subject to the act be deemed approved, and that the approval be included in the Registry of Charities and Fundraisers, within 10 business days from the date of filing, unless the Attorney General notifies a filer of a determination that the requirements of the act have not been met, and notes the specific deficiencies. The bill would authorize an individual or entity that receives a notification that a registration, notice, or reporting requirement is not satisfied to request a hearing within 15 days to determine the sufficiency of the filing, as specified."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Irwin", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Irwin\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2221", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2221", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2221&version=20250AB222199INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2221", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 12599.9 and 12599.10 of, and to add Section 12599.11 to, the Government Code, relating to charitable fundraising.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:58:00+00:00", "_id": "41f28d44-0e3a-11f1-a618-2a6200350f1a"}