{"legislative_session": "20252026", "identifier": "SB677", "title": "Housing development: streamlined approvals.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Housingdevelopment", "streamlinedapprovals"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law, the Planning and Zoning Law, requires a proposed housing development containing no more than 2 residential units within a single-family residential zone to be considered ministerially, without discretionary review or hearing, if the proposed housing development meets certain requirements.\n\nThis bill would require ministerial approval for proposed housing developments containing no more than 2 residential units on any lot hosting a single-family home or zoned for 4 or fewer residential units, notwithstanding any covenant, condition, or restriction imposed by a common interest development association.\n\nExisting law prohibits ministerial approval for proposed housing developments that would require the demolition or alteration of housing that, among other things, has been occupied by a tenant in the last three years.\n\nThis bill would provide an exception to that prohibition for housing located in a county subject to a state of emergency declaration, as specified. The bill would also provide an exemption to the prohibition if a structure on the development site that includes at least one housing unit was involuntarily damaged or destroyed by an earthquake, other catastrophic event, or the public enemy.\n\nExisting law authorizes a local agency to impose objective zoning standards, objective subdivision standards, and objective design review standards on the proposed housing development, except as specified, including that (1) the imposed standards may not have the effect of physically precluding a unit from being at least 800 square feet in floor area, (2) a local agency's authority to impose, among other things, setbacks, is restricted, and (3) the local agency is prohibited from imposing standards that do not apply uniformly to development within the underlying zone.\n\nThis bill would revise and recast those provisions to, among other things, as to the exceptions specified above, raise the minimum size of a unit to 1,750 net habitable square feet, revise a local agency's authority to impose setbacks, and, in addition to objective standards, prohibit a local agency from imposing permitting requirements that do not apply uniformly to development within the underlying zone, except as specified. The bill would prohibit a local agency from imposing a low-income deed restriction or covenant that restricts rents, as specified. The bill would prohibit local agencies from using or imposing any standards other than those provided by its provisions.\n\nExisting law authorizes a local agency to adopt an ordinance to implement these provisions.\n\nThis bill would require a local agency that has adopted an ordinance to submit a copy of that ordinance to the Department of Housing and Community Development within 60 days after adoption, as specified. The bill would authorize the department to review the ordinance and submit written findings to the local agency as to whether the ordinance is in compliance with these provisions. Should the department conclude an ordinance is not in compliance, the bill would establish a process for the department to notify the local agency and the local agency to amend the ordinance or adopt the ordinance without changes, as provided. The bill would require the local agency to include the ordinance with the annual housing element report.\n\nThe bill would prohibit a local agency from denying a proposed housing development due to the presence of preexisting issues under specified conditions, including that the issues do not present a threat to public health and safety.\n\nThe bill would also require a local agency to provide applicants with a single application for a housing development that falls under these provisions and also involves an urban lot split to review both applications concurrently.\n\nThis bill would prohibit the imposition of an impact fee, as defined, upon a proposed housing development that is less than 1,750 square feet and require any impact fees imposed on proposed developments of 1,750 square feet or greater to be charged proportionately.\n\n(2) The Planning and Zoning Law authorizes a development proponent to submit an application for a multifamily housing development that is subject to a streamlined, ministerial approval process, as provided, and not subject to a conditional use permit, if the development satisfies specified objective planning standards. These standards include that, among other things, the development is subject to a requirement mandating a minimum percentage of below market rate housing because the locality's latest production report reflects there were fewer units of affordable housing issued building permits than required for the regional housing needs assessment cycle for that period and the project seeking approval dedicates 50 percent of the units to affordable housing, as specified. The standards include that the development is not located on a site that meets specified environmental criteria. The standards also include that the development is not located on a site that would require the demolition of specified types housing, including, among others, a historic structure that was placed on a national, state, or local historic register. \n\nThe bill would revise the first planning standard so that it would be met if a development meets the above-described criteria and dedicates 20 percent of the units to affordable housing, as specified. The bill would revise the second planning standard so that it would be met if a development is not located within a site that meets specified criteria. The bill would revise the third planning standard to instead include a development is not located on a site that would require the demolition of a property individually listed on the National Register of Historic Places or the California Register of Historical Resources historic or of a contributing structure located within a historic district included on the National Register of Historic Places or the California Register of Historical Resources. The bill would also exempt a proposed housing development from restrictions on demolition if a structure on the development site that includes at least one housing unit was involuntarily damaged or destroyed by an earthquake, other catastrophic event, or the public enemy.\n\nExisting law provides that a development is consistent with the objective planning standards in these provisions if there is substantial evidence that would allow a reasonable person to conclude that the development is consistent and prohibits a local government from determining a development is in conflict on a specified basis, as provided.\n\nThis bill would require the local government to bear the burden of proof in any evaluation of a development related to compliance with objective planning standards related to specified environmental criteria, as provided. The bill would require a local government to demonstrate, with a preponderance of the evidence, that the development does not comply with the applicable environmental criteria established under state or federal law, as provided.\n\nExisting law defines a \"reporting period\" as either the first or last half of the regional housing needs assessment cycle.\n\nThis bill would require the reporting period to instead include each quarter of the regional housing needs assessment cycle.\n\n(3) The Subdivision Map Act vests the authority to regulate and control the design and improvement of subdivisions in the legislative body of a local agency and sets forth procedures governing the local agency's processing, approval, conditional approval or disapproval, and filing of tentative, final, and parcel maps, and the modification of those maps. Existing law requires a local agency to ministerially approve a parcel map for an urban lot split that meets certain requirements, including that one parcel is not smaller than 40% of the lot area of the original parcel and the owner of the parcel being subdivided has not previously subdivided an adjacent parcel using an urban lot split, as provided.\n\nThis bill would remove the requirement that one parcel of a split lot be no smaller than 40% of the lot area of the original parcel and would exempt both newly created lots from following certain additional requirements, as specified. The bill would also remove the prohibition against owners who have previously subdivided an adjacent parcel using an urban lot split.\n\nExisting law prohibits ministerial approval for a proposed urban lot split that would require the demolition or alteration of housing that, among other things, has been occupied by a tenant in the last three years.\n\nThe bill would exempt a lot split from restrictions on demolition if a structure on the development site that includes at least one housing unit was involuntarily damaged or destroyed by an earthquake, other catastrophic event, or the public enemy.\n\nExisting law authorizes a local agency, except as provided, to impose objective zoning standards, objective subdivision standards, and objective design review standards related to the design or improvements of a parcel subject to an urban lot split, including that the imposed standards may not have the effect of physically precluding a unit being constructed on either of the resulting parcels from being at least 800 square feet. Existing law allows a local agency to require specified conditions when considering an application for a parcel map for an urban lot split, including access requirements.\n\nThis bill would revise and recast those provisions to, among other things, prohibit a local agency from imposing standards that would have the effect of physically precluding an urban lot split from occurring or a unit being constructed on either of the resulting parcels from being at least 1,750 net habitable square feet. The bill would also revise and recast the restrictions on a local agency's authority to impose a setback, as provided. The bill would prohibit a local agency from imposing a driveway requirement width requirement, as provided.\n\nThis bill would specify that a local agency's access requirement may not physically preclude the lot split from occurring if another access method would facilitate the lot split.\n\nThe bill would require a local agency to provide applicants with a single application for an urban lot split that falls under these provisions and also includes a proposed housing development that falls under the provisions discussed above to review both applications concurrently.\n\nUnder existing law, a local agency must require an applicant for an urban lot split to sign an affidavit stating that the applicant intends to occupy one of the housing units as their principal residence, as specified.\n\nThis bill would remove the requirement that an applicant sign an affidavit stating that the applicant intends to occupy one of the housing units as their principal residence and prohibit a local agency from using or imposing any additional standards, except as specified.\n\nExisting law authorizes a local agency to adopt an ordinance to implement these provisions.\n\nThis bill would require a local agency that has adopted an ordinance to submit a copy of that ordinance to the Department of Housing and Community Development within 60 days after adoption, as specified. The bill would authorize the department to review the ordinance and submit written findings to the local agency as to whether the ordinance is in compliance with these provisions. Should the department conclude an ordinance is not in compliance, the bill would establish a process for the department to notify the local agency and the local agency to amend the ordinance or adopt the ordinance without changes, as provided.\n\nThe bill would require a local agency to ministerially review a condominium map that would subdivide a specified housing development, as provided. The bill would prohibit the imposition of an impact fee upon an urban lot split, as specified.\n\n(4) Existing law authorizes a local agency, by ordinance, to provide for the creation of accessory dwelling units (ADUs) in areas zoned for residential use and requires ministerial approval of ADUs, as specified.\n\nExisting law, the Davis-Stirling Common Interest Development Act, governs the management and operation of common interest developments. Existing law makes void and unenforceable any covenant, restriction, or condition contained in any deed, contract, security instrument, or other instrument affecting the transfer or sale of any interest in a planned development, and any provision of a governing document, that effectively prohibits or unreasonably restricts the construction or use of an accessory dwelling unit or junior accessory dwelling unit on a lot zoned for single-family residential use that meets the above-described requirements established for those units, except as provided.\n\nThis bill would, additionally, apply the above-described provisions to housing developments and urban lot splits receiving ministerial approval, as specified.\n\n(5) Existing law, the California Coastal Act of 1976, establishes the California Coastal Commission and prescribes the powers and responsibilities of the commission with regard to the regulation of development along the California coast.\n\n Existing law specifies that proposed housing developments and urban lot splits considered ministerially under the above-described provisions may be required to obtain a coastal development permit, but a local agency is not required to hold public hearings for coastal development permit applications, as provided.\n\nThis bill would express the intent of the Legislature to achieve the goal of increasing the supply of housing in the coastal zone while also protecting coastal resources and public coastal access, as provided.\n\n(6) The bill would define key terms and make nonsubstantive and conforming changes.\n\n(7) By increasing the duties of local agencies with respect to land use regulations, the bill would impose a state-mandated local program.\n\n(8) The bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\n(9) The California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2025-02-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 24.", "date": "2025-02-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Read first time.", "date": "2025-02-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Coms. on HOUSING and L. GOV.", "date": "2025-03-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Coms. on HOUSING and L. GOV.", "entity_type": "organization", "organization_id": null}]}, {"description": "From committee with author's amendments. Read second time and amended. Re-referred to Com. on HOUSING.", "date": "2025-04-01", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["amendment-passage", "committee-passage", "reading-1", "reading-2", "referral-committee"], "related_entities": [{"name": "Com. on HOUSING.", "entity_type": "organization", "organization_id": null}]}, {"description": "Set for hearing April 22.", "date": "2025-04-09", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "From committee with author's amendments. Read second time and amended. Re-referred to Com. on HOUSING.", "date": "2025-04-09", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["amendment-passage", "committee-passage", "reading-1", "reading-2", "referral-committee"], "related_entities": [{"name": "Com. on HOUSING.", "entity_type": "organization", "organization_id": null}]}, {"description": "Set for hearing April 30 in L. GOV. pending receipt.", "date": "2025-04-22", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "April 22 set for first hearing. Failed passage in committee. (Ayes 4. Noes 3. Page 832.) Reconsideration granted.", "date": "2025-04-23", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["committee-failure"], "related_entities": []}], "sponsorships": [{"name": "Wiener", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Wiener\"}", "organization_id": null}, {"name": "Wicks", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Wicks\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB677", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB677", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/21/25 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB677&version=20250SB67799INT", "media_type": "application/pdf"}], "date": "2025-02-21", "classification": ""}, {"note": "04/01/25 - Amended Senate", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB677&version=20250SB67798AMD", "media_type": "application/pdf"}], "date": "2025-04-01", "classification": ""}, {"note": "04/09/25 - Amended Senate", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB677&version=20250SB67797AMD", "media_type": "application/pdf"}], "date": "2025-04-09", "classification": ""}], "documents": [{"note": "04/17/25- Senate Housing", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202520260SB677&analysisId=383985&analyzingOffice=Senate+Housing", "media_type": "application/pdf"}], "date": "2025-04-17", "classification": "analysis"}], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB677", "note": ""}], "extras": {"impact_clause": "An act to amend Section 4751 of the Civil Code, and to amend Sections 65852.21, 65913.4, and 66411.7 of the Government Code, relating to land use.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2025-12-28T08:40:33+00:00", "_id": "dfd3396a-e3c8-11f0-b3e3-b244fe10b41b"}