{"legislative_session": "20252026", "identifier": "AB2633", "title": "Secondhand dealers.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Secondhanddealers"], "abstracts": [{"note": "summary", "abstract": "Existing law imposes upon secondhand dealers and coin dealers a uniform, statewide, state-administered program of regulation of persons whose principal business is buying, selling, trading, auctioning, or taking in pawn tangible personal property, as defined, and requires a secondhand dealer or coin dealer to report tangible personal property they acquired to the California Pawn and SecondhandDealer System (CAPSS) operated by the Department of Justice, as specified. Existing law makes a violation of these provisions a misdemeanor, as specified.\n\nThis bill would make the above-described provisions inapplicable to coin dealers and make other related and conforming changes. The bill would expand the definition of \"tangible personal property\" to include secondhand jewelry, items, or objects. By expanding the items subject to the reporting requirement, the violation of which is a crime, this bill would impose a state-mandated local program.\n\nExisting law makes it unlawful for any person to engage in the business of a secondhand dealer without being licensed and authorizes a district attorney or the Attorney General to bring an action to enjoin the violation, or the threatened violation, of any provisions regulating secondhand dealers.\n\nThis bill would also authorize a licensee to bring an action in superior court against a person engaging in the business of a secondhand dealer without a state license, as specified.\n\nExisting law requires the chief of police, sheriff, or police commission to accept an application for licensure and to grant a license to a qualified applicant, as specified. Existing law requires the licensing authority to submit the application to the Department of Justice before granting the license. If the Department of Justice does not comment on the application within 30 days after the submission, existing law authorizes the licensing authority to grant the applicant a license.\n\nThis bill would prohibit a city, county, city and county, or any other state agency from issuing a license or permit to allow any entity to conduct business as a secondhand dealer without the entity having a state secondhand dealer license issued pursuant to the provisions described above.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Gipson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Gipson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2633", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2633", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2633&version=20250AB263399INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2633", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 21626, 21627, 21628, 21630, 21631, 21636, 21636.1, 21636.5, 21637, 21638, and 21640 of, and to repeal Section 21634 of, the Business and Professions Code, relating to secondhand dealers.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:42+00:00", "_id": "2687a7c8-0fcb-11f1-9ce2-72e66fa16e68"}