{"legislative_session": "20252026", "identifier": "AB1594", "title": "California Citrus Commission: California Citrus Pest and Disease Prevention Committee.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill", "appropriation"], "subject": ["CaliforniaCitrusCommission", "CaliforniaCitrusPestandDiseasePreventionCommittee"], "abstracts": [{"note": "summary", "abstract": "Under existing law, the Legislature finds and declares that the agricultural and seafood industries are vitally important elements of the state's economy. Existing law provides for various commissions and councils to promote the marketing and production of agricultural or seafood commodities, including the California Navel Orange Commission.\n\nThis bill would repeal the provisions providing for the creation of the California Navel Orange Commission.\n\nThis bill would create the California Citrus Commission in the state government with a prescribed membership, and would specify the powers, duties, and responsibilities of the commission's board of directors. The bill would authorize the commission's board of directors to, among other things, conduct activities in furtherance of the California citrus industry, including education, promotion, and marketing, conduct any activities necessary to prevent the introduction of, and to eradicate, any and all citrus pests and diseases, and recommend to the Secretary of Food and Agriculture citrus grades, quality, and labeling standards. The bill would authorize the commission to levy an annual assessment on producers, as defined, and would authorize the commission to expend revenues from those assessments and all other moneys received by the commission, including from penalties for failing to pay the assessment and the civil penalties described below, for purposes of implementing the bill, thereby making an appropriation.\n\nThe bill would provide that the commission would not be established, and these provisions would not be implemented, except as necessary to conduct an election, until the producers of citrus vote in favor of establishing the commission, as prescribed. The bill would also provide for the suspension of the operation of the commission and for concluding the operation of the commission under certain circumstances. The bill would authorize the commission to levy a civil penalty, as specified, on a person for willfully rendering or furnishing false reports, secreting, destroying, or altering records, or failing or refusing to furnish to the commission information concerning the name and address of persons from whom citrus is received and the quantity received. The bill would authorize the commission to bring certain civil actions to enforce the bill's provisions.\n\nExisting law creates the California Citrus Pest and Disease Prevention Committee in the Department of Food and Agriculture to, among other things, develop a statewide citrus specific pest and disease work plan. Existing law provides for a monthly assessment to be paid by producers, as defined, which are deposited into the Citrus Disease Management Account in the Department of Food and Agriculture Fund. Moneys in the Citrus Disease Management Account are available upon appropriation by the Legislature for specified activities relating to citrus disease prevention.\n\nThis bill would suspend the requirement to pay the monthly assessment if the commission is established, as specified. The bill would also authorize the commission board of directors, if it is established, and contingent upon concurrence by the secretary, to assume the powers and duties of the committee pursuant to an agreement with that committee.\n\nExisting constitutional provisions require that a statute that limits the right of access to the meetings of public bodies or the writings of public officials and agencies be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\nThis bill would make legislative findings to that effect."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-16", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 16.", "date": "2026-01-17", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Referred to Com. on AGRI.", "date": "2026-02-02", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on AGRI.", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Harabedian", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Harabedian\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1594", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1594", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/16/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1594&version=20250AB159499INT", "media_type": "application/pdf"}], "date": "2026-01-16", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1594", "note": ""}], "extras": {"impact_clause": "An act to amend Section 5919 of, and to repeal and add Chapter 11 (commencing with Section 73001) of Part 2 of Division 22 of, the Food and Agricultural Code, and to amend Section 7930.120 of the Government Code, relating to citrus, and making an appropriation therefor.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-12T09:00:55+00:00", "_id": "56f7fc78-07f1-11f1-8856-36e757393db5"}