{"legislative_session": "20252026", "identifier": "SB1326", "title": "California Environmental Quality Act: tribal cultural resources: mitigation measures.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["CaliforniaEnvironmentalQualityAct", "mitigationmeasures", "tribalculturalresources"], "abstracts": [{"note": "summary", "abstract": "The California Environmental Quality Act (CEQA) requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of, an environmental impact report (EIR) on a project that it proposes to carry out or approve that may have a significant effect on the environment or to adopt a negative declaration if it finds that the project will not have that effect. CEQA also requires a lead agency to prepare a mitigated negative declaration for a project that may have a significant effect on the environment if revisions in the project would avoid or mitigate that effect and there is no substantial evidence that the project, as revised, would have a significant effect on the environment.\n\nCEQA requires a lead agency, before releasing an environmental review document for a project, to begin consultation with a California Native American tribe that is traditionally and culturally affiliated with the geographic area of the proposed project, as provided. CEQA authorizes the parties, as a part of the consultation, to propose mitigation measures capable of avoiding or substantially lessening potential significant impacts to a tribal cultural resource or alternatives that would avoid significant impacts to a tribal cultural resource. CEQA defines a tribal cultural resource as including, among other things, a site, feature, place, cultural landscape, sacred place, or object with cultural value to a California Native American tribe that is included or determined to be eligible for inclusion in the California Register of Historical Resources or included in a local register of historical resources, as provided.\n\nThis bill would modify the definition of tribal cultural resource to, among other things, include a site, feature, place, cultural landscape, sacred place, or object with cultural value to a California Native American tribe that is identified by the Native American Heritage Commission as a sacred place, as provided, or included in a local tribal register.\n\nCEQA requires public agencies, when feasible, to avoid damaging effects to tribal cultural resources and specifies mitigation measures that may be considered to avoid or minimize significant adverse impacts to tribal cultural resources if the consultation process fails to result in agreed-upon mitigation measures.\n\nThis bill would revise and recast those provisions to instead require a public agency to adopt mitigation measures to avoid or minimize the significant adverse impacts to tribal cultural resources. The bill would require avoidance and preservation of the resource in place to be considered when requested by the consulting California Native American tribe, and if avoidance and preservation are determined to not be feasible, the bill would require the lead agency to demonstrate and document the basis for that determination with substantial evidence and to incorporate other measures to avoid or minimize significant adverse impacts to the resource consistent with CEQA. The bill would authorize the consulting California Native American tribe to identify culturally appropriate mitigation measures, which the bill would require the lead agency to consider and incorporate, to the extent feasible, in developing mitigation and treatment measures.\n\n This bill would also require the lead agency, if it elects not to use tribal methods and standards or tribal traditional knowledge in the identification of, and the adoption of avoidance, mitigation, and treatment measures for, tribal cultural resources, to explain its decision, supported by substantial evidence, in the environmental documents for the project.\n\n By imposing additional duties on local agencies in their implementation of CEQA, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Wahab", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Wahab\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1326", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1326", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1326&version=20250SB132699INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1326", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 21074 and 21084.3 of the Public Resources Code, relating to environmental quality.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:05+00:00", "_id": "eca280aa-0fca-11f1-9ce2-72e66fa16e68"}