{"legislative_session": "20252026", "identifier": "SB73", "title": "California Environmental Quality Act: exemptions.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["CaliforniaEnvironmentalQualityAct", "exemptions"], "abstracts": [{"note": "summary", "abstract": "(1) The California Environmental Quality Act (CEQA) requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of an environmental impact report (EIR) on a project that it proposes to carry out or approve that may have a significant effect on the environment or to adopt a negative declaration if it finds that the project will not have that effect. CEQA also requires a lead agency to prepare a mitigated negative declaration for a project that may have a significant effect on the environment if revisions in the project would avoid or mitigate that effect and there is no substantial evidence that the project, as revised, would have a significant effect on the environment.\n\nCEQA exempts from its requirements certain residential, employment center, and mixed-use development projects meeting specified criteria, including that the project is located in a transit priority area and that the project is undertaken and is consistent with a specific plan for which an environmental impact report has been certified.\n\nThis bill would additionally exempt those projects located in a very low vehicle travel area, as defined. The bill would require that the project is undertaken and is consistent with either a specific plan prepared pursuant to specific provisions of law or a community plan, as defined, for which an EIR has been certified within the preceding 15 years in order to be exempt. The bill would additionally require the project site to have been previously developed or to be a vacant site meeting certain requirements. Because a lead agency would be required to determine the applicability of this exemption, this bill would impose a state-mandated local program.\n\n(2) CEQA exempts from its requirements agricultural employee housing projects, affordable housing projects, and housing projects on infill sites that meet certain requirements, including, among others, the site is not located within the boundaries of a state conservancy. CEQA prohibits those exempt projects from being located in certain areas.\n\nThis bill would allow the location of agricultural employee housing projects, affordable housing projects, and housing projects on infill sites to be located within the boundaries of a state conservancy in order to be exempt. The bill would revise and recast the areas in which those exempt projects cannot be located, as provided.\n\n(3) CEQA exempts from its requirements residential projects on infill sites that meet certain requirements, including, among others, that the location of the residential project on an infill site is no more than 4 acres and that the project is located within 12 mile of a major transit stop.\n\nThis bill instead would require that the location of a residential project on an infill site be no more than 5 acres. The bill would additionally exempt those residential projects located in a very low vehicle travel area, as defined.\n\n(4) CEQA exempts from its requirements a transit priority project meeting certain requirements and that is declared by a legislative body to be a sustainable communities project. CEQA prohibits a transit priority project declared to be a sustainable communities project from being located in certain areas and requires the project to be within 12 mile of a rail transit station or a ferry terminal included in a regional transportation plan or within 14 mile of a high-quality transit corridor included in a regional transportation plan.\n\nThis bill would revise and recast the areas in which the transit priority project declared to be a sustainable communities project cannot be located, as provided. The bill would additionally authorize the transit priority project declared to be a sustainable community project if the project is located within a very low vehicle travel area, as defined. The bill would additionally require the site for the transit priority project to have been previously developed or to be a vacant lot meeting certain requirements.\n\n(5) This bill would require a lead agency approving a project that is exempt from CEQA under the provisions described in paragraphs (1) , (3) , and (4) above to file with the Office of Land Use and Climate Innovation a notice of exemption. By imposing additional duties on the lead agency, this bill would impose a state-mandated local program.\n\n(6) The California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2025-01-15", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after February 15.", "date": "2025-01-16", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Referred to Coms. on E.Q. and HOUSING.", "date": "2025-01-29", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Coms. on E.Q. and HOUSING.", "entity_type": "organization", "organization_id": null}]}, {"description": "Set for hearing March 5.", "date": "2025-02-25", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "March 5 set for first hearing canceled at the request of author.", "date": "2025-02-26", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Set for hearing March 19.", "date": "2025-03-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "March 19 set for second hearing canceled at the request of author.", "date": "2025-03-13", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Cervantes", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Cervantes\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB73", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB73", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/15/25 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB73&version=20250SB7399INT", "media_type": "application/pdf"}], "date": "2025-01-15", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB73", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 21155.1, 21155.4, 21159.21, and 21159.24 of, and to add Sections 21060.2.5 and 21075 to, the Public Resources Code, relating to environmental quality.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2025-12-03T15:15:00+00:00", "_id": "d5d3ae4e-d05a-11f0-bf47-a2666b876d6e"}