{"legislative_session": "20252026", "identifier": "SB1288", "title": "Property: nonprobate transfer of ownership.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Property", "nonprobatetransferofownership"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Uniform TOD Security Registration Act, provides for the transfer of ownership or proceeds of a security, as defined, by a registering entity to the designated beneficiary or beneficiaries upon the death of the owner without probate or estate administration, as specified.\n\nThis bill would require a registering entity that receives proof of the death of an owner of a security designated for non-probate transfer held by that registering entity to provide notice to a beneficiary, as specified. The bill would restrict the amount and type of information that a registering entity can require from such a beneficiary prior to establishing its identity, as specified. The bill would also prohibit a registering entity from requiring a beneficiary to open an account with the registering entity to receive the security and from requiring multiple beneficiaries to coordinate to receive their share of the security, as specified. The bill would also specify that a nonprofit corporation, a charitable trust, or an entity exempt from federal taxation may be beneficiaries under the Act and limits the amount of information such entities are required to provide the registering entity in order to receive the property in which they have an interest.\n\nExisting law, the Unclaimed Property Law (UPL) , prescribes the circumstances under which intangible property escheats to the state. Existing law sets forth procedures whereby a person may file a claim to the escheated property.\n\nThis bill would specify that nonprofit corporations, charitable trusts, and nonprofit entities that are exempt from federal taxation may be claimants under the UPL and specify which documents are required to establish the identity of such entities. The bill would permit such entities to file claims for property bequeathed to them through a non-probate transfer and would specify the documents that an entity may be required to provide to establish its ownership of the property at issue. The bill would require the Controller to revise its forms and systems to permit the filing of such claims and to adopt implementing regulations."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Laird", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Laird\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1288", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1288", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1288&version=20250SB128899INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1288", "note": ""}], "extras": {"impact_clause": "An act to add Section 1513.6 to the Code of Civil Procedure, and to amend Section 5507 of, and to add Section 5510.5 to, the Probate Code, relating to property.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:43:58+00:00", "_id": "76b71d02-0f01-11f1-bd68-62084ebb1ff2"}