{"legislative_session": "20252026", "identifier": "AB2499", "title": "Corrections: prison conditions.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Corrections", "prisonconditions"], "abstracts": [{"note": "summary", "abstract": "Under existing law, the California Occupational Safety and Health Act of 1973, the Division of Occupational Safety and Health investigates complaints that a workplace is not safe and may issue orders necessary to ensure employee safety. Under existing law, certain violations of those provisions or a standard, order, or special order authorized by those provisions are a crime.\n\nExisting law establishes the Department of Corrections and Rehabilitation and sets forth its powers and duties regarding the administration of correctional facilities and the care and custody of inmates. Existing law establishes the Office of Emergency Services within the office of the Governor. Existing law requires the Office of Emergency Services to be responsible for the state's emergency and disaster response services for natural, technological, or manmade disasters and emergencies.\n\nThis bill would require the division, by July 1, 2027, to submit a rulemaking proposal for the Occupational Safety and Health Standards Board's review and adoption, specifically applicable to workers in any prison or institution under the jurisdiction of the Department of Corrections and Rehabilitation, as specified.\n\nThis bill would require the department to comply with these provisions and any order, rule, or regulation adopted by the Occupational Safety and Health Standards Board pursuant to them. Because this bill would expand the definition of an existing crime, this bill would impose a state-mandated local program.\n\nThis bill would also adopt the Climate Justice in Prisons Emergency Response Act, which would require the department to take various actions at specified times, relating to climate control and working conditions in prisons, including, among other things, establishing and implementing minimum interim relief measures during excessive weather events and establishing a working group consisting of representatives from various entities, including community-based organizations and an incarcerated person advisory council. The bill would require the department, subject to an appropriation by the Legislature, to implement a plan to ensure that living quarters, work areas, and recreational spaces at correctional facilities are equipped with specified cooling systems and to install shade structures at facilities that have the greatest exposure to excessive heat. The bill would require the department, by July 1, 2027, to establish a Temperature Monitoring and Data Transparency Pilot Program in at least 3 prisons that represent distinct climate zones. Under the program, the bill would require the department to collect certain temperature data and provide weekly and quarterly summary data, from digital sensors installed at the prisons, to the Office of the Inspector General, the Division of Occupational Safety and Health, and the appropriate policy and budget committees of the Legislature, as specified. The bill would require the department to establish a monitoring system that includes data collection and reporting mechanisms in order to carry out the provisions of the act.\n\nThis bill would make related findings and declarations.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Gipson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Gipson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2499", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2499", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2499&version=20250AB249999INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2499", "note": ""}], "extras": {"impact_clause": "An act to add Section 6720.1 to the Labor Code, and to add Chapter 19 (commencing with Section 7470) to Title 7 of Part 3 of the Penal Code, relating to corrections.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:39+00:00", "_id": "247be0f2-0fcb-11f1-9ce2-72e66fa16e68"}