{"legislative_session": "20252026", "identifier": "AB1577", "title": "Data centers: monthly reporting.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Datacenters", "monthlyreporting"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the State Energy Resources Conservation and Development Commission (Energy Commission) and vests the commission with various responsibilities with respect to developing and implementing the state's energy policies. Existing law requires the commission to biennially adopt an integrated energy policy report, as specified, and to make the reports accessible to state, local, and federal entities and to the general public.\n\nThis bill would require the commission to establish a process for the owner of a data center, as defined, to submit specified information to the commission on a monthly basis, including, among other information, the data center's power usage effectiveness, as defined, water usage effectiveness, as defined, and total water consumption and the quantity of fuel consumed by onsite generators or other fuel-based energy systems, as specified. The bill would require the owner of a data center to submit the required information in the manner and timeframe specified by the commission. The bill would require the commission, as part of the 2029 edition of the integrated energy policy report, to include an assessment of electrical load trends for data centers, as provided. The bill would require the commission to annually publish the information submitted in an anonymized and aggregated format on its internet website.\n\nThe bill would require the owner or developer of a data center, upon applying for a discretionary permit, entitlement, or land use authorization required for the construction or operation of the data center, to submit to the applicable local agency, as defined, the information described above, as provided. By imposing a new duty on local agencies, the bill would impose a state-mandated local program. The bill would authorize the local agency to use this information for various purposes, including, but not limited to, land use planning, infrastructure planning, energy and water supply assessment, and environmental review. The bill would further authorize a lead local agency to use this information in the preparation of environmental documentation pursuant to the California Environmental Quality Act.\n\nThe bill would prohibit the commission or a local agency from disclosing information submitted on a monthly basis or upon applying for a discretionary permit, entitlement, or land use authorization, as described above, in a manner that would result in the disclosure of personally identifiable information or energy consumption data for a specific utility customer.\n\nExisting constitutional provisions require that a statute that limits the right of access to the meetings of public bodies or the writings of public officials and agencies be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\nThis bill would make legislative findings to that effect.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 12.", "date": "2026-01-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Bauer-Kahan", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bauer-Kahan\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1577", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1577", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1577&version=20250AB157799INT", "media_type": "application/pdf"}], "date": "2026-01-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1577", "note": ""}], "extras": {"impact_clause": "An act to add Section 25302.10 to the Public Resources Code, relating to energy.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-18T09:02:49+00:00", "_id": "994ef390-0ca8-11f1-b63b-c6889cfda9fe"}