{"legislative_session": "20252026", "identifier": "AB2575", "title": "Health care services: artificial intelligence.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Healthcareservices", "artificialintelligence"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law provides for the licensure and regulation of health facilities and clinics by the State Department of Public Health. Existing law generally makes a violation of these provisions a crime. Existing law, the Medical Practice Act, establishes the Medical Board of California for the licensing, regulation, and discipline of physicians and surgeons. Existing law requires a health facility, clinic, physician's office, or office of a group practice that uses generative artificial intelligence to generate written or verbal patient communications pertaining to patient clinical information, as defined, to ensure that those communications include both a disclaimer that indicates to the patient that a communication was generated by generative artificial intelligence, as specified, and clear instructions describing how a patient may contact a human health care provider, employee, or other appropriate person. \n\nThis bill would require a health facility, clinic, physician's office, or office of a group practice that uses or deploys a covered tool, as defined, for patient care to disclose required information to any licensed health care professional or other person using a covered tool or viewing outputs from a covered tool. The bill would require, among other things, the disclosure to include a notice that a worker providing direct patient care is permitted to override the output of a covered tool if, in the judgment of the worker acting in their scope of practice, an override is appropriate for the patient, or as necessary to comply with applicable law, including civil rights law. The bill would specify the required time and manner the disclosure is to be provided pursuant to these provisions. By placing new requirements on health facilities and clinics, this bill would expand the scope of a crime and would impose a state-mandated local program.\n\n(2) Existing law charges the Labor Commissioner with enforcement of various labor laws, including investigation of employee complaints.\n\nThis bill would declare it is the policy of the state that a worker providing direct patient care be free to use their professional judgment to make assessments and decisions within their scope of practice as appropriate for their patients and that it is public policy of the state that a worker should not be penalized for relying in good faith on technology that the licensed health care professional's employer has selected or approved for their use in patient care. The bill would prohibit an employer from using or deploying technology to replace or eliminate a worker's use of professional judgment in patient care and would prohibit an employer from retaliating or discriminating against a worker providing patient care, as specified. The bill would authorize a worker who is subject to retaliation or discrimination in violation of these provisions to file a complaint with the Labor Commissioner against an employer. \n\n(3) Existing law provides that everyone is responsible not only for the result of their willful acts, but also for an injury occasioned to another by their want of ordinary care or skill in the management of their property or person. Existing law prohibits a defendant who developed, modified, or used artificial intelligence, as defined, from asserting a defense that the artificial intelligence autonomously caused the harm to the plaintiff.\n\nThis bill would prohibit a defendant who developed, modified, or used artificial intelligence, as defined, that is alleged to have harmed the plaintiff from asserting a defense that the failure of a licensed health care professional or other health care worker to override an output of the artificial intelligence or clinical decision support system is a superseding cause severing the defendant's liability for the alleged harm. \n\n(4) The California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Ortega", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ortega\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2575", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2575", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2575&version=20250AB257599INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2575", "note": ""}], "extras": {"impact_clause": "An act to add Section 1714.48 to the Civil Code, to add Section 1339.76 to the Health and Safety Code, and to add Article 2.7 (commencing with Section 2820) to Chapter 2 of Division 3 of the Labor Code, relating to health care services.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:21+00:00", "_id": "a8669922-0f01-11f1-bd68-62084ebb1ff2"}