{"legislative_session": "20252026", "identifier": "AB2612", "title": "Building standards: qualified plug-in photovoltaic systems.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Buildingstandards", "qualifiedplug-inphotovoltaicsystems"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Department of Housing and Community Development in the Business, Consumer Services, and Housing Agency. Existing law, the California Building Standards Law, establishes the California Building Standards Commission. Existing law requires the commission to approve and adopt building standards and to codify those standards in the California Building Standards Code. Existing law, the State Housing Law, establishes statewide construction and occupancy standards for buildings used for human habitation.\n\nExisting law, until January 1, 2033, requires the commission and the department, commencing with the next triennial edition of the code adopted after January 1, 2023, to research and develop, and authorizes the commission and the department to propose for adoption by the commission, mandatory building standards for the installation of electric vehicle charging stations in existing multifamily dwellings, hotels, motels, and nonresidential developments, as specified.\n\nThis bill would require the commission, commencing with the next triennial edition of the code, to adopt, approve, codify, and publish mandatory standards for building electrical circuit features to enable qualified plug-in photovoltaic systems to function as an energy source within a residential dwelling's or nonresidential development's electrical circuit, as specified. The bill would, for purposes of that requirement, require the department to research, develop, and propose for adoption mandatory building standards for a qualified plug-in photovoltaic system to function as an energy source within a multiunit dwelling's electrical circuit. The bill would require the commission and the department, in satisfying those requirements, to, among other things, consult with certain interested parties and invite the participation of the public at large in the development of those building standards through open consensus-based processes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Schultz", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Schultz\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2612", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2612", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2612&version=20250AB261299INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2612", "note": ""}], "extras": {"impact_clause": "An act to add Section 18944.23 to the Health and Safety Code, relating to building standards.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:41+00:00", "_id": "2639d106-0fcb-11f1-9ce2-72e66fa16e68"}