{"legislative_session": "20252026", "identifier": "AB2595", "title": "Vehicles: electric bicycles.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Vehicles", "electricbicycles"], "abstracts": [{"note": "summary", "abstract": "Existing law defines an electric bicycle and classifies electric bicycles into 3 classes with different restrictions. Under existing law, a \"class 1 electric bicycle\" is a bicycle equipped with a motor that provides assistance only when the rider is pedaling and ceases to provide assistance when the bicycle reaches the speed of 20 miles per hour. Under existing law, a \"class 2 electric bicycle\" is a bicycle equipped with a motor that may be used exclusively to propel the bicycle and is not capable of providing assistance when the bicycle reaches the speed of 20 miles per hour. Under existing law, a \"class 3 electric bicycle\" is a bicycle equipped with a speedometer and a motor that provides assistance only when the rider is pedaling, and that ceases to provide assistance when the bicycle reaches the speed of 28 miles per hour. Existing law prohibits a person under 16 years of age from operating a class 3 electric bicycle.\n\nThis bill, the San Mateo Electric Bicycle Safety Pilot Program, would, until January 1, 2031, authorize a local authority within the County of San Mateo, or the County of San Mateo in unincorporated areas, to adopt an ordinance or resolution that would prohibit a person under 12 years of age from operating a class 1 or 2 electric bicycle. For the first 60 days following the adoption of an ordinance or resolution for this purpose, the bill would make a violation of the ordinance or resolution punishable by a warning notice. After 60 days, the bill would make a violation of the ordinance or resolution punishable by a fine of $25, except as specified. This bill would make a parent or legal guardian with control or custody of an unemancipated minor who violates the ordinance or resolution jointly and severally liable with the minor for the amount of the fine imposed. The bill would, if an ordinance or resolution is adopted, require the county to, by January 1, 2030, submit a report to the Legislature that includes, among other things, the total number of traffic stops initiated for a violation of the ordinance or resolution, the results of those traffic stops, and the actions taken by a peace officer during a traffic stop, as specified. The bill would require a local authority or county to administer a public information campaign for at least 30 calendar days prior to the enactment of the ordinance or resolution, as specified."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Papan", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Papan\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2595", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2595", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2595&version=20250AB259599INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2595", "note": ""}], "extras": {"impact_clause": "An act to add and repeal Section 21214.9 of the Vehicle Code, relating to vehicles.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:22+00:00", "_id": "a8a27b18-0f01-11f1-bd68-62084ebb1ff2"}