{"legislative_session": "20252026", "identifier": "AB2413", "title": "Large-format public advertisements: public expense.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Large-formatpublicadvertisements", "publicexpense"], "abstracts": [{"note": "summary", "abstract": "The Political Reform Act of 1974 provides for the comprehensive regulation of campaign financing and activities. The act defines \"mass mailing\" to mean over 200 substantially similar pieces of mail, and defines \"mass electronic mailing\" to mean sending more than 200 substantially similar pieces of electronic mail within a calendar month. The act prohibits a mass mailing from being sent at public expense if, among other things, the mailing features an elected officer affiliated with the agency that produces or sends the mailing, or includes the name, office, photograph, or other reference to the elected officer and is prepared or sent in cooperation, consultation, coordination, or concert with the elected officer.\n\nThis bill would define \"large-format public advertisement\" as a billboard, wrap on a bus or other public transportation vehicle, advertisement affixed to a bus stop, and other public advertisements designated by the commission by regulation that are larger than those designed to be individually distributed. This bill would prohibit a large-format public advertisement from being published or displayed at public expense if, among other things, the advertisement includes the photograph of an elected officer affiliated with the agency that produces or purchases the large-format public advertisement and is prepared in cooperation, consultation, coordination, or concert with the elected officer.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason.\n\nThe Political Reform Act of 1974, an initiative measure, provides that the Legislature may amend the act to further the act's purposes upon a 23 vote of each house of the Legislature and compliance with specified procedural requirements.\n\nThis bill would declare that it furthers the purposes of the act."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Ransom", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ransom\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2413", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2413", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2413&version=20250AB241399INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2413", "note": ""}], "extras": {"impact_clause": "An act to amend Section 89001 of, and to add Sections 82035.8 and 89002.1 to, the Government Code, relating to the Political Reform Act of 1974.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:36+00:00", "_id": "233a5020-0fcb-11f1-9ce2-72e66fa16e68"}