{"legislative_session": "20252026", "identifier": "SB876", "title": "Fire and residential property insurance.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Fireandresidentialpropertyinsurance"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law generally regulates classes of insurance, including fire and residential property insurance.\n\nExisting law specifies the measure of indemnity under an open fire insurance policy that requires payment of actual cash value or replacement cost. Under existing law, the measure of the actual cash value recovery is the amount it would cost the insured to repair, rebuild, or replace the thing lost or injured less a fair and reasonable deduction for physical depreciation based upon its condition at the time of the injury or the policy limit, whichever is less. If an open policy requires the insured to repair, rebuild, or replace the damaged property to collect the full replacement cost, under existing law the insurer is required to pay the actual cash value of the damaged property until the damaged property is repaired, rebuilt, or replaced, at which time the insurer is required to pay the difference between the actual cash value payment made and the full replacement cost reasonably paid to replace the damaged property.\n\nIf there is a total loss to the insured structure, this bill would require an insurer to pay the actual cash value associated with the primary structure and other insured structures within 30 calendar days from the date of loss. After this payment is made, the bill would require an insurer to pay the undisputed amount of replacement cost associated with the primary structure and other insured structures, up to the limits in the policy, within 30 calendar days from the occurrence of a specified event. The bill would require interest to accrue if these payments are not made within 30 calendar days.\n\n(2) Existing law prohibits a policy from limiting or denying a payment of building code upgrade cost on the basis that the insured has decided to rebuild at a new location or to purchase an already built home at a new location.\n\nIf there is a total loss of the insured structure, this bill would require the building code upgrade cost payable to include all costs that would have been incurred if the insured structure been completely rebuilt at its original location. The bill would also require building code upgrade coverage to be provided at no less than 20% of the policy limits if there is a covered loss relating to a state of emergency.\n\n(3) Existing law requires a disclosure to be provided upon an offer of a residential property insurance policy that states policies offering extended replacement cost coverage of at least 50% may be available for that property and that includes the internet website address of the Homeowners Coverage Comparison Tool. Existing law exempts specified insurers, agents, and brokers from this requirement.\n\nThis bill would instead prohibit a residential property insurance policy from being issued or renewed unless the applicant or insured is offered extended replacement cost coverage in an amount of no less than 50% of coverage above the policy limits for the primary dwelling and other structures. If an applicant or policyholder declines this offer, the bill would require them to sign an acknowledgment of the offer. The bill would also prohibit issuing or renewing a residential property insurance policy unless the applicant or policyholder is offered guaranteed replacement cost coverage for the primary dwelling and other structures. If there is a covered loss relating to a state of emergency, the bill would increase the residential property insurance policy limits for the primary dwelling and other structures coverages increased by an amount equal to 50% of the policy limits for each of these coverages, which would be in addition to extended replacement cost coverage.\n\n(4) Existing law requires an insurer that provides replacement cost coverage to provide a cost estimate for rebuilding or replacing the structure at specified intervals, but exempts an insurer that meets specified criteria from this requirement.\n\nThis bill would delete those exemptions and would extend the cost estimate requirements to a policy offered by the California FAIR Plan Association if replacement cost coverage is available under the policy. The bill would make an insurer that fails to comply with the cost estimate requirements liable for up to the full replacement cost of the insured property after a loss.\n\n(5) Existing law requires an insurer to provide an insured with a list of items that the insurer believes may be covered under the policy as additional living expenses if there is a loss under a homeowners' insurance policy for which the insured has made a claim for additional living expenses. If there is a covered loss relating to a state of emergency, existing law requires additional living expense coverage to be for a period of no less than 24 months from the inception of the loss.\n\nThis bill would require the above-described list to be written, and would authorize the list to be transmitted as an electronic document. The bill would require additional living expense coverage to include all reasonable additional expenses incurred by the insured for the insured to maintain a comparable standard of living for the time the insured dwelling is not habitable due to a covered loss, as specified. The bill would authorize an insured to choose to collect the monthly fair rental value of the dwelling in lieu of reimbursement for itemized expenses under additional living expense coverage, as specified. If there is a covered total loss relating to a state of emergency, the bill would require policy limits for additional living expenses to be increased by an amount equal to 100 percent of the policy limits for this coverage and would extend additional living expenses 15 calendar days beyond the date upon which the premises is deemed habitable.\n\n(6) Existing law authorizes an insured under a residential property insurance policy to combine payments for claims for losses up to the policy limits for the primary dwelling and other structures if there is a covered loss relating to a state of emergency. If there is a covered total loss of a primary dwelling resulting from a state of emergency and the residence was furnished, existing law requires the insurer to offer a payment under the contents coverage of no less than 60% of the policy limit applicable to covered personal property, up to a maximum of $350,000, but authorizes the insured to recover additional amounts up to the policy limit by filing a claim, as specified.\n\nThis bill would authorize an insured under a residential property insurance policy to also combine payments for contents losses with the primary dwelling and other structures if there is a covered loss relating to a state of emergency. The bill would require an insurer to provide a payment of 100% of the policy limit applicable to covered personal property if there is a covered total loss of a primary dwelling resulting from a state of emergency and the residence was furnished. The bill would require that payment to be made within 30 calendar days from the date the insured property is determined to be a total loss and would require interest to accrue if the payment is not made within 30 calendar days.\n\n(7) Existing law requires a residential property insurer to provide a written status report to the insured if the insurer assigns a 3rd or subsequent first-party claims adjuster within a 6-month period for a claim arising as a result of a state of emergency. Existing law prescribes the standard form for fire insurance policies covering property and requires the form to include specified statements regarding this status report. Under existing law, it is a misdemeanor to issue or countersign a fire policy that varies from the standard form fire insurance policy.\n\nThis bill would require an insurer to assign a primary claims adjuster to be primarily responsible for a claim that involves one or more coverages under a policy of residential property insurance and is for a loss relating to a state of emergency, and would require an insurer to provide a written report within 5 business days of the assignment of a subsequent adjuster. The bill would make conforming changes to the standard form for fire insurance, thus expanding the scope of an existing crime and imposing a state-mandated local program.\n\n(8) Existing law prescribes the standard form of the California Residential Insurance Disclosure, which sets forth a description of certain types of insurance coverage. Existing law requires a residential property insurance policy to include specified information about coverage on its declarations page. Existing law requires the disclosure and declarations page to explain that building code upgrade coverage covers additional costs to comply with building codes and zoning laws in effect at the time of loss or rebuilding.\n\nThis bill would instead require the above-described disclosure and declarations page to explain that building code upgrade coverage covers additional costs to comply with building codes and zoning laws in effect at the time of rebuilding and required for rebuilding.\n\n(9) Existing law creates the Department of Insurance, headed by the Insurance Commissioner, and prescribes the commissioner's powers and duties. Existing law requires an admitted insurer to submit various reports and documents to the commissioner or department upon request or at specified intervals and authorizes the commissioner to conduct an examination of an insurer at the commissioner's discretion.\n\nThis bill would require a residential property insurer to submit a detailed disaster response plan to the department before April 1, 2027, and would require the plan to be updated every 2 years or upon the commissioner's request. The bill would also require a residential property insurer to report to the commissioner the losses, claims, and estimate of total incurred losses no later than 15 calendar days from the date a state of emergency was declared if there is a related covered loss.\n\n(10) Existing law defines certain actions as unfair methods of competition and unfair and deceptive acts or practices in the business of insurance. Under existing law, a person who engages in an unfair method of competition or an unfair or deceptive act or practice is liable to the state for a civil penalty to be fixed by the commissioner, not to exceed $5,000 for each act, or, if the act or practice was willful, a civil penalty not to exceed $10,000 for each act. Existing law authorizes the commissioner to order a respondent to provide restitution for a loss arising from the respondent's conduct, but exempts specified surplus line brokers, production agencies, and administrators from those restitution orders.\n\nThis bill would additionally make a person who engages in an unfair method of competition or an unfair or deceptive act or practice relating to a state of emergency liable to the state for a civil penalty to be fixed by the commissioner, not to exceed $10,000 for each act, or, if the act or practice was willful, a civil penalty not to exceed $20,000 for each act. The bill would authorize the commissioner to order a person who engages in an unfair method of competition or an unfair or deceptive act or practice to provide restitution, as specified. The bill would eliminate the restitution order exemption for surplus line brokers, production agencies, and administrators.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-01-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after February 6.", "date": "2026-01-07", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Padilla", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Padilla\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB876", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB876", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/06/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB876&version=20250SB87699INT", "media_type": "application/pdf"}], "date": "2026-01-06", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB876", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 790.035, 2051, 2051.5, 2060, 2071, 10102, 10103, 10103.4, 10103.7, 12928.7, and 14047 of, to add Section 10103.8 to, and to repeal and add Section 10103.2 of, the Insurance Code, relating to insurance.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-06T08:59:28+00:00", "_id": "24c7be2a-033a-11f1-b778-e65367eb5c0f"}