{"legislative_session": "20252026", "identifier": "SB1279", "title": "City of Long Beach Pacific Coast Highway speed safety system pilot program.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["CityofLongBeachPacificCoastHighwayspeedsafetysystempilotprogram"], "abstracts": [{"note": "summary", "abstract": "Existing law authorizes, until January 1, 2032, the City of Long Beach (city) , among others, to establish a program for speed enforcement that utilizes a speed safety system if the system meets specified requirements. Existing law requires the city to adopt a Speed Safety System Use Policy that sets forth, among other things, the specific purpose for the system. Existing law requires the city to adopt a Speed Safety System Impact Report that, among other things, includes the locations where the systems may be deployed. Existing law requires the policy and report to be made available for public review, as specified.\n\n Existing law also requires the city to develop uniform guidelines for, among other things, the processing and storage of confidential information, and designates all photographic or administrative records made by a system as confidential, except as specified. Existing law prohibits a speed safety system in the city from being operated on any California state route, including all freeways and expressways, United States highways, interstate highways, or any public road in unincorporated areas of any county where the Commissioner of the California Highway Patrol has full responsibility and primary jurisdiction for the administration and enforcement of the laws, and for the investigation of traffic accidents.\n\nThis bill would authorize, until January 1, 2036, the City of Long Beach to establish a similar program for speed enforcement that utilizes up to 6 speed safety systems on the Pacific Coast Highway. The bill would require the city to adhere to the Speed Safety System Use Policy mentioned above, and would require the city to approve an addendum to its existing Speed Safety System Impact Report before implementing the program. The bill would require the policy and the addendum to be made available for public review, as specified.\n\nExisting law requires a violation of a speed law recorded by a speed safety system to be subject only to civil penalties, as specified. Existing law requires, among other things, the issuance of a notice of violation, an initial review, an administrative hearing, and an appeals process, as specified, for a violation under the speed safety pilot program.\n\nThis bill would require the city to also implement similar provisions.\n\nExisting law establishes a $25 filing fee for specified appeals and petitions.\n\nThis bill would require a $25 filing fee for an appeal challenging a notice of violation issued as a result of the city's speed safety program until January 1, 2036.\n\nExisting constitutional provisions require that a statute that limits the right of access to the meetings of public bodies or the writings of public officials and agencies be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\nThis bill would make legislative findings to that effect.\n\nThis bill would make legislative findings and declarations as to the necessity of a special statute for the City of Long Beach."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Gonzalez", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Gonzalez\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1279", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1279", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1279&version=20250SB127999INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1279", "note": ""}], "extras": {"impact_clause": "An act to amend Section 70615 of the Government Code, and to add and repeal Article 4.5 (commencing with Section 22443) of Chapter 7 of Division 11 of the Vehicle Code, relating to vehicles.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:04+00:00", "_id": "ec1f3f42-0fca-11f1-9ce2-72e66fa16e68"}