{"legislative_session": "20252026", "identifier": "AB1574", "title": "The Tribal Foster Care Prevention Program.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["TheTribalFosterCarePreventionProgram"], "abstracts": [{"note": "summary", "abstract": "Existing federal law, the Indian Child Welfare Act of 1978 (ICWA) , governs the proceedings for determining the placement of an Indian child when that child is removed from the custody of the child's parent or guardian. Existing law specifies that the state is committed to protecting the essential tribal relations and best interest of an Indian child by promoting practices in accordance with ICWA. Existing law also provides for the state and an Indian tribe to enter into an agreement regarding the care and custody of Indian children and jurisdiction over Indian child custody proceedings. Existing law establishes, in order to provide additional funds to eligible Indian tribes that have entered into an agreement with the state pursuant to those provisions, the Tribally Approved Homes Compensation Program to provide funds to recruit and approve homes for the purpose of foster or adoptive placement of an Indian child and the Tribal Dependency Representation Program to provide funds to pay for legal counsel to represent the Indian tribe in a California Indian child custody proceeding.\n\nThis bill would establish the Tribal Foster Care Prevention Program to provide funding to assist any federally recognized Indian tribe located in California, or with lands that extend into California, in funding the costs associated with services aimed at preserving families and preventing the entry of children into foster care. The bill would require an Indian tribe that seeks funding for this purpose to submit an annual letter of interest to the department. The bill would require the department, subject to an appropriation in the annual Budget Act for this purpose, to provide each Indian tribe that enters into a specified agreement and submits a letter of interest an annual allocation. The bill would require an Indian tribe that receives funds to submit a progress report regarding the number of Indian children and their families served to the department on or before September 30 following the close of the fiscal year in which funding was received.\n\nThis bill would authorize the department to issue written guidance to implement, interpret, or make specific these provisions without taking any regulatory action."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 12.", "date": "2026-01-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Rogers", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Rogers\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1574", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1574", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1574&version=20250AB157499INT", "media_type": "application/pdf"}], "date": "2026-01-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1574", "note": ""}], "extras": {"impact_clause": "An act to add Section 10553.16 to the Welfare and Institutions Code, relating to foster youth.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-19T08:48:41+00:00", "_id": "a7f455ae-f513-11f0-a4ab-4637a27ff409"}