{"legislative_session": "20252026", "identifier": "AB1576", "title": "Workers' compensation: Subsequent injuries payments.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill", "appropriation"], "subject": ["Subsequentinjuriespayments", "Workers'compensation"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes a workers' compensation system, administered by the Administrative Director of the Division of Workers' Compensation, to compensate an employee for injuries sustained in the course of employment. Existing law provides certain methods for determining workers' compensation benefits payable to a worker or the worker's dependents for purposes of permanent total disability or permanent partial disability that include a determination of the percentage of permanent disability incurred. Existing law requires that, for injuries incurred before January 1, 2013, in determining the percentages of permanent disability, account be taken of the nature of the physical injury or disfigurement, the occupation of the injured employee, and the injured employee's age at the time of the injury, and requires that specified factors be considered in determining an employee's diminished earning capacity for these purposes. For purposes of these provisions, \"nature of the physical injury or disfigurement\" incorporates the descriptions and measurements of physical impairment and the corresponding percentages of impairments published in the American Medical Association (AMA) Guides to the Evaluation of Permanent Impairment (5th Edition) . For injuries occurring on or after January 1, 2013, in determining the percentages of permanent disability, existing law requires the same factors be taken into account but removes from consideration the employee's diminished future earning capacity and, instead, incorporates an adjustment factor of 1.4, as specified.\n\nExisting law also establishes the Subsequent Injuries Benefits Trust Fund, a continuously appropriated fund. Under existing law, if a permanently, partially disabled employee receives a subsequent compensable injury resulting in additional permanent disability, then that employee receives compensation from the Subsequent Injuries Benefits Trust Fund. Existing law requires, when applicable, the additional permanent disability resulting from the subsequent injury to be equal to 35% or more of total, when considered alone and without regard to, or adjustment for, the occupation or the age of the employee.\n\nFor purposes of determining permanent disability resulting from a subsequent injury, this bill would measure permanent disability, for injuries occurring on or after January 1, 2005, and prior to January 1, 2013, by the whole person impairment rating as determined in accordance with the AMA Guides to the Evaluation of Permanent Impairment (5th Edition) , after adjustment for diminished future earning capacity and without regard to, or adjustment for, the occupation or age of the employee. For injuries occurring on or after January 1, 2013, the bill would measure permanent disability in the same manner as an injury occurring on or after January 1, 2005, and prior to January 1, 2013, except that an adjustment for diminished future earning capacity is replaced by the 1.4 adjustment factor. The bill would state that these provisions are declarative of existing law. To the extent the bill changes the eligibility requirements for and calculation for payments made from the Subsequent Injuries Benefits Trust Fund, the bill would make an appropriation.\n\nThis bill would, for compensable subsequent injuries occurring on or after January 1, 2027, require, for purposes of determining eligibility for and the amount of an award of special additional compensation, the existence of the prior permanent partial disability at the time of the subsequent compensable injury to be determined by substantial evidence, based on medical records, testimony, or other evidence, that the prior permanent partial disability predated the subsequent compensable injury and that the prior permanent partial disability resulted in loss of earnings, interfered with work activities, or otherwise impacted the ability of the employee to perform work activities or activities of daily living. For these compensable subsequent injuries occurring on or after January 1, 2027, the bill would require an employee to file an application for special additional compensation pursuant to these provisions within 5 years from the date of the subsequent compensable injury or one year from the date that the level of permanent disability arising from the subsequent compensable injury is determined by the Workers' Compensation Appeals Board (WCAB) , whichever occurs later. The bill would require the administrative director to create and maintain a database of qualified medical evaluators to perform evaluations for claims filed for a subsequent compensable injury. The bill would make conforming changes.\n\nExisting law requires the WCAB to fix and award the amounts of special additional compensation to be paid and to direct the State Compensation Insurance Fund (SCIF) to pay the additional compensation awarded. Existing law authorizes the additional compensation to be paid only from funds appropriated for these purposes. Existing law authorizes SCIF to reimburse itself for specified costs from this appropriation.\n\nThis bill would replace SCIF with the Director of Industrial Relations, as trustee of the Subsequent Injuries Benefits Trust Fund, as the entity to pay the additional compensation awarded by the WCAB. The bill would delete SCIF's authorization to reimburse itself for specified costs."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 12.", "date": "2026-01-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ortega", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ortega\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1576", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1576", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1576&version=20250AB157699INT", "media_type": "application/pdf"}], "date": "2026-01-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1576", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 4751, 4753.5, 4754, and 4755 of, and to add Sections 4754.1 and 4754.2 to, the Labor Code, relating to workers' compensation, and making an appropriation therefor.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-20T09:34:41+00:00", "_id": "3f4e4908-f5e3-11f0-9921-d6f578eb85c5"}