{"legislative_session": "20252026", "identifier": "AB2424", "title": "Lifeline program.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Lifelineprogram"], "abstracts": [{"note": "summary", "abstract": "Existing law vests the Public Utilities Commission with regulatory authority over public utilities, including telephone corporations. Existing law, the Moore Universal Telephone Service Act, establishes the Universal Lifeline Telephone Service program to provide low-income households with access to affordable basic residential telephone service. Existing law requires the commission, by January 15, 2017, to adopt a portability freeze rule for the lifeline program, as specified. Existing law requires that a lifeline telephone service subscriber be provided with one lifeline subscription at the subscriber's principal place of residence, and provides that no other member of that subscriber's family or household, as defined, who maintains residence at that place is eligible for lifeline telephone service.\n\nThis bill would prohibit the commission, in administering the lifeline program, from favoring or disfavoring one technology over another technology and from unfairly advantaging or disadvantaging one provider over another provider. The bill would establish a freeze on portability between eligible telecommunications carriers, as defined, and for the transfer of any lifeline benefits for the first 120 days after the date of enrollment of any lifeline telephone service subscriber. The bill would authorize up to three members of the same family or household to be lifeline telephone service subscribers.\n\nUnder existing law, a violation of the Public Utilities Act or any order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause the provisions of this bill would be a part of the act and a violation of a commission action implementing its requirements would be a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Carrillo", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Carrillo\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2424", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2424", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2424&version=20250AB242499INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2424", "note": ""}], "extras": {"impact_clause": "An act to amend Section 878 of, and to add Sections 871.6 and 873.5 to, the Public Utilities Code, relating to communications.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:37+00:00", "_id": "235e2b26-0fcb-11f1-9ce2-72e66fa16e68"}