{"legislative_session": "20252026", "identifier": "AB1805", "title": "Wireless service providers: network resiliency: minimum service levels.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Wirelessserviceproviders", "minimumservicelevels", "networkresiliency"], "abstracts": [{"note": "summary", "abstract": "Existing law vests the Public Utilities Commission with regulatory authority over public utilities, including telephone corporations. Existing law requires the commission, in consultation with the Office of Emergency Services, to develop and implement backup electricity rules to require providers of telecommunications service to submit resiliency plans to maintain backup electricity for their telecommunications infrastructure sufficient to maintain telecommunications service for at least 72 hours, as provided.\n\nThis bill would require each wireless service provider, as defined, operating a facility located wholly or partially within a high fire-threat district or high earthquake threat district to ensure the continuous capability to provide, during both normal and emergency conditions, specific minimum service levels, including, among other things, outbound access to 911 emergency services and receipt of emergency alerts and public safety notifications. The bill would require each wireless service provider to prepare, maintain, and implement a written network resiliency plan that includes specified elements, and to submit the network resiliency plan to the commission on or before April 1, 2027, and at least triennially thereafter, as specified. The bill would authorize the commission to impose fines, require corrective actions, or take any other authorized enforcement action for a failure to comply with these requirements or an approved network resiliency plan.\n\nUnder existing law, a violation of an order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause a violation of a commission action implementing this bill's requirements would be a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 13.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ransom", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ransom\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1805", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1805", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/10/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1805&version=20250AB180599INT", "media_type": "application/pdf"}], "date": "2026-02-10", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1805", "note": ""}], "extras": {"impact_clause": "An act to add Article 5 (commencing with Section 2900) to Chapter 10 of Part 2 of Division 1 of the Public Utilities Code, relating to communications.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-12T09:00:58+00:00", "_id": "58de0dca-07f1-11f1-8856-36e757393db5"}