{"legislative_session": "20252026", "identifier": "AB1705", "title": "Pornographic internet websites.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Pornographicinternetwebsites"], "abstracts": [{"note": "summary", "abstract": "Existing law generally regulates obscene content on internet websites, including requiring a social media platform to provide a means for a user who is a California resident to report material to the social media platform that the user reasonably believes is child sexual abuse material and prohibiting an operator of an internet website directed to minors from advertising obscene matter to minors. Under existing law, a person who distributes an image of an intimate body part or act of sexual intercourse of an identifiable person, under specified circumstances that include an agreement or understanding that the image would remain private, is guilty of a crime.\n\nThis bill would require an operator of a pornographic internet website, among other things, to exercise ordinary care and reasonable diligence to ensure that each instance of sexually explicit content displayed on the operator's pornographic internet website does not include a depicted individual. The bill would define terms, including \"depicted person,\" for its purposes.\n\n This bill would also require an operator to exercise ordinary care and take reasonable steps to ensure that each instance of sexually explicit content uploaded to the operator's pornographic internet website does not include a depicted individual. The bill would require a user of a pornographic internet website, before uploading sexually explicit content, to submit specific information to the operator, including a statement certifying, under penalty of perjury, that each individual depicted in the sexually explicit content meets certain criteria. Under the bill, knowingly providing false information in the user statement would be punishable as an infraction with a specified fine. By expanding the crime of perjury and creating a new crime, this bill would impose a state-mandated local program.\n\nThis bill would authorize a depicted individual and a public prosecutor to bring a civil action to enforce these provisions, as prescribed.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 7.", "date": "2026-02-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Bauer-Kahan", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bauer-Kahan\"}", "organization_id": null}, {"name": "Dixon", "classification": "author", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Dixon\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1705", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1705", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/04/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1705&version=20250AB170599INT", "media_type": "application/pdf"}], "date": "2026-02-04", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1705", "note": ""}], "extras": {"impact_clause": "An act to add Chapter 22.6.10 (commencing with Section 22610) to Division 8 of the Business and Professions Code, relating to privacy.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-08T08:48:42+00:00", "_id": "f8c6c0b8-04ca-11f1-9308-1a8922ae3534"}