{"legislative_session": "20252026", "identifier": "AB1843", "title": "Communicable diseases: hepatitis B and C.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Communicablediseases", "hepatitisBandC"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Knox-Keene Health Care Service Plan Act of 1975, provides for the licensure and regulation of health care service plans by the Department of Managed Health Care and makes a willful violation of the act a crime. Existing law also provides for the regulation of health insurers by the Department of Insurance. \n\nThis bill would prohibit a health care service plan and health insurer from subjecting direct-acting antiviral drugs that are medically necessary for the treatment of hepatitis C to prior authorization. The bill would specify that these provisions do not require a health care service plan or health insurer to cover all therapeutically equivalent versions without prior authorization. The bill would prohibit a health care service plan and health insurer from imposing prior authorization requirements, as specified, and would require a health care service plan and health insurer's clinical criteria for hepatitis C treatment to align with current guidelines and the standard of care consistent with the standards of the American Liver Foundation and Infectious Diseases Society of America. Because a violation of these provisions by a health care service plan would be a crime, this bill would impose a state-mandated local program.\n\nExisting law requires public health records related to human immunodeficiency virus or acquired immunodeficiency syndrome, containing personally identifying information, that were developed or acquired by a state or local public health agency, or an agent of that agency, to be confidential and not disclosed, except as otherwise provided by law for public health purposes or pursuant to a written authorization by the person who is the subject of the record or by their guardian or conservator. Existing law additionally authorizes disclosure when the confidential information is necessary for the coordination of, linkage to, or reengagement in care for a person. Existing law makes disclosure of confidential public health records punishable by various civil penalties or as a misdemeanor, as specified. \n\nThis bill would make public health records relating to hepatitis B and hepatitis C, containing personally identifying information, that were developed or acquired by a local health agency, or an agent of that agency, to be confidential and not disclosed, except as otherwise provided by law or with the written consent of the person who is the subject of the record or by their legal representative. The bill would authorize a local health officer to disclose any information when necessary to facilitate clinical management, treatment coordination, and prevent the spread of disease or occurrence of additional cases. The bill would apply existing civil and criminal penalties to unauthorized disclosures of confidential public health records covered by these provisions. By expanding the scope of an existing crime, this bill would impose a state-mandated local program.\n\nExisting constitutional provisions require that a statute that limits the right of access to the meetings of public bodies or the writings of public officials and agencies be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\nThis bill would make legislative findings to that effect.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 14.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Elhawary", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Elhawary\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1843", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1843", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/11/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1843&version=20250AB184399INT", "media_type": "application/pdf"}], "date": "2026-02-11", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1843", "note": ""}], "extras": {"impact_clause": "An act to add Sections 1342.76 and 121027 to the Health and Safety Code, and to add Section 10123.1936 to the Insurance Code, relating to public health.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-18T09:02:53+00:00", "_id": "9bd24446-0ca8-11f1-b63b-c6889cfda9fe"}