{"legislative_session": "20252026", "identifier": "AB1846", "title": "Dependency: placement of child with relative.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Dependency", "placementofchildwithrelative"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the jurisdiction of the juvenile court, which may adjudge a child to be a dependent of the court under certain circumstances, including when the child suffered, or there is a substantial risk that the child will suffer, serious physical harm, or a parent fails to provide the child with adequate food, clothing, shelter, or medical treatment. Existing law establishes the grounds for removal of a dependent child from the custody of their parents or guardian, and establishes procedures to determine placement of a dependent child. Existing law requires, when a child is removed from the physical custody of their parents, preferential consideration to be given to a request by a relative of the child for placement of the child with the relative. Existing law prescribes factors for the county social worker and court to consider in determining placement, and requires the court to state on the record the reasons placement was denied if the court does not place the child with a relative who has been considered for placement.\n\nThis bill would require, if the court does not initially place the child with a relative who has been considered for placement, the court to state for the record the reasons why the placement with that relative was denied or delayed. The bill would clarify that a statement on the record pursuant to this provision does not prevent the court from ordering a placement with a relative later, as specified. The bill would require, if after specified hearings the child welfare agency recommends placement with a relative and the court finds by clear and convincing evidence that such placement is in the best interest of the child, the court to order the placement with that relative. The bill would specify that placement with a relative does not prevent the child welfare agency from recommending a placement change upon identification of another appropriate placement with a different relative, pursuant to the Interstate Compact on the Placement of Children, or other circumstances as approved by the court, and does not require another petition, as specified."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 14.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Stefani", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Stefani\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1846", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1846", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/11/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1846&version=20250AB184699INT", "media_type": "application/pdf"}], "date": "2026-02-11", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1846", "note": ""}], "extras": {"impact_clause": "An act to amend Section 361.3 of the Welfare and Institutions Code, relating to juveniles.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:54+00:00", "_id": "3e52f70a-0e3a-11f1-a618-2a6200350f1a"}