{"legislative_session": "20252026", "identifier": "SB802", "title": "Housing finance and development: Sacramento Area Housing and Homelessness Agency: Multifamily Housing Program: Homekey: Homeless Housing, Assistance, and Prevention program.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Homekey", "HomelessHousing,Assistance,andPreventionprogram", "Housingfinanceanddevelopment", "MultifamilyHousingProgram", "SacramentoAreaHousingandHomelessnessAgency"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law, the Joint Exercise of Powers Act, authorizes 2 or more public agencies, by agreement, to form a joint powers authority to exercise any power common to the contracting parties, as specified. Existing law authorizes the agreement to set forth the manner by which the joint powers authority will be exercised.\n\nThis bill would require that the joint powers authority currently operating as the Sacramento Housing and Redevelopment Agency be restructured, expanded, amended, and renamed as the Sacramento Area Housing and Homelessness Agency, as provided. The bill would require the agency to include the County of Sacramento and qualified local agencies, as specified and defined, and would make the agency the regional authority for prescribed activities, including developing and preserving affordable housing and coordinating and administering homelessness prevention and response services. The bill would require the updated joint powers agreement to provide for a governing board and an exectuve director, as specified, and require the Sacramento Local Agency Formation Commission to form and appoint an independent task force to consolidate all entities for purposes of establishing the agency, as provided. The bill would require the agency to adopt a comprehensive strategic plan to address housing and homelessness no later than 3 years from the date the restructured joint powers agreement takes effect. The bill would also require the agency to establish and maintain a standing advisory board, as provided.\n\nUnder the bill, the Sacramento Area Housing and Homelessness Agency would retain its legal identity as the public housing authority and redevelopment successor entity and continue to administer all existing housing, homelessness, and redevelopment programs in compliance with specified law. The bill would require the agency to be the designated recipient of all local housing trust funds and local housing ordinance fees collected by each participating entity within the joint powers agreement, and require that the agency be deemed a regional entity for the purposes of statewide housing and homelessness funding programs. The bill would require the agency to coordinate its operations with the housing and homelessness departments of each participating jurisdiction, as specified, to ensure alignment of local priorities and effective delivery of services.\n\nExisting law, the Planning and Zoning Law, requires each county and each city to adopt a comprehensive, long-term general plan for the physical development of the county or city, and specified land outside its boundaries, that includes, among other specified mandatory elements, a housing element. For the 4th and subsequent revisions of the housing element, existing law requires the Department of Housing and Community Development to determine the existing and projected need for housing for each region, and requires the appropriate council of governments, or the department for cities and counties without a council of governments, to adopt a final regional housing need plan that allocates a share of the regional housing need to each city, county, or city and county, as provided. Existing law requires that a county's or city's housing element include an assessment of housing needs and an inventory of resources and constraints that are relevant to the meeting of these needs, including an analysis of population and employment trends and documentation of projections and a quantification of the locality's existing and projected housing needs for all income levels that includes the locality's share of the regional housing need.\n\n This bill would require that the regional housing needs allocations for all participating entities within the Sacramento Area Housing and Homelessness Agency be consolidated into a single regional goal to be administered by the agency. The bill would also require that the total regional housing needs assessment allocation for the joint powers agreement be reduced by 20% from the aggregate of the allocations that would otherwise apply to the participating entities individually.\n\nThe California Constitution, with respect to any taxes levied on taxable property in a redevelopment project established under the Community Redevelopment Law, as it then read or may be amended, authorizes the Legislature to provide for the division of those taxes under a redevelopment plan between the taxing agencies and the redevelopment agency, as provided. Existing law dissolved redevelopment agencies as of February 1, 2012, and designates successor agencies to act as successor entities to the dissolved redevelopment agencies. Existing law also provides for the designation of a housing successor to assume the housing assets, as defined, and functions of a former redevelopment agency and requires that any funds transferred to the housing successor, together with any funds generated from housing assets, be maintained in a separate Low and Moderate Income Housing Asset Fund of the housing successor, to be used as specified, including to meet the enforceable obligations of the housing successor.\n\n This bill would require that housing tax increment revenues derived from former redevelopment areas and allocated to participating cities or to the County of Sacramento be transferred to the Sacramento Area Housing and Homelessness Agency. The bill would require that these revenues be used exclusively for the development, preservation, and administration of affordable housing projects. The bill would authorize the agency to issue bonds secured by these revenues to finance current and future housing initiatives.\n\nBy adding to the duties of local officials with respect to the activities of the Sacramento Housing and Homelessness Agency, this bill would impose a state-mandated local program.\n\nThis bill would make legislative findings and declarations as to the necessity of a special statute for County of Sacramento. The bill would make additional related findings and declarations.\n\n(2) Existing law establishes various housing programs administered by the Department of Housing and Community Development, including the Homeless Housing, Assistance, and Prevention program (HHAP) and the Multifamily Housing Program. Existing law establishes the Homeless Housing, Assistance, and Prevention program for the purpose of providing jurisdictions with grant funds to support regional coordination and expand or develop local capacity to address their immediate homelessness challenges, as specified. Existing law establishes the Multifamily Housing Program to provide financial assistance in the form of deferred payment loans to pay for the eligible costs of development of specified types of housing projects. Existing law requires that specified funds appropriated to provide housing for individuals and families who are experiencing homelessness or who are at risk of homelessness and who are inherently impacted by or at increased risk for medical diseases or conditions due to the COVID-19 pandemic or other communicable diseases be disbursed in accordance with the Multifamily Housing Program for specified uses. This disbursement program is referred to as Homekey.\n\nThis bill would require the department, upon appropriation for the above-specified programs, to ensure that former foster youth and extremely low income, very low income, and lower income households, as specified, are given consideration.\n\n(3) The California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [{"note": "", "title": "Housing authorities."}, {"note": "", "title": "Multifamily Housing Program: Homekey: Homeless Housing, Assistance, and Prevention program."}], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2025-02-21", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 24.", "date": "2025-02-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Read first time.", "date": "2025-02-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Com. on RLS.", "date": "2025-03-12", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on RLS.", "entity_type": "organization", "organization_id": null}]}, {"description": "From committee with author's amendments. Read second time and amended. Re-referred to Com. on RLS.", "date": "2025-03-26", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["amendment-passage", "committee-passage", "reading-1", "reading-2", "referral-committee"], "related_entities": [{"name": "Com. on RLS.", "entity_type": "organization", "organization_id": null}]}, {"description": "Re-referred to Coms. on HOUSING and HUMAN S.", "date": "2025-04-02", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Coms. on HOUSING and HUMAN S.", "entity_type": "organization", "organization_id": null}]}, {"description": "Withdrawn from committee.", "date": "2025-04-03", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "Re-referred to Coms. on HUMAN S. and HOUSING.", "date": "2025-04-03", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Coms. on HUMAN S. and HOUSING.", "entity_type": "organization", "organization_id": null}]}, {"description": "Set for hearing April 21.", "date": "2025-04-08", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "From committee: Do pass and re-refer to Com. on HOUSING. (Ayes 5. Noes 0. Page 812.) (April 21). Re-referred to Com. on HOUSING.", "date": "2025-04-22", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["committee-passage", "committee-passage-favorable", "referral-committee"], "related_entities": [{"name": "Com. on HOUSING.", "entity_type": "organization", "organization_id": null}]}, {"description": "Set for hearing April 29.", "date": "2025-04-24", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "From committee: Do pass as amended and re-refer to Com. on APPR. with recommendation: To consent calendar. (Ayes 11. Noes 0. Page 937.) (April 29).", "date": "2025-04-30", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["amendment-passage", "committee-passage", "committee-passage-favorable"], "related_entities": []}, {"description": "Read second time and amended. Re-referred to Com. on APPR.", "date": "2025-05-01", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["amendment-passage", "reading-1", "reading-2", "referral-committee"], "related_entities": [{"name": "Com. on APPR.", "entity_type": "organization", "organization_id": null}]}, {"description": "Set for hearing May 19.", "date": "2025-05-09", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}, {"description": "From committee: Be ordered to second reading pursuant to Senate Rule 28.8 and ordered to consent calendar.", "date": "2025-05-19", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["committee-passage", "reading-2"], "related_entities": []}, {"description": "Read second time. Ordered to consent calendar.", "date": "2025-05-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["reading-1", "reading-2"], "related_entities": []}, {"description": "Read third time. Passed. (Ayes 36. Noes 0. Page 1137.) Ordered to the Assembly.", "date": "2025-05-23", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["passage", "reading-1", "reading-3"], "related_entities": []}, {"description": "In Assembly. Read first time. Held at Desk.", "date": "2025-05-23", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Coms. on H. & C.D. and HUM. S.", "date": "2025-05-29", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Coms. on H. & C.D. and HUM. S.", "entity_type": "organization", "organization_id": null}]}, {"description": "June 18 set for first hearing canceled at the request of author.", "date": "2025-06-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "From committee with author's amendments. Read second time and amended. Re-referred to Com. on H. & C.D.", "date": "2025-06-23", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["amendment-passage", "committee-passage", "reading-1", "reading-2", "referral-committee"], "related_entities": [{"name": "Com. on H. & C.D.", "entity_type": "organization", "organization_id": null}]}, {"description": "July 2 hearing postponed by committee.", "date": "2025-06-27", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Assembly Rule 56 suspended.", "date": "2025-07-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "July 16 set for second hearing canceled at the request of author.", "date": "2025-07-16", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ashby", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ashby\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB802", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB802", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/21/25 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB802&version=20250SB80299INT", "media_type": "application/pdf"}], "date": "2025-02-21", "classification": ""}, {"note": "03/26/25 - Amended Senate", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB802&version=20250SB80298AMD", "media_type": "application/pdf"}], "date": "2025-03-26", "classification": ""}, {"note": "05/01/25 - Amended Senate", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB802&version=20250SB80297AMD", "media_type": "application/pdf"}], "date": "2025-05-01", "classification": ""}, {"note": "06/23/25 - Amended Assembly", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB802&version=20250SB80296AMD", "media_type": "application/pdf"}], "date": "2025-06-23", "classification": ""}], "documents": [{"note": "04/16/25- Senate Human Services", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202520260SB802&analysisId=383943&analyzingOffice=Senate+Human+Services", "media_type": "application/pdf"}], "date": "2025-04-16", "classification": "analysis"}, {"note": "04/24/25- Senate Housing", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202520260SB802&analysisId=384851&analyzingOffice=Senate+Housing", "media_type": "application/pdf"}], "date": "2025-04-24", "classification": "analysis"}, {"note": "05/21/25- Sen. Floor Analyses", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202520260SB802&analysisId=387113&analyzingOffice=Sen.+Floor+Analyses", "media_type": "application/pdf"}], "date": "2025-05-21", "classification": "analysis"}, {"note": "07/15/25- Assembly Local Government", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202520260SB802&analysisId=390607&analyzingOffice=Assembly+Local+Government", "media_type": "application/pdf"}], "date": "2025-07-15", "classification": "analysis"}, {"note": "07/15/25- Assembly Housing and Community Development", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202520260SB802&analysisId=390608&analyzingOffice=Assembly+Housing+and+Community+Development", "media_type": "application/pdf"}], "date": "2025-07-15", "classification": "analysis"}], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB802", "note": ""}], "extras": {"impact_clause": "An act to add Article 1.5 (commencing with Section 6539.9.5) to Chapter 5 of Division 7 of Title 1 of the Government Code, and to amend Section 50675.1.3 of, to add Section 50675.17 to, and to add Article 3 (commencing with Section 50245) to Chapter 6.5 of Part 1 of Division 31 of, the Health and Safety Code, relating to housing.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-10T08:41:11+00:00", "_id": "1db17026-ee00-11f0-a2a3-fa187f632c1e"}