{"legislative_session": "20252026", "identifier": "AB2002", "title": "Local government assistance: Regional Early Action Planning Fund.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Localgovernmentassistance", "RegionalEarlyActionPlanningFund"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Planning and Zoning Law, requires each county and each city to adopt a comprehensive, long-term general plan for the physical development of the county or city, and specified land outside its boundaries, that includes, among other specified mandatory elements, a housing element. That law requires the Department of Housing and Community Development, in consultation with each council of governments, to determine the existing and projected need for housing in each region and further requires the appropriate council of governments, or the department for cities and counties without a council of governments, to adopt a final regional housing need plan that allocates a share of the regional housing need to each city, county, or city and county, as provided. Existing law establishes the Local Government Planning Support Grants Program, administered by the department, for the purpose of providing regions and jurisdictions with one-time funding, including grants for planning activities to enable jurisdictions to meet the sixth cycle of the regional housing need assessment, as provided.\n\nThis bill would establish the Regional Early Action Planning Fund in the State Treasury for the purpose of providing councils of governments, regional entities, and jurisdictions with one-time funding, including grants for planning activities, to enable those entities to meet the 7th and subsequent cycles of the regional housing need assessment. The bill would require the department to allocate funds, upon appropriation by the Legislature, from the Regional Early Action Planning Fund to each council of governments or regional entity responsible for allocating regional housing need that applies and qualifies for those moneys, as specified. The bill would authorize a council of governments or regional entity to expend funds awarded for certain purposes, including for activities that support the development, improvement, or implementation of the methodology for the 7th and subsequent regional housing needs assessment cycles, and for providing jurisdictions with technical assistance, planning, temporary staffing, or consultant needs associated with updating local planning and zoning documents, as provided. The bill would require a jurisdiction that receives a suballocation of funds to only use that suballocation for housing-related planning activities, as provided. The bill would authorize the department to monitor expenditures and activities of an applicant, as the department deems necessary, to ensure compliance with program requirements.\n\nExisting law, the Administrative Procedure Act, sets forth the requirements for the adoption, publication, review, and implementation of regulations by state agencies.\n\nThis bill would require the department to issue guidelines to implement the above-described provisions and would exempt those guidelines from the rulemaking provisions of the Administrative Procedure Act."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-17", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 20.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Solache", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Solache\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2002", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2002", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/17/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2002&version=20250AB200299INT", "media_type": "application/pdf"}], "date": "2026-02-17", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2002", "note": ""}], "extras": {"impact_clause": "An act to add Chapter 3.16 (commencing with Section 50515.11) to Part 2 of Division 31 of the Health and Safety Code, relating to housing.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:56+00:00", "_id": "3fd2bc64-0e3a-11f1-a618-2a6200350f1a"}