{"legislative_session": "20252026", "identifier": "AB1629", "title": "Dental coverage.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Dentalcoverage"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Knox-Keene Health Care Service Plan Act of 1975, provides for the licensure and regulation of health care service plans by the Department of Managed Health Care and makes a willful violation of the act's requirements a crime. Existing law provides for the regulation of health insurers by the Department of Insurance. Existing law prohibits a contract between a plan or insurer and a dentist from requiring a dentist to accept an amount set by the plan or insurer as payment for dental care services provided to an enrollee or insured that are not covered services under the enrollee's contract or the insured's policy. Existing law requires a plan or insurer to make specified disclosures to an enrollee or insured regarding noncovered dental services.\n\nExisting law requires a health care service plan or health insurer to comply with specified timely access requirements. Under existing law, a health care service plan is required to annually report to the Department of Managed Health Care on this compliance. Existing law authorizes the Department of Insurance to issue guidance to insurers regarding annual timely access and network reporting methodologies.\n\nIf a health care service plan or health insurer pays a contracting dental provider directly for covered services, this bill would require the plan or insurer to pay a noncontracting dental provider directly for covered services if the noncontracting provider submits to the plan or insurer a written assignment of benefits form signed by the enrollee or insured. The bill would require the plan or insurer to provide a predetermination or prior authorization to the dental provider and to reimburse the provider for not less than that amount, except as specified. The bill would require the plan or insurer to notify the enrollee or insured that the provider was paid and that the out-of-network cost may count towards their annual or lifetime maximum. The bill would require a noncontracting dental provider to make specified disclosures to an enrollee or insured before accepting an assignment of benefits. Because a willful violation of these provisions relative to health care service plans would be a crime, this bill would impose a state-mandated local program.\n\nThis bill would require the Department of Managed Health Care and the Department of Insurance to review the adequacy of an entire dental provider network, including the portions of the network serving plans and insurers not regulated by the respective department.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-26", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 26.", "date": "2026-01-27", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Haney", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Haney\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1629", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1629", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/26/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1629&version=20250AB162999INT", "media_type": "application/pdf"}], "date": "2026-01-26", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1629", "note": ""}], "extras": {"impact_clause": "An act to amend Section 1367.03 of, and to add Section 1374.191 to, the Health and Safety Code, and to amend Section 10133.54 of, and to add Section 10120.6 to, the Insurance Code, relating to health care coverage.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-30T08:54:53+00:00", "_id": "58298838-fdb9-11f0-8b06-feaf0b904648"}