{"legislative_session": "20252026", "identifier": "AB1727", "title": "Crimes: unlawful use of DNA.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Crimes", "unlawfuluseofDNA"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Genetic Information Privacy Act, requires a direct-to-consumer genetic testing company, as defined, to provide a consumer with certain information regarding the company's policies and procedures for the collection, use, maintenance, and disclosure, as applicable, of genetic data, and to obtain a consumer's express consent for collection, use, or disclosure of the consumer's genetic data, as specified.\n\nThis bill would make a person guilty of unlawful use of DNA in the first degree, a felony, if they intentionally and without express consent sell or otherwise transfer another individual's DNA sample or genetic data to a third party, as specified.\n\nThe bill would make a person guilty of unlawful use of DNA in the second degree, a felony, if they intentionally and without express consent submit another individual's DNA for genetic testing, conduct or procure the conducting of genetic testing of another individual's DNA, or disclose another individual's genetic data to a third party, except as specified.\n\nThe bill would make a person guilty of unlawful use of DNA in the third degree, a misdemeanor, if they collect or retain another individual's DNA sample with the intent to perform a DNA analysis or if they collect or retain another individual's DNA sample or genetic information by accessing a computer system either without authorization or by exceeding their authorized access to the computer system.\n\nThe bill would exempt specified uses from its provisions, including use by law enforcement and institutes of higher education. By creating a new crime, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 8.", "date": "2026-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ta", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ta\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1727", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1727", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/05/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1727&version=20250AB172799INT", "media_type": "application/pdf"}], "date": "2026-02-05", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1727", "note": ""}], "extras": {"impact_clause": "An act to add Section 367 to the Penal Code, relating to crimes.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-11T09:04:20+00:00", "_id": "a698ea0e-0728-11f1-b7c8-26f8b3304434"}