{"legislative_session": "20252026", "identifier": "AB2682", "title": "Transportation network company drivers: labor relations: certification and appeals.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Transportationnetworkcompanydrivers", "certificationandappeals", "laborrelations"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Transportation Network Company Drivers Labor Relations Act (act) , establishes that transportation network company (TNC) drivers have the right to form, join, and participate in the activities of TNC driver organizations, to bargain through representatives of their own choosing, to engage in concerted activities for the purpose of bargaining or other mutual aid or protection, and to refrain from such activities.\n\nThe act establishes various procedures governing the certification and decertification of TNC driver organizations for purposes of representing drivers in the collective bargaining process. The act also requires the Public Employment Relations Board (board) to determine if an entity is a TNC driver organization, as prescribed, and make certain determinations as to whether a specific organization has been designated as the bargaining representative for TNC drivers pursuant to an election process. As part of those procedures, the act authorizes a TNC driver organization to present, at any time after May 1, 2026, to the board proof sufficient to show that at least 10% of active TNC drivers have authorized the TNC driver organization to act as their bargaining representative. The act provides that for 6 months from the date of the board's determination that a TNC driver organization has been authorized to act as the bargaining representative by at least 10% of active TNC drivers, no other TNC driver organization shall be certified as the certified driver bargaining organization of those workers without an election.\n\nThis bill would instead provide that the above-described 6-month period runs from the date the board determines that the first TNC driver organization has been authorized to act as the bargaining representative by at least 10% of active TNC drivers. The bill would make related clarifying changes.\n\nThe act designates certain actions and inactions of TNCs, such as failure or refusal to negotiate in good faith with a certified bargaining organization, and of TNC driver organizations as unfair practices which are subject to the board's unfair practice procedure regulations.\n\nThis bill would authorize any charging party, respondent, or intervenor aggrieved by a final decision or order of the board in an unfair practice case to petition for a writ of extraordinary relief from such a decision or order, except as provided. The bill would set forth procedures for filing and reviewing the petition and for enforcing final decisions or orders subsequent to the expiration of the petition timeline."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Berman", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Berman\"}", "organization_id": null}, {"name": "Wicks", "classification": "author", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Wicks\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2682", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2682", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2682&version=20250AB268299INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2682", "note": ""}], "extras": {"impact_clause": "An act to amend Section 7470.8 of, and to add Section 7470.18.5 to, the Business and Professions Code, relating to transportation.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:43+00:00", "_id": "2741cc52-0fcb-11f1-9ce2-72e66fa16e68"}