{"legislative_session": "20252026", "identifier": "AB2234", "title": "California Environmental Quality Act: geothermal exploratory projects.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaEnvironmentalQualityAct", "geothermalexploratoryprojects"], "abstracts": [{"note": "summary", "abstract": "The California Environmental Quality Act (CEQA) requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of an environmental impact report on a project that it proposes to carry out or approve that may have a significant effect on the environment or to adopt a negative declaration if the lead agency finds that the project will not have that effect. CEQA also requires a lead agency to prepare a mitigated negative declaration for a project that may have a significant effect on the environment if revisions in the project would avoid or mitigate that effect and there is no substantial evidence that the project, as revised, would have a significant effect on the environment.\n\nExisting law establishes the Geologic Energy Management Division in the Department of Conservation. Existing law requires the division to be the lead agency for all geothermal exploratory projects for purposes of CEQA, except as provided. Existing law defines \"geothermal exploratory project,\" for purposes of CEQA, in part as a project composed of not more than 6 wells and associated drilling and testing equipment whose chief and original purpose is to evaluate the presence and characteristics of geothermal resources. Existing law requires wells included within a geothermal exploratory project to be located at least 12 mile from geothermal development wells that are capable of producing geothermal resources in commercial quantities.\n\nThis bill would expressly include as part of a geothermal exploratory project, among other things, equipment and activities necessary to establish interconnectivity between wells and reservoirs. The bill would exclude certain wells connecting to geothermal reservoirs from the 12-mile limit described above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Papan", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Papan\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2234", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2234", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2234&version=20250AB223499INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2234", "note": ""}], "extras": {"impact_clause": "An act to amend Section 21065.5 of the Public Resources Code, relating to geothermal resources.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:58:00+00:00", "_id": "42130d1c-0e3a-11f1-a618-2a6200350f1a"}