{"legislative_session": "20252026", "identifier": "AB1919", "title": "Santa Cruz Metropolitan Transit District: transactions and use tax: qualified voter initiative.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["SantaCruzMetropolitanTransitDistrict", "qualifiedvoterinitiative", "transactionsandusetax"], "abstracts": [{"note": "summary", "abstract": "Existing law provides for the establishment of the Santa Cruz Metropolitan Transit District, with specified powers and duties related to the operation of public transit services serving the County of Santa Cruz. Existing law, among other things, authorizes the board of directors of the district to impose transactions and use taxes in accordance with the Transactions and Use Tax Law by an ordinance approved by the electors voting on the measure at a special election called by the board of directors for that purpose.\n\nThis bill would also authorize those special taxes to be imposed by a qualified voter initiative. The bill would require the special election for a tax measure proposed by the board of directors or a qualified voter initiative to be consolidated with a statewide general election by the board of supervisors of the County of Santa Cruz and would require the tax measure to be submitted to the voters in accordance with specified elections provisions. The bill would also require the county elections official for the County of Santa Cruz to serve as the elections official of the district for purposes of administering the ballot measure process and any election for purposes of specified provisions of law. To the extent that the bill would impose additional duties on a county elections official, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above.\n\nThis bill would declare that it is to take effect immediately as an urgency statute."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Pellerin", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Pellerin\"}", "organization_id": null}, {"name": "Addis", "classification": "author", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Addis\"}", "organization_id": null}, {"name": "Laird", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Laird\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1919", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1919", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1919&version=20250AB191999INT", "media_type": "application/pdf"}], "date": "2026-02-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1919", "note": ""}], "extras": {"impact_clause": "An act to add Sections 98290.1 and 98290.2 to the Public Utilities Code, relating to transportation, and declaring the urgency thereof, to take effect immediately.", "tags": ["fiscal committee", "local program", "urgency"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-13T09:00:01+00:00", "_id": "6144257a-08ba-11f1-a2a0-cee81ff61d94"}