{"legislative_session": "20252026", "identifier": "AB1890", "title": "County of Napa: farmworker housing: funding.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CountyofNapa", "farmworkerhousing", "funding"], "abstracts": [{"note": "summary", "abstract": "Existing law requires the Department of Housing and Community Development, through its Office of Migrant Services, to assist in the development, construction, reconstruction, rehabilitation, or operation of migrant farm labor centers and authorizes the Director of Housing and Community Development to contract with school districts, housing authorities, health agencies, and other appropriate local public and private nonprofit agencies for the procurement or construction of housing or shelter and to obtain services for migratory agricultural workers.\n\nExisting law establishes the Napa County Farmworker Centers Account to be administered by the department, as specified, to assist in the financing, maintenance, and operation of the Napa County Housing Authority's Farmworker Centers for year-round use by migrant and nonmigrant farm labor employees. Existing law requires the department to award, annually, up to $250,000 in matching funds to the Napa County Housing Authority upon demonstration that the Napa County Housing Authority is capable of continuing to effectively serve the housing needs of migrant or other farmworkers in the County of Napa and requires the Napa County Housing Authority, to be eligible for funding, to provide equal or greater funds from local sources. Existing law requires the department to use funds allocated from the Building Homes and Jobs Trust Fund, as provided.\n\nThis bill would instead require the department to award, annually, up to $500,000 in matching funds to the Napa County Housing Authority upon demonstration that the Napa County Housing Authority is capable of continuing to effectively serve the housing needs of migrant or other farmworkers in the County of Napa. The bill would, instead of requiring the department to use specified funds allocated from the Building Homes and Jobs Trust Fund, provide that this bill is not operative until funding is appropriated by the Legislature in the Budget Act or any other measure for the purposes of the bill.\n\nThis bill would make legislative findings and declarations as to the necessity of a special statute for the County of Napa."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Aguiar-Curry", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Aguiar-Curry\"}", "organization_id": null}, {"name": "Cabaldon", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Cabaldon\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1890", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1890", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1890&version=20250AB189099INT", "media_type": "application/pdf"}], "date": "2026-02-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1890", "note": ""}], "extras": {"impact_clause": "An act to amend Section 50711.5 of the Health and Safety Code, relating to housing.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-13T09:00:00+00:00", "_id": "610572e4-08ba-11f1-a2a0-cee81ff61d94"}