{"legislative_session": "20252026", "identifier": "AB1923", "title": "Distressed Hospital Loan Program.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill", "appropriation"], "subject": ["DistressedHospitalLoanProgram"], "abstracts": [{"note": "summary", "abstract": "Existing law requires the Department of Health Care Access and Information to administer the Distressed Hospital Loan Program, until January 1, 2032, which provides loans to not-for-profit hospitals and public hospitals in significant financial distress or to governmental entities representing a closed hospital to prevent the closure of, or facilitate the reopening of, those hospitals. Existing law requires the department to develop a methodology to evaluate an at-risk hospital's potential eligibility for state assistance from the program, and authorizes the methodology for determining financial distress to consider the hospital's prior and projected performance on financial metrics, as specified. Existing law requires a hospital or a closed hospital applying for aid under this program to provide, among other things, the California Health Facilities Financing Authority and the department with financial information demonstrating the hospital's need for financial assistance due to financial hardship. Existing law requires the department to issue the loan award to a qualifying hospital as soon as reasonably practicable following its eligibility determination. Existing law prohibits not-for-profit hospitals and public hospitals that belong to integrated health care systems with more than 2 separately licensed hospital facilities from being eligible for state assistance under the program.\n\nThis bill would make any hospital, regardless of ownership type or system affiliation, eligible for state assistance under the program for awards provided on or after the effective date of this act, as specified, if it meets the applicable criteria for significant financial distress as established by the department and the authority. The bill would require the projections that determine financial distress to account for impacts of federal and state policy changes affecting hospital reimbursement or health care coverage, including, but not limited to, the federal One Big Beautiful Bill Act. \n\nExisting law requires the department to provide loan forgiveness or modification of loan terms to an applicant based upon criteria determined by the department and subject to the approval of the department and the authority. Existing law requires the department to establish the terms and conditions associated with accepting loan forgiveness or modification of loan terms, subject to approval of the Department of Finance.\n\nThis bill would require the evaluation for loan forgiveness incorporate projections of future financial performance in addition to a hospital's point-in-time financial condition. The bill would also, in place of the current criteria, require the department to provide loan forgiveness to any participant of the program who received a loan award before the effective date of this act, as specified, if the department and authority determine the participant has demonstrated a good faith effort to comply with program requirements through January 1, 2026, and the financial projections demonstrate that the participant will become financially distressed as a result of loan repayments under the program or other outside factors, including, but not limited to, the impacts of the federal One Big Beautiful Bill Act.\n\nExisting law establishes the Distressed Hospital Loan Program Fund, which is administered by the department. Existing law authorizes the Department of Finance to transfer up to $150,000,000 from the General Fund to the Distressed Hospital Loan Program Fund between state fiscal years 2022–23 and 2023–24 to implement these provisions. Existing law requires any funds transferred to be available for encumbrance or expenditure until December 31, 2034, and abolishes the fund on December 31, 2031.\n\nThis bill would appropriate $300,000,000 from the General Fund to the Distressed Hospital Loan Program Fund to provide additional rounds of funding to hospitals in financial distress. The bill would require any funds transferred to be available for encumbrance or expenditure until December 31, 2034, and would abolish the fund on December 31, 2034. The bill would repeal these provisions on January 1, 2035.\n\nThis bill would declare that it is to take effect immediately as an urgency statute."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 15.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Soria", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Soria\"}", "organization_id": null}, {"name": "Gipson", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Gipson\"}", "organization_id": null}, {"name": "Ransom", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Ransom\"}", "organization_id": null}, {"name": "Bonta", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Bonta\"}", "organization_id": null}, {"name": "Mark González", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Mark Gonz\\u00e1lez\"}", "organization_id": null}, {"name": "Haney", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Haney\"}", "organization_id": null}, {"name": "Rogers", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Rogers\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1923", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1923", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1923&version=20250AB192399INT", "media_type": "application/pdf"}], "date": "2026-02-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1923", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 129380, 129383, 129384, 129385, and 129387 of the Health and Safety Code, relating to hospitals, making an appropriation therefor, and declaring the urgency thereof, to take effect immediately.", "tags": ["fiscal committee", "urgency"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-15T08:45:38+00:00", "_id": "b3dfe26a-0a4a-11f1-8cce-128f59e91945"}