{"legislative_session": "20252026", "identifier": "SB1014", "title": "Development projects: onsite and offsite improvements.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Developmentprojects", "onsiteandoffsiteimprovements"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Permit Streamlining Act, among other things, requires a city, county, or city and county to deem an applicant for a housing development project to have submitted a preliminary application upon providing specified information about the proposed project to the city, county, or city and county from which approval for the project is being sought. Existing law requires a public agency, not later than 30 calendar days after receiving an application for a development project, to determine in writing whether the application is complete and to immediately transmit the determination to the applicant for the development project.\n\nThis bill would require a city, county, or city and county, within 30 days of receipt of a preliminary application, or if a preliminary application is not submitted, within 30 days of receipt of an application for a housing development project, to provide a list to the development proponent of any required onsite or offsite improvements and an estimate of the cost for those onsite or offsite improvements. \n\nExisting law requires a local agency or state agency to compile one or more lists that specify in detail the information that will be required from an applicant for a postentitlement phase permit. Existing law defines postentitlement phase permit to include, among other things, all building permits and other permits issued under the California Building Standards Code or any applicable local building code, as specified.\n\nThis bill would prohibit a local or state agency from requiring any onsite or offsite improvements to a housing development project that were not disclosed to the development proponent within 30 days of submitting an application for a postentitlement phase permit.\n\nBy imposing new duties on local agencies, the bill would impose a state-mandated local program.\n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 13.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Grayson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Grayson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1014", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1014", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/10/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1014&version=20250SB101499INT", "media_type": "application/pdf"}], "date": "2026-02-10", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1014", "note": ""}], "extras": {"impact_clause": "An act to add Sections 65913.3.2 and 65941.3 to the Government Code, relating to development projects.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-18T09:01:46+00:00", "_id": "740061a0-0ca8-11f1-b63b-c6889cfda9fe"}