{"legislative_session": "20252026", "identifier": "AB2505", "title": "Electrical corporations: hydrogen refueling stations.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Electricalcorporations", "hydrogenrefuelingstations"], "abstracts": [{"note": "summary", "abstract": "Existing law vests the Public Utilities Commission with regulatory authority over public utilities, including electrical corporations. Existing law authorizes the commission to fix the rates and charges for every public utility and requires that those rates and charges be just and reasonable. Existing law requires each electrical corporation to file an advice letter for, and requires the commission to approve, a new tariff or rule that authorizes each electrical corporation to design and deploy all electrical distribution infrastructure on the utility side of the customer's meter for all customers installing separately metered infrastructure to support electric vehicle charging stations, other than those in single-family residences.\n\nThis bill would require each electrical corporation, on or before April 1, 2027, to file an advice letter for, and require the commission, on or before September 1, 2027, to approve, a new tariff or rule that authorizes the electrical corporation to design, construct, own, operate, and maintain all electrical distribution and service facilities located on the utility side of a customer's meter that are necessary to provide separately metered electrical service to hydrogen refueling stations, including hydrogen refueling stations located on premises that already receive electrical service for other uses. The bill would require that the tariff or rule authorize an electrical corporation to extend utility-side electrical distribution and service facilities from the existing distribution system to a dedicated revenue meter serving a hydrogen refueling station and authorize the installation of a dedicated revenue meter for the hydrogen refueling station load, as provided. The bill would require a facility installed pursuant to the tariff or rule to be treated, for cost allocation and customer contribution purposes, as line and service extensions, as provided. The bill would require an electrical corporation, to the extent that the electrical corporation capitalizes costs for a facility installed pursuant to the tariff or rule, to recover its resulting revenue requirement through periodic general rate case or other appropriate ratesetting proceedings. The bill would repeal its provisions on January 1, 2033.\n\nUnder existing law, a violation of the Public Utilities Act or any order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause the provisions of the bill would be a part of the act and a violation of a commission action implementing the bill's requirements would be a crime, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Carrillo", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Carrillo\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2505", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2505", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2505&version=20250AB250599INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2505", "note": ""}], "extras": {"impact_clause": "An act to add and repeal Section 740.26 of the Public Utilities Code, relating to energy.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:39+00:00", "_id": "249c2f60-0fcb-11f1-9ce2-72e66fa16e68"}