{"legislative_session": "20252026", "identifier": "AB2238", "title": "Mobilehome Residency Law: commencement of actions: notices.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["MobilehomeResidencyLaw", "commencementofactions", "notices"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Mobilehome Residency Law, prescribes various terms and conditions of tenancies in mobilehome parks. Existing law prohibits an action based upon the management's alleged failure to maintain the physical improvement in the common facilities in good working order or condition or alleged reduction of service from being commenced by a homeowner unless the management has been given at least 30 days' prior notice of the intention to commence the action. Existing law requires the notice be in writing, signed by the homeowner or homeowners making the allegations, and notify the management of the basis of the claim, the specific allegations, and the remedies requested. Existing law deems a notice by one homeowner to be sufficient notice of the specific allegation to the management of the park by all of the homeowners in the park.\n\nThis bill would require that the above-described notice be first preceded by a prior written notice to the owner of the mobilehome park or the designated management representative requesting the specific repair, neglected maintenance, or service that was given without having received a responsive or complete cure by the owners of the mobilehome park or designated management representatives. The bill would instead require the notice be signed by each of the homeowners making the allegations and additionally require the notice notify the management of the causes of the claims. The bill would require the specific allegations in that notice to include the prior written notices to the owner of the mobilehome park or designated management representative pursuant to the bill's provisions. The bill would remove the above-described provision deeming a notice by one homeowner to be sufficient notice.\n\nThis bill would authorize management to hire a licensed California general contractor, as specified, within 30 calendar days of receipt of the notice. The bill would require the contractor to prepare a report within 30 days after hire with recommendations to repair the conditions or services, as necessary, and require the management to do the repairs within 30 days after the report is prepared, as specified. The bill would authorize management to notify by written notice the homeowners, upon completion of the repair of the complaint, and would deem the complaint resolved upon notification absent additional or supplemental complaints from the homeowners, as provided.\n\n Existing law also deems management to be notified of the allegations when management has been notified of the allegations by a state or local agency.\n\nThis bill would instead deem management to be notified of allegations when management has been notified of the allegations by a governmental entity for the jurisdiction in which the mobilehome park is located."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Blanca Rubio", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Blanca Rubio\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2238", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2238", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2238&version=20250AB223899INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2238", "note": ""}], "extras": {"impact_clause": "An act to amend Section 798.84 of the Civil Code, relating to mobilehome parks.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:15+00:00", "_id": "a43e0fe2-0f01-11f1-bd68-62084ebb1ff2"}