{"legislative_session": "20252026", "identifier": "AB1907", "title": "California Health Benefit Exchange: automatic health care coverage enrollment.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaHealthBenefitExchange", "automatichealthcarecoverageenrollment"], "abstracts": [{"note": "summary", "abstract": "Existing law creates the California Health Benefit Exchange (Exchange) , also known as Covered California, to facilitate the enrollment of qualified individuals and qualified small employers in qualified health plans as required under the federal Patient Protection and Affordable Care Act. Existing law requires the Exchange to enroll an individual in the lowest cost silver plan or another plan, as specified, upon receiving the individual's electronic account from an insurance affordability program. Existing law requires enrollment to occur before coverage through the insurance affordability program is terminated, and prohibits the premium due date from being sooner than the last day of the first month of enrollment.\n\nThis bill would, commencing July 1, 2027, additionally authorize the Exchange to enroll an individual in the plan in which other members of the individual's household are enrolled, as specified, or the lowest cost plan available to an Indian who is eligible for specified reduced cost sharing, as determined by the Exchange, and would require the Exchange to enroll an individual in any of the plans described above upon receipt of a complete application for an insurance affordability program submitted through the Statewide Automated Welfare System. The bill would require the Exchange to enroll the individual either before coverage through the insurance affordability program is terminated as described above or upon the receipt of a complete application for an insurance affordability program through the Statewide Automated Welfare System as described above.\n\nExisting law requires the Exchange to provide an individual who is enrolled in a plan described above with a notice that includes specified information, including a statement that services received during the first month of enrollment will only be covered by the plan if the premium is paid by the due date.\n\nThis bill would require the Exchange to provide the notice described above prior to the individual's effective date of coverage, and to provide, instead of the statement described above, instructions on how to effectuate coverage in the selected plan, including by paying the premium on or before the due date, or, if there is no premium due, instructions on how to opt into the selected plan."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 15.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Addis", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Addis\"}", "organization_id": null}, {"name": "Bonta", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Bonta\"}", "organization_id": null}, {"name": "Durazo", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Durazo\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1907", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1907", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1907&version=20250AB190799INT", "media_type": "application/pdf"}], "date": "2026-02-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1907", "note": ""}], "extras": {"impact_clause": "An act to amend, repeal, and add Section 100503.4 of the Government Code, relating to the California Health Benefit Exchange.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-16T09:02:19+00:00", "_id": "32fc04ae-0b16-11f1-8107-d26818b831da"}