{"legislative_session": "20252026", "identifier": "AB2120", "title": "School district employees: merit system.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Schooldistrictemployees", "meritsystem"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law requires vacancies in the classified service of a school district that has adopted the merit system to be filled by appointments made from eligible applicants having the first 3 ranks on the applicable eligibility list who are ready and willing to accept the position. Notwithstanding that provision, existing law authorizes, until January 1, 2027, the Los Angeles Unified School District to make an appointment to one of specified classifications of positions, including, among others, an information technology electronic communications technician, to be made from other than the first 3 ranks on the eligibility list if one or more of specified criteria are required for successful job performance of the position filled, in which case existing law requires the appointment to be made from among the highest 3 ranks of eligible candidates on the list who meet the special requirements and are ready and willing to accept the position. Under existing law, any person who willfully or through culpable negligence violates certain provisions that apply to school district merit systems is guilty of a misdemeanor.\n\nThis bill would, for purposes of the above-described provision, remove the classification of information technology electronic communications technician from the list of specified classifications and would extend the Los Angeles Unified School District's authority to make an appointment from other than the first 3 ranks on the eligibility list indefinitely. By extending the operation of a crime, the bill would impose a state-mandated local program.\n\n(2) Existing law requires that when classified employees are subject to layoff for lack of work or lack of funds, the order of layoff within the class be determined by length of service, providing that the employee who has been employed the shortest time in the class, plus higher classes, be laid off first. Existing law requires that reemployment be in order of seniority.\n\nThis bill would, notwithstanding the above-described provisions, authorize the Los Angeles Unified School District to retain a classified employee hired pursuant to specified provisions, without regard to seniority, if the employee's layoff would deprive the district of certain specified qualifications that was the basis for the employee's original employment.\n\n(3) This bill would make legislative findings and declarations as to the necessity of a special statute for the Los Angeles Unified School District.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\n(4) This bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Solache", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Solache\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2120", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2120", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2120&version=20250AB212099INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2120", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 45277.5 and 45308 of the Education Code, relating to school district employees.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:58+00:00", "_id": "40f12afe-0e3a-11f1-a618-2a6200350f1a"}