{"legislative_session": "20252026", "identifier": "AB2289", "title": "Public utilities: telecommunications.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Publicutilities", "telecommunications"], "abstracts": [{"note": "summary", "abstract": "The California Constitution establishes the Public Utilities Commission, which consists of 5 members appointed by the Governor and approved by the Senate. The California Constitution authorizes the commission to establish its own procedures and authorizes a commissioner as designated by the commission to hold a hearing or investigation or issue an order subject to commission approval.\n\nThis bill would require the Governor, in appointing members of the commission, to ensure a diverse composition of commissioners by considering factors that contribute to diversity, as provided. The bill would recodify as a statutory provision the commission's authority to establish its own procedures and the authority of a commissioner to hold a hearing or investigation or issue an order subject to the commission approval. The bill would specify that the recodification only becomes operative if ACA 9 of the 2025–26 Regular Session is approved by the voters, becomes operative, and repeals the corresponding provision in the California Constitution.\n\nExisting law vests the commission with regulatory jurisdiction over public utilities. Existing law defines \"public utility\" to include, among other entities, telephone corporations and telegraph corporations. Existing law defines \"telephone line\" to include all conduits, ducts, poles, wires, cables, instruments, and appliances, and all other real estate, fixtures, and personal property owned, controlled, operated, or managed in connection with or to facilitate communication by telephone.\n\nThis bill would specify that a corporation that is providing telecommunications service, as defined, is a public utility subject to the jurisdiction, control, and regulation of the commission and the Public Utilities Act regarding the provision of that service. The bill would revise the definition of \"telephone line\" to restrict those items specified above to those in connection with or to facilitate voice communication by telephone.\n\nUnder existing law, a violation of the Public Utilities Act or an order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause this bill would expand the definition of \"public utility,\" thereby expanding the scope of a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Boerner", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Boerner\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2289", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2289", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2289&version=20250AB228999INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2289", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 216, 233, and 301 of, and to add Section 1700 to, the Public Utilities Code, relating to public utilities.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:58:01+00:00", "_id": "42b2f138-0e3a-11f1-a618-2a6200350f1a"}