{"legislative_session": "20252026", "identifier": "AB1818", "title": "California State University: employer-employee relations: meeting and conferring.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaStateUniversity", "employer-employeerelations", "meetingandconferring"], "abstracts": [{"note": "summary", "abstract": "Existing law grants to higher education employees the right to form, join, and participate in the activities of employee organizations for purposes of representation on all matters of employer-employee relations and for the purpose of meeting and conferring.\n\n Existing law, for the California State University, prohibits written memoranda reached that require budgetary or curative action by the Legislature or other agencies from being effective unless that action has been taken, and requires an appropriate request for financing or budgetary funding for all state-funded employees or for necessary legislation to be forwarded to the Legislature and the Governor or other funding agencies. Existing law requires the entire memoranda to be referred back to the parties for further meeting and conferring when the memoranda require legislative action and the Legislature or the Governor fail to fully fund the memoranda or take the requisite curative action, except as specified.\n\nThis bill would delete the above-described prohibition and requirements relating to written memoranda of the California State University.\n\nExisting law provides that, for the California State University, the duty to meet and confer in good faith requires the parties to begin negotiations before the adoption of the final budget for the ensuing year sufficiently in advance of the adoption date, and requires the California State University to maintain close liaison with the Department of Finance and the Legislature relative to the meeting and conferring on provisions of the written memoranda that have fiscal ramifications. Existing law requires the Governor to appoint one representative to attend the meeting and conferring and authorizes the Speaker of the Assembly and the Senate Committee on Rules to each appoint one representative to attend the meeting and conferring to advise on the Legislature's views on matters that would require an appropriation or legislative action.\n\nThis bill would specify that those provisions related to the duty to meet and confer in good faith do not relieve the California State University from complying with its obligations under a collectively bargained agreement negotiated with a labor organization and duly ratified by the parties."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 13.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ortega", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ortega\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1818", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1818", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/10/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1818&version=20250AB181899INT", "media_type": "application/pdf"}], "date": "2026-02-10", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1818", "note": ""}], "extras": {"impact_clause": "An act to amend Section 3572 of the Government Code, relating to the California State University.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-14T08:44:46+00:00", "_id": "6a649500-0981-11f1-baff-1a052d2b7fdd"}