{"legislative_session": "20252026", "identifier": "AB2529", "title": "Civil claims: public employees: perjury.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Civilclaims", "perjury", "publicemployees"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Government Claims Act, governs the tort liability and immunity of, and claims and actions against, public entities, officers, and employees.\n\nExisting law defines the pleadings in a civil action as the formal allegations by the parties of their respective claims and defenses for the judgment of the court. Existing law requires the verification of certain civil claims and requires the verification of answers to certain verified complaints. Existing law provides that a person verifying a pleading need not swear to the truth or their belief in the truth of the matters stated therein but may, instead, assert the truth or their belief in the truth of those matters under penalty of perjury.\n\nThis bill would require a civil complaint or cross-complaint filed by an employee or former employee of a public agency seeking monetary damages against the public agency for acts or omissions arising out of or relating to the employment relationship to be verified under penalty of perjury. The bill would require a court to grant a motion to strike the complaint or cross-complaint if the complaint or cross-complaint is not verified by the plaintiff or cross-complainant, as provided.\n\nThis bill would require a claim presented in accordance with the Government Claims Act by an employee or former employee of a public entity seeking monetary damages against the public entity for acts or omissions arising out of or relating to the employment relationship to include a declaration signed by the claimant under penalty of perjury verifying the core factual allegations supporting the claim. The bill would also require public agency to make a report to the appropriate district attorney if the public agency concludes that there is substantial evidence the person who made the claim committed perjury in signing the claim, and would authorize the district attorney to investigate and take action, as appropriate.\n\nBy expanding the crime of perjury, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Johnson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Johnson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2529", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2529", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2529&version=20250AB252999INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2529", "note": ""}], "extras": {"impact_clause": "An act to add Section 448 to the Code of Civil Procedure, and to add Section 945.7 to the Government Code, relating to civil procedure.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:21+00:00", "_id": "a7d81378-0f01-11f1-bd68-62084ebb1ff2"}