{"legislative_session": "20252026", "identifier": "AB883", "title": "California Public Records Act: personal information of elected and appointed officials.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaPublicRecordsAct", "personalinformationofelectedandappointedofficials"], "abstracts": [{"note": "summary", "abstract": "The California Public Records Act requires state and local agencies to make their records available for public inspection, unless an exemption from disclosure applies. That act, among other things, prohibits a state or local agency from publicly posting the home address, telephone number, or both the name and assessor parcel number associated with the home address of any elected or appointed official on the internet without first obtaining the written permission of that individual. The act also makes it a misdemeanor for a person to knowingly post the home address or telephone number of any elected or appointed official, or of the official's residing spouse or child, on the internet, knowing that person is an elected or appointed official and intending to cause imminent great bodily harm or threatening to cause imminent great bodily harm, as provided.\n\nThe act additionally prohibits a person, business, or association from soliciting, selling, or trading on the internet the home address or telephone number of an elected or appointed official with the intent to cause imminent great bodily harm to the official or to any person residing at the official's home address. The act further prohibits a person, business, or association from publicly posting or publicly displaying on the internet the home address or telephone number of any elected or appointed official if that official has made a written demand of that person, business, or association to not disclose the official's home address or telephone number.\n\nThis bill would remove the references in those provisions to the home address, telephone number, name, and assessor's parcel number, and instead prohibit the disclosure of protected information under those provisions. The bill would define the term \"protected information\" to include, among other things, an individual's residential address, telephone number, social security number, or driver's license number. The bill would also remove the requirement that the information be disclosed on the internet for purposes of those provisions. By imposing new duties on local agencies and expanding the definition of a crime, the bill would impose a state-mandated local program.\n\nThis bill would expand the prohibition against publicly posting or publicly displaying the protected information if a written demand has been made to also include a prohibition against selling the protected information and would expand the provisions relating to the written demand to also apply to a verifiable consumer request, as defined. The bill would make related changes.\n\nThis bill would provide that, for purposes of specified provisions described above and certain enforcement provisions, the protections and rights granted to an elected or appointed official extends to an immediate family member of the official who resides with the official, except as specified.\n\nThe California Constitution requires local agencies, for the purpose of ensuring public access to the meetings of public bodies and the writings of public officials and agencies, to comply with a statutory enactment that amends or enacts laws relating to public records or open meetings and contains findings demonstrating that the enactment furthers the constitutional requirements relating to this purpose.\n\nThis bill would make legislative findings to that effect.\n\nExisting constitutional provisions require that a statute that limits the right of access to the meetings of public bodies or the writings of public officials and agencies be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\nThis bill would make legislative findings to that effect.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that with regard to certain mandates no reimbursement is required by this act for a specified reason.\n\nWith regard to any other mandates, this bill would provide that, if the Commission on State Mandates determines that the bill contains costs so mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [{"note": "", "title": "California Public Records Act."}], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2025-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2025-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Referred to Com. on JUD.", "date": "2025-03-24", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on JUD.", "entity_type": "organization", "organization_id": null}]}, {"description": "From committee chair, with author's amendments: Amend, and re-refer to Com. on JUD. Read second time and amended.", "date": "2025-03-24", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["amendment-introduction", "amendment-passage", "reading-1", "reading-2"], "related_entities": []}, {"description": "Re-referred to Com. on JUD.", "date": "2025-03-25", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on JUD.", "entity_type": "organization", "organization_id": null}]}, {"description": "In committee: Set, first hearing. Hearing canceled at the request of author.", "date": "2025-04-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Lowenthal", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Lowenthal\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB883", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB883", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/25 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB883&version=20250AB88399INT", "media_type": "application/pdf"}], "date": "2025-02-19", "classification": ""}, {"note": "03/24/25 - Amended Assembly", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB883&version=20250AB88398AMD", "media_type": "application/pdf"}], "date": "2025-03-24", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB883", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 7928.205, 7928.210, 7928.215, 7928.220, 7928.225, and 7928.230 of, and to add Section 7928.201 to, the Government Code, relating to public records.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2025-12-25T08:43:10+00:00", "_id": "bde6d5b2-e16d-11f0-bae1-3234e5ab6c6a"}