{"legislative_session": "20252026", "identifier": "AB1738", "title": "State Housing Law: remote inspections.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["StateHousingLaw", "remoteinspections"], "abstracts": [{"note": "summary", "abstract": "Existing law, the State Housing Law, establishes statewide construction and occupancy standards for buildings used for human habitation. Existing law requires the building department of every city or county to enforce the provisions of the State Housing Law, the State Building Standards Code, and other specified rules and regulations promulgated pursuant to the State Housing Law pertaining to standards for buildings used for human habitation. Existing law, in the event of nonenforcement of the provisions of the State Housing Law, the State Building Standards Code, and the other rules and regulations promulgated pursuant to the State Housing Law, requires the Department of Housing and Community Development (HCD) to enforce these provisions, as provided. Existing law authorizes an officer, employee, or agent of an enforcement agency to enter and inspect any building or premises whenever necessary to secure compliance with, or prevent a violation of, any provision of the State Housing Law, the building standards published in the State Building Standards Code, and other rules and regulations promulgated pursuant to the provisions of the State Housing Law. Existing law provides certain immunities to a public entity or employee immunity relative to an inspection or license, as provided.\n\nThis bill would require a city, including a charter city, county, or city and county to offer a homeowner the option of requesting remote inspections for all or a subset of an inspection required by a building permit for specified works in one- or 2-family dwelling units, by July 1, 2027, as provided. The bill would apply the above-described immunities to remote inspections. The bill would authorize these local agencies, at their discretion, to set up a process to perform onsite audits to confirm that a homeowner accurately represented the work subject to the remote inspection and to temporarily ban the homeowner from using the remote inspection if the homeowner is found to have willfully misrepresented the work, as provided. The bill would require these local agencies, by July 1, 2027 and annually thereafter, to provide a report to HCD that confirms that these local agencies have implemented remote inspections in compliance with these provisions and authorize HCD to post these reports on its internet website. The bill would authorize HCD to request information from these local agencies in order to assess whether these local agencies are in compliance with these provisions, to post this information on the HCD's internet website, and to take appropriate enforcement action to ensure compliance with these provisions. By imposing new duties on local agencies, the bill would impose a state-mandated local program.\n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 8.", "date": "2026-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Carrillo", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Carrillo\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1738", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1738", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/05/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1738&version=20250AB173899INT", "media_type": "application/pdf"}], "date": "2026-02-05", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1738", "note": ""}], "extras": {"impact_clause": "An act to add Section 17970.9 to the Health and Safety Code, relating to housing.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-08T08:48:43+00:00", "_id": "f9168882-04ca-11f1-9308-1a8922ae3534"}