{"legislative_session": "20252026", "identifier": "AB2126", "title": "Community care facilities: criminal background exemptions.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Communitycarefacilities", "criminalbackgroundexemptions"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Medi-Cal program, which is administered by the State Department of Health Care Services and under which qualified low-income persons receive health care benefits. The Medi-Cal program is, in part, governed and funded by federal Medicaid program provisions. Existing law establishes a schedule of benefits under the Medi-Cal program and provides for various services, including various behavioral and mental health services that are rendered by Medi-Cal enrolled providers.\n\nExisting law requires the department, subject to any necessary federal waivers or approvals, to establish statewide requirements for counties or their representatives to use in developing certification programs for the certification of peer support specialists, who are individuals who self-identify as having lived experience with the process of recovery from mental illness, substance use disorder, or both.\n\nExisting law requires the State Department of Social Services to license and regulate community care facilities, residential care facilities for persons with chronic, life-threatening illness, residential care facilities for the elderly, and childcare centers. Existing law requires the department to obtain a criminal record for all applicants for licenses for these facilities and services and specified other employees and officers of these facilities. Existing law requires the department to issue an exemption from disqualification to certain applicants who have been convicted of an offense, if the individual's state and federal criminal history information independently supports a reasonable belief that the applicant is of present good character necessary to justify the granting of an exemption, as specified. Existing law authorizes the department to use its discretion in evaluating a an individual for the purposes of making an exemption decision, as necessary to protect the health and safety of a child.\n\nThis bill would add to the definition of a peer support specialist to include a current or former foster youth based on their experience of trauma, recovery, and system navigation. The bill would require the department to issue an exemption from disqualification for current or former foster youth who have been convicted of certain offenses that occurred prior to the individual reaching 21 years of age and the youth will be employed in a peer support capacity and not a caregiving capacity and would not require any additional evidentiary showing."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Elhawary", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Elhawary\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2126", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2126", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2126&version=20250AB212699INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2126", "note": ""}], "extras": {"impact_clause": "An act to amend Section 1522 of the Health and Safety Code, and Section 14045.12 of the Welfare and Institutions Code, relating to community care facilities.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-19T09:01:02+00:00", "_id": "83df04a4-0d71-11f1-814c-2ab210762532"}