{"legislative_session": "20252026", "identifier": "AB2316", "title": "School facilities: Charter School Facilities Program: undue financial burden.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CharterSchoolFacilitiesProgram", "Schoolfacilities", "unduefinancialburden"], "abstracts": [{"note": "summary", "abstract": "The Leroy F. Greene School Facilities Act of 1998 provides for the adoption of rules, regulations, and procedures, under the administration of the Director of General Services, for the allocation of state funds by the State Allocation Board for the construction and modernization of public school facilities. Existing law establishes the Charter Schools Facilities Program within the Leroy F. Greene School Facilities Act of 1998 to provide funding to qualifying entities for the purpose of establishing school facilities for charter school pupils. Existing law requires that a 50% matching share be provided by charter schools applying for facilities funding under the program. Existing law requires California School Finance Authority, in consultation with the board, to adopt regulations for the program, including, among other regulations, the process for determining the manner in which the applicant will pay its local matching share, including the method for determining lease payments to be made in lieu of the local matching share.\n\nThis bill would, commencing January 1, 2027, if the 50% local share matching obligation or lease payments would result in the applicant charter school suffering an undue financial burden, require the authority to notify the board and authorize the board to reduce the 50% local share matching obligation or lease payments, and correspondingly increase the grant amount, as necessary for the school to reach a reasonable level of debt service. The bill would require the authority, in consultation with the board, to adopt regulations for that purpose."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Hoover", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Hoover\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2316", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2316", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2316&version=20250AB231699INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2316", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 17078.54 and 17078.57 of the Education Code, relating to school facilities.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:58:01+00:00", "_id": "42f677a0-0e3a-11f1-a618-2a6200350f1a"}