{"legislative_session": "20252026", "identifier": "AB748", "title": "Single-family and multifamily housing units: preapproved plans.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Single-familyandmultifamilyhousingunits", "preapprovedplans"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Planning and Zoning Law, provides for the adoption and administration of zoning laws, ordinances, rules and regulations by counties and cities and the implementation of those general plans as may be in effect in those counties or cities. In that regard, existing law requires each local agency, by January 1, 2025, to develop a program for the preapproval of accessory dwelling unit plans.\n\nThis bill would require each local agency, as defined, to develop a program for the preapproval of single-family and multifamily residential housing plans, whereby the local agency accepts single-family and multifamily plan submissions for preapproval and approves or denies the preapproval applications, as specified. The bill would require a large jurisdiction, as defined, to develop this program by July 1, 2027, and a small jurisdiction, as defined, to develop a program by January 1, 2029. The bill would require the local agency to post preapproved single-family or multifamily residential housing plans and the contact information of the applicant on the local agency's internet website.\n\n This bill would require a local agency to either approve or deny ministerially an application for a single-family or multifamily residential housing unit within 30 days if the lot meets certain conditions and the application utilizes specified plans that have been preapproved by the local agency or that are identical to a plan used in an application approved by the local agency. The bill would prohibit the preapproval program from applying to single-family or multifamily residential housing plans intended for use in certain communities and developments, as specified.\n\nExisting law requires each county and each city to adopt a comprehensive, long-term general plan for the physical development of the county or city, and specified land outside its boundaries, that includes, among other specified mandatory elements, a housing element. That law requires the planning agency of a city or county to provide by April 1 of each year an annual report to, among other entities, the Office of Land Use and Climate Innovation. Existing law requires the annual report to include, among other things, the city's or county's progress in meeting its share of regional housing needs, as specified.\n\nExisting law, the California Environmental Quality Act (CEQA) , requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of, an environmental impact report on a project that it proposes to carry out or approve that may have a significant effect on the environment. CEQA does not apply to the approval of ministerial projects.\n\nTo the extent that the ministerial review process established by the bill would apply to final, discretionary approval of an application for a single-family or multifamily housing unit, the bill would exempt those projects from CEQA.\n\nThis bill, beginning on April 1, 2028, for large jurisdictions and beginning on April 1, 2030, for small jurisdictions, would require the local agency to include in its annual report the number of units of residential housing that are approved using a preapproved housing plan pursuant to this act.\n\nBy imposing new duties on local agencies with regard to developing a preapproval program and its annual report, the bill would create a state-mandated local program.\n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [{"note": "", "title": "Commissioner of Financial Protection and Innovation: annual report."}], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2025-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2025-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Referred to Coms. on H. & C.D. and L. GOV.", "date": "2026-01-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Coms. on H. & C.D. and L. GOV.", "entity_type": "organization", "organization_id": null}]}, {"description": "From committee chair, with author's amendments: Amend, and re-refer to Com. on H. & C.D. Read second time and amended.", "date": "2026-01-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["amendment-introduction", "amendment-passage", "reading-1", "reading-2"], "related_entities": []}, {"description": "Re-referred to Com. on H. & C.D.", "date": "2026-01-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on H. & C.D.", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Harabedian", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Harabedian\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB748", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB748", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/25 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB748&version=20250AB74899INT", "media_type": "application/pdf"}], "date": "2025-02-18", "classification": ""}, {"note": "01/05/26 - Amended Assembly", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB748&version=20250AB74898AMD", "media_type": "application/pdf"}], "date": "2026-01-05", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB748", "note": ""}], "extras": {"impact_clause": "An act to add Section 65852.29 to the Government Code, relating to housing.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-07T08:43:29+00:00", "_id": "f0b4b2ca-eba4-11f0-862e-ce04468ca6b3"}