{"legislative_session": "20252026", "identifier": "AB1613", "title": "Vehicles: off-highway vehicle safety.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Vehicles", "off-highwayvehiclesafety"], "abstracts": [{"note": "summary", "abstract": "The Off-Highway Motor Vehicle Recreation Act of 2003 creates the Off-Highway Motor Vehicle Recreation Commission and the Division of Off-Highway Motor Vehicle Recreation within the Department of Parks and Recreation. The act gives the division certain duties and responsibilities, including adopting courses of instruction in off-highway motor vehicle safety, operation, and principles of environmental preservation, as specified. Existing law establishes the Off-Highway Vehicle Trust Fund, with specified percentages of these revenues to be available, upon appropriation, for various purposes related to off-highway vehicles. \n\nThis bill would establish the California Off-Highway Vehicle Safety and Stewardship Program. The bill would require the division, in conjunction with the Department of Parks and Recreation, to convene a stakeholder group to develop an off-highway vehicle safety and stewardship course on or before June 30, 2027, as specified. The bill would require the stakeholder group to prepare and submit a consensus report on recommendations on what to include in the course to the deputy director of the division on or before May 1, 2028. The bill would require the division to develop and implement the California Off-Highway Vehicle Safety and Stewardship Course on or before January 1, 2029, based on the stakeholder group's report. The bill would require the course to cover specified topics, including principles of safe operation and the use of appropriate safety gear. The bill would authorize the division to contract with outside vendors to develop the course and to offer the course online, as specified. The bill would authorize the division to update the course curriculum as it deems necessary. The bill would require the division to evaluate the off-highway vehicle safety and responsibility education program of other states to determine whether to offer reciprocity to individuals who have completed those programs in lieu of completing the course. The bill would require the division to issue California Off-Highway Vehicle Safety and Stewardship operator cards to each person who successfully completes the course. The bill would authorize the division to set fees for the above-described course and operator card to cover the reasonable costs of carrying out the program. The bill would direct these fees to be deposited into the Off-Highway Vehicle Trust Fund.\n\nOn and after January 1, 2029, the bill would prohibit an operator of an off-highway vehicle who is 16 years of age or older from operating an off-highway vehicle unless they have an operator card or proof of completion of an approved reciprocal program in their possession, except as specified. The bill would also prohibit a child 15 years of age or younger from operating an off-highway vehicle without the supervision of a parent or other supervising adult who is in possession of an operator card or proof of completion of an approved reciprocal program. The bill would require an operator to present their operator card or proof of completion to law enforcement personnel upon request. The bill would make a violation of these provisions an infraction punishable by a requirement to successfully complete the California Off-Highway Vehicle Safety and Stewardship Course and a fine of $100, $250, or $500, as specified. The bill would specify that a violation of these provisions shall not result in a violation point count on a person's driving record. Because a violation of the above-described provisions would be a crime, this bill would create a state-mandated local program. \n\nExisting law requires the Off-Highway Motor Vehicle Recreation Commission to prepare and submit a program report to the Governor and the appropriate policy and fiscal committees of each house of the Legislature every 3 years on specified topics related to off-highway motor vehicle recreation.\n\nThe bill would require the division to evaluate the efficacy of the course, as specified, and to include the results of the evaluation in the program report described above.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 21.", "date": "2026-01-22", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Wilson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Wilson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1613", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1613", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/21/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1613&version=20250AB161399INT", "media_type": "application/pdf"}], "date": "2026-01-21", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1613", "note": ""}], "extras": {"impact_clause": "An act to amend Section 5090.24 of the Public Resources Code, and to add Chapter 9 (commencing with Section 38610) to Division 16.5 of the Vehicle Code, relating to vehicles.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-01T08:46:35+00:00", "_id": "83cd4276-ff4a-11f0-a5b2-56a1b7534754"}