{"legislative_session": "20252026", "identifier": "AB2014", "title": "Evidence: admissibility.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Evidence", "admissibility"], "abstracts": [{"note": "summary", "abstract": "Existing law permits a court to exclude evidence if its probative value is substantially outweighed by specified factors, including the probability that its admission will create substantial danger of undue prejudice. Existing law permits a court to hear and determine the question of admissibility of evidence out of the presence or hearing of the jury. Existing law requires a court, in a criminal proceeding where a party seeks to admit as evidence a form of creative expression, to consider specified factors when balancing the probative value of that evidence against the substantial danger of undue prejudice, as specified.\n\nThis bill would require the court, in a criminal proceeding where a party seeks to admit evidence or make an argument that is likely to trigger gender-based stereotypes, to also consider specified factors when balancing the probative value of that evidence against the substantial danger of undue prejudice.\n\nThe bill would require a court, in making this analysis, to consider that the probative value of that evidence or argument is minimal unless it meets specified factors. The bill would also require the court to consider that undue prejudice includes, among other things, the possibility that the trier of fact will rely on gender-based stereotypes related to sexuality, parenting, gender expression, romantic relationships, appearance, or assumptions about a person's emotional or intuitive nature.\n\nThe bill would require the court to consider, in addition to any relevant evidence offered by either party, credible testimony or research demonstrating that the evidence risks introducing gender bias at such hearings as well as any evidence to rebut such research or testimony. The bill would require a court to determine the admissibility of this evidence in a hearing outside the presence and hearing of the jury, and state on the record the court's ruling and reasoning therefor.\n\nThe California Constitution provides for the Right to Truth-in-Evidence, which requires a 2/3 vote of the Legislature to exclude any relevant evidence from any criminal proceeding, as specified.\n\nBecause this bill may exclude from a criminal action evidence that would otherwise be admissible, it requires a 2/3 vote of the Legislature.\n\nExisting law authorizes every person who is unlawfully imprisoned or restrained of their liberty to prosecute a writ of habeas corpus to inquire into the cause of that imprisonment or restraint. Existing law also authorizes a writ of habeas corpus to be prosecuted on the basis that competent and substantial expert testimony relating to intimate partner battering and its effects was not presented to the trier of fact at the trial court proceedings and is of such substance that, had the competent and substantial expert testimony been presented, there is a reasonable probability, sufficient to undermine confidence in the judgment of conviction or sentence, that the result of the proceedings would have been different.\n\nThis bill would additionally authorize a writ of habeas corpus to be prosecuted on the basis that gender-biased evidence or argument was admitted or relied upon by the prosecution at trial in a manner that created a reasonable probability that the outcome would have been different if such evidence was not admitted or argument offered."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-17", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 20.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Elhawary", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Elhawary\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2014", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2014", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/17/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2014&version=20250AB201499INT", "media_type": "application/pdf"}], "date": "2026-02-17", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2014", "note": ""}], "extras": {"impact_clause": "An act to add Section 352.3 to the Evidence Code, and to amend Section 1473.5 of the Penal Code, relating to evidence.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-19T09:01:00+00:00", "_id": "82d4a910-0d71-11f1-814c-2ab210762532"}