{"legislative_session": "20252026", "identifier": "AB2474", "title": "Office of Emergency Services: public alert and early warning software: master contract.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["OfficeofEmergencyServices", "mastercontract", "publicalertandearlywarningsoftware"], "abstracts": [{"note": "summary", "abstract": "Existing law, the California Emergency Services Act, establishes the Office of Emergency Services (OES) within the office of the Governor, and sets forth its powers and duties, including responsibility for addressing natural, technological, or manmade disasters and emergencies, including activities necessary to prevent, respond to, recover from, and mitigate the effects of emergencies and disasters to people and property. \n\nExisting law requires OES, in coordination with all interested state agencies with designated response roles in the state emergency plan and interested local emergency management agencies, to jointly establish by regulation a standardized emergency management system for use by all emergency response agencies, as specified. The act requires each local agency, in order to be eligible for any funding of response-related costs under disaster assistance programs, to use the standardized emergency management system to coordinate multiple-jurisdiction or multiple-agency operations, except that a local agency is eligible for repair, renovation, or any other nonpersonnel costs resulting from an emergency.\n\nThis bill would require OES, on or before July 1, 2027, to enter into a statewide master contract for the creation of a public alert and early warning software that is capable of supporting interoperable public safety alerting across state, regional, and local governmental entities. The bill would require the public alert and early warning software, among other requirements, to be interoperable across state, regional, and local governmental entities, and to be created and ready for use by January 1, 2028.\n\nThe bill would require a city or county that issues public safety alerts, on and after January 1, 2028, to utilize the public alert and early warning software. The bill would specify, among other things, that it is the primary responsibility of the public emergency warning system operator in each city or county to send out emergency alerts to their residents. By imposing new duties on local officials, this bill would create a state-mandated local program.\n\nExisting law requires OES, at least annually, through its California Specialized Training Institute and with involvement of representatives from the access and functional needs community, as specified, to develop an alert and warning training that includes certain information, including the evaluation, purchase, and operation of federal Wireless Emergency Alerts (WEA) and federal Emergency Alert System (EAS) equipment and software, as specified.\n\nThis bill would require the next annual development of an alert and warning training on or after January 1, 2028, to include the public alert and early warning software created pursuant to the bill's provisions.\n\nThe bill would include findings and declarations relating to its provisions.\n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Committee on Emergency Management", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Committee on Emergency Management\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2474", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2474", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2474&version=20250AB247499INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2474", "note": ""}], "extras": {"impact_clause": "An act to amend Section 8593.7 of, and to add Section 8607.05 to, the Government Code, relating to emergency services.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:19+00:00", "_id": "a724ed0c-0f01-11f1-bd68-62084ebb1ff2"}