{"legislative_session": "20252026", "identifier": "SB1273", "title": "Alcoholic beverages: tied-house restrictions: wine instructional events and promotional lectures: video advertisements.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Alcoholicbeverages", "tied-houserestrictions", "videoadvertisements", "wineinstructionaleventsandpromotionallectures"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Alcoholic Beverage Control Act, which is administered by the Department of Alcoholic Beverage Control, regulates the application, issuance, and suspension of alcoholic beverage licenses. Existing law, known as tied-house restrictions, generally prohibits a manufacturer, winegrower, manufacturer's agent, rectifier, California winegrower's agent, distiller, bottler, importer, and wholesaler, and any officer, director, or agent of any of those persons, from giving or lending money or a thing of value to a person operating, owning, or maintaining any on-sale premises where alcoholic beverages are sold. The law provides certain exceptions to this prohibition if specified requirements are met.\n\nTied-house restrictions permit a winegrower, winegrower's agent, wine importer, or their director, partner, officer, agent, or representative to conduct or participate in, and serve wine at, an instructional event for consumers held at a retailer's premises if specified conditions are met. In this regard, specified information, pictures, illustrations, and depictions of the retailer's premises, personnel, and customers may be listed in advertisements for the event if the pictures, illustrations, or depictions are relatively inconspicuous in relation to the advertisement as a whole and video is not permitted.\n\nThis bill would also allow the advertisement to contain videos up to 60 seconds long. The bill would remove the requirement that the specified information and any pictures, illustrations, or depictions be relatively inconspicuous in relation to the advertisement as a whole.\n\nTied-house restrictions permit specified information of a winegrower, wine importer, or winegrower's agent licensee, the brand names of wine being featured, and the time, date, location, and other identifying information of a wine promotional lecture at retail premises to be listed in advance of the event in an advertisement of the off-sale or on-sale retail licensee.\n\nThis bill would also authorize the advertisement to contain pictures, illustrations, videos, or depictions of the winegrower, wine importer, or winegrower's agent."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Cabaldon", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Cabaldon\"}", "organization_id": null}, {"name": "McNerney", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"McNerney\"}", "organization_id": null}, {"name": "Aguiar-Curry", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Aguiar-Curry\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1273", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1273", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1273&version=20250SB127399INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1273", "note": ""}], "extras": {"impact_clause": "An act to amend Section 25503.4 of the Business and Professions Code, relating to alcoholic beverages.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:04+00:00", "_id": "ec139156-0fca-11f1-9ce2-72e66fa16e68"}