{"legislative_session": "20252026", "identifier": "AB2083", "title": "Moreno Valley-Perris Childcare Special District.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["MorenoValley-PerrisChildcareSpecialDistrict"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Cortese-Knox-Hertzberg Local Government Reorganization Act of 2000, provides the sole and exclusive authority and procedure for the initiation, conduct, and completion of changes of organization and spheres of influence for cities and special districts, including incorporation of cities and formation of districts. The act establishes a local agency formation commission in each county with various powers and duties, including to make certain determinations regarding, and to review and approve or disapprove, proposals for changes or organization or reorganization, as specified.\n\nThis bill, the Moreno Valley-Perris Childcare Special District Act, would establish the Moreno Valley-Perris Childcare Special District for the purpose of, among other things, expanding childcare capacity and access through the development, coordination, and operation of universal childcare programs. The bill would establish the district boundaries as the incorporated area of the City of Moreno Valley, the incorporated area of the City of Perris, and the officially adopted spheres of influence for each city as determined and updated by the County of Riverside local agency formation commission (LAFCO) . The bill would establish a 5-member board to govern the district and specify that certain entities, including the City of Moreno Valley and the City of Perris, are charged with each appointing a member to the board. The bill would specify the duties of the board, including, among others, the duty to develop and submit a plan of services to LAFCO that details the scope of childcare services, the hours of operation, the governance and management structure, and funding sources and sustainability. The bill would also outline various powers of the board, including the authority to hire a general manager to oversee daily operations, and powers of the district, including the authority to designate, contract with, or directly operate child daycare facilities. The bill would authorize initial funding for the district to provided by any of the entities authorized to appoint a board member and would require the board to call and conduct an election, consistent with applicable law, to seek voter approval for funding mechanisms necessary to formally establish and operate the district. By establishing a new special district and imposing new duties on that district, this bill would impose a state-mandated local program.\n\nThis bill would make legislative findings and declarations as to the necessity of a special statute for Moreno Valley-Perris Childcare Special District.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Jackson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Jackson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2083", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2083", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2083&version=20250AB208399INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2083", "note": ""}], "extras": {"impact_clause": "An act to add Chapter 35 (commencing with Section 10493) to Part 1.8 of Division 9 of the Welfare and Institutions Code, relating to childcare.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:57+00:00", "_id": "40937bb6-0e3a-11f1-a618-2a6200350f1a"}