{"legislative_session": "20252026", "identifier": "AB1699", "title": "Good Fire Act: Prescribed Fire Liability Pilot Program: burn bosses: California Environmental Quality Act.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill", "appropriation"], "subject": ["CaliforniaEnvironmentalQualityAct", "GoodFireAct", "PrescribedFireLiabilityPilotProgram", "burnbosses"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes, until January 1, 2028, the Prescribed Fire Liability Pilot Program, to be administered by the Department of Forestry and Fire Protection, to increase the pace and scale of the use of prescribed fire and cultural burning and to reduce barriers for conducting prescribed fires and cultural burning. Existing law creates the Prescribed Fire Claims Fund in the State Treasury to support coverage for losses from prescribed fires and cultural burning by nonpublic entities, such as cultural fire practitioners, private landowners, and nongovernmental entities. Under existing law, moneys in the fund are under the control of the department, and the department or a contracted third-party administrator is authorized to direct payments for claims from the fund, consistent with specified guidelines adopted by the department. These guidelines include, among other things, (1) a requirement that an eligible claim relate to either a prescribed fire conducted or supervised by a burn boss, as defined, or a cultural burn conducted or supervised by a cultural fire practitioner, and (2) a requirement that a claim shall not be paid from the fund unless the department reviewed and approved a burn plan before the prescribed fire or cultural burning. Existing law requires, upon order of the Department of Finance, the $20,000,000 appropriated to the Department of Forestry and Fire Protection by the Legislature in the Budget Act of 2021 be transferred into the fund, and provides that all moneys deposited or transferred into the fund be continuously appropriated to the department for these purposes.\n\nBy Executive Order N-35-25, Governor Gavin Newsom suspended the limitation on public and governmental agencies enrolling in the Prescribed Fire Liability Pilot Program to the extent that the limitation would prohibit resource conservation districts and volunteer fire departments or districts from such enrollment.\n\nThis bill would establish the Good Fire Act, which would indefinitely extend the Prescribed Fire Liability Program. The bill would also expand program eligibility by changing the entities who may receive coverage for losses from prescribed fires and cultural burning from nonpublic entities to individuals and entities other than the department or the federal government, as provided. By extending the term of a continuous appropriation and authorizing the expenditure of continuously appropriated funds for new purposes, the bill would make an appropriation.\n\nThis bill would eliminate the requirement for department approval for a plan reviewed and approved by a burn boss. The bill would also require the guidelines to include methods for prioritizing broadcast burns and burns by non-public individuals or entities or California Native American tribes in the event the fund is oversubscribed.\n\nExisting law requires the State Fire Marshal, with the involvement of the Statewide Training and Education Advisory Committee, to develop a curriculum for, or amend into an existing curriculum, a certification program for burn bosses who possess authority to engage in a prescribed burning operation and to enter into the necessary contracts related to a prescribed burning operation. Existing law requires this curriculum to provide for the initial certification as well as the continuing education of burn bosses. Under existing law, specified civil liability protections and eligibility for claims from the Prescribed Fire Claims Fund extend to prescribed burns that, among other things, are reviewed and approved by a burn boss certified pursuant to these provisions, as provided.\n\nThis bill would require, as part of the continuing education of burn bosses, the State Fire Marshal to require recertification no sooner than every 3 years. The bill would also require the department, in consultation with the Statewide Training and Education Advisory Committee, to consider methods to increase the pool of available instructors for the certification program, including the use of non-department instructors. The bill would require the department to develop a mechanism to allow specified individuals to be designated as a burn boss. The bill would authorize these individuals certified pursuant to this process to use the above-described recertification process to maintain currency.\n\nExisting law authorizes an entity that owns or controls brush-covered land, forest lands, woodland, grassland, shrubland, or a combination of those types of land within a state responsibility area to apply to the Department of Forestry and Fire Protection for permission to use prescribed burning for certain public purposes. Existing law requires the department, upon receipt of an application, to inspect the land in company with the applicant to determine whether a permit shall be granted, as provided.\n\nBy Executive Order N-35-25, Governor Gavin Newsom suspended the above-described requirement that the department conduct a site visit or inspection before issuing a state burn permit for projects undertaken by burn bosses or cultural fire practitioners.\n\nThis bill would authorize the department to waive the inspection requirement or modify the standard precautions for an application submitted by specified individuals.\n\nThe California Environmental Quality Act (CEQA) requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of an environmental impact report on a project that it proposes to carry out or approve that may have a significant effect on the environment or to adopt a negative declaration if it finds that the project will not have that effect. CEQA also requires a lead agency to prepare a mitigated negative declaration for a project that may have a significant effect on the environment if revisions in the project would avoid or mitigate that effect and there is no substantial evidence that the project, as revised, would have a significant effect on the environment.\n\nExisting law exempts from CEQA specified wildfire risk reduction projects, including, among other projects, projects consisting of a prescribed fire or fuel reduction to reduce wildfire risk by reestablishing the fire return interval appropriate to the ecosystem for biodiversity or other benefits, excluding projects located on coastal sage scrub habitat or any other sensitive habitat.\n\nBy Executive Order N-35-25, Governor Gavin Newsom suspended the requirements of CEQA as applied to the Department of Forestry and Fire Protection to the extent necessary for the department to assist local agencies and beneficial fire practitioners to complete beneficial fire projects that limit dangerous wildfire conditions to the greatest extent feasible.\n\nThis bill would exempt from CEQA those actions taken by the department to assist in the implementation of prescribed fire or cultural burning projects that do not otherwise require compliance with CEQA.\n\nExisting law establishes various grant programs for purposes of wildfire prevention.\n\nThis bill would prohibit a state agency, department, board, or commission that has awarded grant funds or other sources of funding to an awardee, who is paying individuals engaged in the preparation for or implementation of beneficial fire projects from those funds, from restricting overtime or double rates of pay in the disbursement of those funds, as provided."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-03", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 6.", "date": "2026-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Rogers", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Rogers\"}", "organization_id": null}, {"name": "Hadwick", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Hadwick\"}", "organization_id": null}, {"name": "Caloza", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Caloza\"}", "organization_id": null}, {"name": "Connolly", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Connolly\"}", "organization_id": null}, {"name": "Gallagher", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Gallagher\"}", "organization_id": null}, {"name": "Wallis", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Wallis\"}", "organization_id": null}, {"name": "Arreguín", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Arregu\\u00edn\"}", "organization_id": null}, {"name": "Grayson", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Grayson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1699", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1699", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/03/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1699&version=20250AB169999INT", "media_type": "application/pdf"}], "date": "2026-02-03", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1699", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 4477, 4493, and 4500 of, to add Sections 4497.3 and 21080.49.1 to, and to repeal Section 4503 of, the Public Resources Code, relating to wildfire, and making an appropriation therefor.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-14T08:44:44+00:00", "_id": "694c379a-0981-11f1-baff-1a052d2b7fdd"}