{"legislative_session": "20252026", "identifier": "AB2510", "title": "CalWORKs.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CalWORKs"], "abstracts": [{"note": "summary", "abstract": "(1) Under existing law, if the federal government provides funds for the care of a needy relative with whom a needy child is living, aid to the child for any month includes aid to meet the needs of that relative, except as prescribed. Existing law establishes the California Work Opportunity and Responsibility to Kids (CalWORKs) program, under which each county provides cash assistance and other benefits to qualified low-income families using federal, state, and county funds. Existing law provides that the parent or parents are to be considered living with the needy child for a period of up to 6 months, or for a time period as determined by the State Department of Social Services, of the needy child's absence from the family assistance unit, and that the parents are eligible for CalWORKs aid and childcare services if specified conditions are met, including, among others, that the child has been removed from the parent or parents and that the family was receiving aid under when the child was removed. Existing law requires all applicants for or recipients of CalWORKs to ensure and provide documentation that each child in the assistance unit who is not required to be enrolled in school has received all age-appropriate immunizations, as specified.\n\nThis bill would make technical changes to the provisions regarding a parent's eligibility to receive aid as if the child or children were living with them. The bill would also specify that those provisions do not require all children to be removed from the parent or parents or that some, but not all, of the children have reunified. The bill would make these provisions that authorize the provision of aid and child care services, as specified, operative on July 1, 2027, or when the Statewide Automated Welfare System can perform the necessary automation, whichever is later, and would prohibit the implementation of these provisions from resulting in a retroactive payment or underpayment. The bill would exempt a family participating in a reunification case plan from specified immunization requirements. To the extent that this bill would expand county responsibilities under the CalWORKs program, this bill would impose a state-mandated local program.\n\n(2) Existing law generally requires a recipient of CalWORKs to participate in welfare-to-work activities as a condition of eligibility. Existing law requires the recipient and the county welfare department to enter into a written welfare-to-work plan that includes the activities and services that will move the individual into employment. Existing departmental guidance strongly encourages, for individuals receiving benefits as described in paragraph (1) , counties to use a CalWORKs family reunification plan, which is the case plan developed by the county child welfare services agency for the provision of services to those individuals, in lieu of the welfare-to-work plan.\n\nThis bill would instead authorize, for those individuals, either (A) a case plan, as specified, to serve as a CalWORKs family reunification plan or (B) a jointly developed child welfare services and CalWORKs welfare-to-work plan to serve as the CalWORKs family reunification plan, both of which would satisfy the requirement to have a welfare-to-work plan. The bill would also exempt an individual receiving aid as described above, when that individual is cooperating in the development of, or participating in, a reunification case plan, from the requirement to participate in welfare-to-work activities as a condition of eligibility. To the extent that this bill would expand county responsibilities under the CalWORKs program, this bill would impose a state-mandated local program.\n\n(3) Under existing law, a recipient of CalWORKs aid is required to assign to the county any rights to support from any other person that the recipient may have, on their behalf, or on behalf of any other family member for whom the recipient is receiving aid, not exceeding the total amount of CalWORKs cash assistance provided to the family. Existing law requires a specified amount of child support collected in a month in payment of the required child support obligation for that month to be paid to a recipient of CalWORKs aid, and prohibits this amount from being considered income or resources of the recipient family or being deducted from the amount of aid to which the family would otherwise be eligible.\n\nThis bill would provide that if an applicant or recipient of CalWORKs is not eligible for federal assistance and who is or will be receiving aid as described above that is fully state funded, the applicant or recipient is not required to assign those support rights. The bill would also prohibit child support payments received by an applicant for or recipient of CalWORKs from constituting income for the purposes of determining eligibility for CalWORKs.\n\n(4) Existing law continuously appropriates moneys from the General Fund to defray a portion of county costs under the CalWORKs program.\n\nThis bill would provide that the continuous appropriation would not be made for the purposes of implementing the bill.\n\n(5) The California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Arambula", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Arambula\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2510", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2510", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2510&version=20250AB251099INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2510", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 11203, 11320.3, and 11325.21 of, and to add Sections 11251 and 11477.08 to, the Welfare and Institutions Code, relating to CalWORKs.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:20+00:00", "_id": "a7a045f6-0f01-11f1-bd68-62084ebb1ff2"}