{"legislative_session": "20252026", "identifier": "AB2193", "title": "Autonomous vehicles.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Autonomousvehicles"], "abstracts": [{"note": "summary", "abstract": "Existing law authorizes the operation of an autonomous vehicle on public roads for testing purposes by a driver who possesses the proper class of license for the type of vehicle operated if specified requirements are satisfied. Existing law prohibits the operation of an autonomous vehicle on public roads until the manufacturer submits an application to the Department of Motor Vehicles, as specified, and that application is approved. Existing law requires the department to adopt regulations setting forth requirements for the submission and approval of an application, including, among other things, any testing, equipment, and performance standards the department concludes are necessary to ensure the safe operation of autonomous vehicles on public roads, as specified.\n\nExisting law authorizes peace officers, as defined, to issue notices of autonomous vehicle noncompliance upon observing an alleged violation of the Vehicle Code or upon observing an alleged violation of a local traffic ordinance adopted pursuant to the Vehicle Code by an autonomous vehicle while the autonomous technology is engaged.\n\nThis bill would additionally require that if an autonomous vehicle commits a traffic violation pursuant to the Vehicle Code, the traffic citation be issued to the registered owner of the autonomous vehicle if the autonomous vehicle does not have a person in the driver's seat. The bill would require the traffic citation to be issued to the driver of the autonomous vehicle if the autonomous vehicle has a person in the driver's seat, regardless of whether or not the autonomous technology is engaged, unless the autonomous vehicle is operating as a permitted passenger transport service and the person in the driver's seat is a customer who is not in control of the vehicle and the traffic violation is committed while the autonomous technology is engaged, in which case the citation would be issued to the registered owner. The bill would authorize the citations to be issued by mail and authorize the holder of the testing permit or deployment permit to contest a citation or penalty issued pursuant to these provisions under the procedures of the Vehicle Code."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ta", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ta\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2193", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2193", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2193&version=20250AB219399INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2193", "note": ""}], "extras": {"impact_clause": "An act to amend Section 38750 of the Vehicle Code, relating to vehicles.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:14+00:00", "_id": "a3ad1000-0f01-11f1-bd68-62084ebb1ff2"}