{"legislative_session": "20252026", "identifier": "AB2162", "title": "Housing: county funding allocations: nonminor dependents and young adults.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Housing", "countyfundingallocations", "nonminordependentsandyoungadults"], "abstracts": [{"note": "summary", "abstract": "Existing law, subject to an appropriation in the annual Budget Act, requires the Department of Housing and Community Development to provide, under the Transitional Housing Program, funding to counties for allocation to child welfare services agencies to help young adults who are 18 to 24 years of age, inclusive, secure and maintain housing, with priority given to young adults formerly in the state's foster care or probation systems. Existing law, subject to an appropriation in the annual Budget Act, also requires the department to allocate funding to counties under the Housing Navigation and Maintenance Program to help young adults who are 18 to 24 years of age, inclusive, secure and maintain housing, with priority given to young adults currently or formerly in the foster care system.\n\nThis bill would extend the age of eligibility for the Housing Navigation and Maintenance Program to young adults who are 18 to 28 years of age, inclusive, and would, instead, give priority to nonminor dependents and young adults formerly in the state's foster care or probation system, as defined. The bill would specify the eligible uses of the funding allocated to a county child welfare agency under the Housing Navigation and Maintenance Program.\n\nExisting law requires a child welfare agency that accepts any distribution of money under either program to report certain data to the department on an annual basis, including specified information relating to the number of homeless youth served and the number of former or current foster youth served, as defined.\n\nThis bill would revise those reporting requirements to instead require information about the number of young adults served, including the number of young adults formerly in the state's foster care or probation system, as defined, and would require additional information to be reported under the Housing Navigation and Maintenance Program related to housing vouchers, as specified."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Bryan", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bryan\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2162", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2162", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2162&version=20250AB216299INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2162", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 50807 and 50811 of the Health and Safety Code, and relating to housing.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:59+00:00", "_id": "41548982-0e3a-11f1-a618-2a6200350f1a"}