{"legislative_session": "20252026", "identifier": "AB1732", "title": "California Environmental Quality Act: exemption: housing development project: public higher education land use plan.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaEnvironmentalQualityAct", "exemption", "housingdevelopmentproject", "publichighereducationlanduseplan"], "abstracts": [{"note": "summary", "abstract": "The California Environmental Quality Act (CEQA) requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of, an environmental impact report on a project that it proposes to carry out or approve that may have a significant effect on the environment or to adopt a negative declaration if it finds that the project will not have that effect. CEQA also requires a lead agency to prepare a mitigated negative declaration for a project that may have a significant effect on the environment if revisions in the project would avoid or mitigate that effect and there is no substantial evidence that the project, as revised, would have a significant effect on the environment.\n\nCEQA exempts from its requirements certain housing development projects that meet specified conditions, including a condition that the project is consistent with the applicable general plan and zoning ordinance, as well as any applicable local coastal program. CEQA requires a local government to provide formal notification to each California Native American tribe that is traditionally and culturally affiliated with the project site as an invitation to consult on the proposed project, as provided.\n\nThis bill would provide that a housing development project that is consistent with the applicable public higher education land use plan would also meet that condition. The bill would further provide that a housing development project that is not subject to an applicable general plan, zoning ordinance, or public higher education land use plan would satisfy that condition if there is substantial evidence that would allow a reasonable person to conclude that the housing development project meets specified conditions, including a condition that the project satisfies the statewide performance standards for infill projects, as provided. Because the bill would increase duties on a local government related to this exemption by expanding the exemption to additional projects, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 8.", "date": "2026-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Alvarez", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Alvarez\"}", "organization_id": null}, {"name": "Wicks", "classification": "author", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Wicks\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1732", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1732", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/05/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1732&version=20250AB173299INT", "media_type": "application/pdf"}], "date": "2026-02-05", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1732", "note": ""}], "extras": {"impact_clause": "An act to amend Section 21080.66 of the Public Resources Code, relating to environmental quality.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-14T08:44:45+00:00", "_id": "69a145b4-0981-11f1-baff-1a052d2b7fdd"}