{"legislative_session": "20252026", "identifier": "AB2161", "title": "Medi-Cal: work or community engagement.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Medi-Cal", "workorcommunityengagement"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Medi-Cal program, which is administered by the State Department of Health Care Services and under which qualified low-income individuals receive health care services. The Medi-Cal program is in part governed by, and funded pursuant to, federal Medicaid program provisions.\n\nExisting federal law, enacted on July 4, 2025, sets forth various changes to Medicaid eligibility with regard to community engagement reporting, redeterminations, cost sharing, and retroactive coverage, among other factors, for certain Medicaid populations, including beneficiaries between 19 and 64 years of age, inclusive, with income up to 138% of the federal poverty level, commonly known as Medicaid expansion adults.\n\nThe above-described federal law generally requires a Medicaid expansion adult, commencing January 1, 2027, or earlier at state option, to demonstrate community engagement as a condition of Medicaid eligibility. Existing law sets forth the mechanisms for complying with that requirement on a monthly basis, including, among others, a minimum of 80 hours of work or community service or a minimum of half-time enrollment in an educational program. Existing law exempts certain categories of individuals from the requirement, including, among others, a parent or family caregiver of a dependent child 13 years of age or younger or a disabled individual, and a medically frail person.\n\nThis bill would state the intent of the Legislature that the department implement work or community engagement requirements under the above-described federal law to ensure that all eligible Medi-Cal applicants and beneficiaries obtain and maintain coverage in ways that are least administratively burdensome to those individuals. The bill would set forth provisions to conform to the above-described federal provisions, including work or community engagement requirements, exemptions, and notices of noncompliance if applicable.\n\nThe bill would require the department, before verifying an individual's compliance, to ensure and confirm that systems are programmed to maintain coverage with minimal data request to an applicant or beneficiary, as specified. For beneficiaries who cannot be deemed compliant following ex-parte review, the bill would require the county to request a Medi-Cal managed care plan to provide any data that will verify that a beneficiary is exempted or meets the requirements before requesting information directly from the beneficiary.\n\nBy creating new duties for counties relating to Medi-Cal eligibility determinations with regard to work or community engagement, the bill would impose a state-mandated local program.\n\nThe bill would require the department to adopt regulations by July 1, 2028. The bill would require the department, beginning July 1, 2027, to provide a semiannual status report on implementation to the Legislature, until regulations have been adopted.\n\nUnder the bill, these provisions would be implemented only after the Director of Health Care Services determines, and communicates in writing to the Department of Finance, that systems have been programmed for implementation. Under the bill, these provisions would remain operative only as long as the above-described federal law is operative.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Bonta", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bonta\"}", "organization_id": null}, {"name": "Boerner", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Boerner\"}", "organization_id": null}, {"name": "Stefani", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Stefani\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2161", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2161", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2161&version=20250AB216199INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2161", "note": ""}], "extras": {"impact_clause": "An act to add Section 14005.69 to the Welfare and Institutions Code, relating to Medi-Cal.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-19T09:01:02+00:00", "_id": "84317248-0d71-11f1-814c-2ab210762532"}