{"legislative_session": "20252026", "identifier": "SB1387", "title": "State agencies: collection and reporting of demographic data: Jewish identity.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Jewishidentity", "Stateagencies", "collectionandreportingofdemographicdata"], "abstracts": [{"note": "summary", "abstract": "Existing law declares that it is the policy of the state to afford all persons in public schools, regardless of specified characteristics, including race or ethnicity, equal rights and opportunities in the educational institutions of the state, and states that the purpose of related existing law is to prohibit acts that are contrary to that policy and to provide remedies. Existing law defines \"race or ethnicity\" to include ancestry, color, ethnic group identification, and ethnic background.\n\nThis bill would define ethnicity to include Jewish identity.\n\nExisting law specifies certain requirements relative to state agencies, boards, and commissions that directly or by contract collect demographic data as to the ancestry or ethnic origin of Californians, including the requirement to use separate collection categories and tabulations for each major Asian group and each major Pacific Islander group, as specified. Existing law requires these state agencies to include the demographic data in every demographic report on ancestry or ethnic origins of Californians by the state agency published or released on or after July 1, 2012. Existing law further requires these state agencies to make the collected data available to the public pursuant to state and federal law, except for personal identifying information, which existing law deems confidential.\n\nThis bill would require a state agency that directly or by contract collects demographic data as to the ancestry or ethnic origin of Californians to use a separate collection category and tabulation for Jewish ancestry or ethnicity, as specified. The bill would require these state agencies to include the demographic data in every demographic report on ancestry or ethnic origins of Californians by the state agency published or released on or after January 1, 2027. The bill would further require these state agencies to make the collected data available to the public pursuant to state and federal law, except for personal identifying information, which the bill would deem confidential.\n\nExisting law requires the Department of Corrections and Rehabilitation to collect voluntary self-identification information pertaining to race or ethnic origin of people admitted, in custody, and released and paroled, including, but not limited to, specified races and ethnic origins. Existing law requires the Department of Corrections and Rehabilitation, based on that voluntary self-identification information, to prepare and publish monthly demographic data pertaining to the race or ethnic origin of people admitted, in custody, and released and paroled, disaggregated by the same race and ethnicity categories used by the department for the purpose of voluntary self-identification information. Existing law requires the data, except for personally identifying information, which existing law deems confidential, to be publicly available on the Department of Corrections and Rehabilitation's internet website via the Offender Data Points dashboard.\n\nThis bill would include Jewish among those specified races and ethnic origins for self-identification.\n\nExisting law requires the Employment Development Department, in the administration of existing law relating to disability compensation, to collect demographic data for individuals who claim disability benefits or family temporary disability insurance benefits, including race and ethnicity data and sexual orientation and gender identity data, as prescribed. Existing law requires the Employment Development Department to develop and make available online a public-facing dashboard that publishes disaggregated demographic data pertaining to program participation by individuals and is updated on at least a quarterly basis. Existing law requires the Employment Development Department to implement these requirements by July 1, 2026. \n\nThis bill would require the Employment Development Department to collect data on Jewish ancestry or ethnicity for these purposes in accordance with specified demographic data collection requirements for state agencies added by the bill.\n\nExisting constitutional provisions require that a statute that limits the right of access to the meetings of public bodies or the writings of public officials and agencies be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\nThis bill would make legislative findings to that effect."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Stern", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Stern\"}", "organization_id": null}, {"name": "Lowenthal", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Lowenthal\"}", "organization_id": null}, {"name": "Allen", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Allen\"}", "organization_id": null}, {"name": "Berman", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Berman\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1387", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1387", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1387&version=20250SB138799INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1387", "note": ""}], "extras": {"impact_clause": "An act to amend Section 212.1 of the Education Code, to add Section 8310.2 to the Government Code, to amend Section 2068 of the Penal Code, and to amend Section 2615 of the Unemployment Insurance Code, relating to state agencies.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:06+00:00", "_id": "ed315a82-0fca-11f1-9ce2-72e66fa16e68"}