{"legislative_session": "20252026", "identifier": "AB1406", "title": "Subdivisions: disbursements of deposits.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Subdivisions", "disbursementsofdeposits"], "abstracts": [{"note": "summary", "abstract": "Existing law prescribes various restrictions on the sale or lease of lots in a subdivision. Existing law defines a subdivision as improved or unimproved land or lands, wherever situated within California, divided or proposed to be divided for the purpose of sale or lease or financing, whether immediate or future, into 5 or more lots or parcels, as specified. Existing law requires a person who intends to offer subdivided lands for sale or lease to file with the Department of Real Estate an application for a public report, as specified. In certain instances, existing law permits lots to be sold or leased only if the money paid or advanced by a purchaser or lessee is placed into an escrow depository or a bond is furnished for the purpose of protecting purchasers or lessees.\n\nThis bill would authorize a purchaser's deposit that is held in escrow pursuant to a binding sales contract for a lot or parcel within a subdivision that is not yet constructed or developed to be disbursed before closing to pay for project expenses, as specified. The bill would authorize the disbursement of a purchaser's deposit before closing if specified conditions are met, including that the developer has submitted to the Department of Real Estate a project budget showing all costs required to be paid in order to complete the project.\n\nThis bill would require the developer to submit specified information to the Department of Real Estate if a purchaser's funds are to be disbursed before the completion of construction of the project, including, among other things, satisfactory evidence of security for the completion of construction. The bill would permit the disbursement of a purchaser's deposit before closing to pay any cost set forth in the project budget, as provided.\n\nThis bill would require a specified notice to be prominently displayed in the developer's public report for the project if a purchaser's deposit is to be disbursed before closing. The bill would require the Department of Real Estate to complete a review required by these provisions within 30 days of receipt of the document to be reviewed. The bill would entitle the purchaser to a full refund of the deposit if the purchaser is unable to close at the time of completion of the project, as specified. The bill would provide that these provisions do not limit or otherwise alter the selling or leasing of lots if purchaser funds are deposited into an escrow depository or bond is furnished, as described above.\n\nExisting law deems a provision in a contract to purchase and sell residential property that provides that all or any part of a payment made by the buyer constitutes liquidated damages to the seller upon the buyer's failure to complete the purchase of the property to be valid if certain conditions are satisfied, including certain conditions pertaining to whether the amount actually paid pursuant to the liquidated damages provision exceeds 3% of the purchase price.\n\nThis bill would, notwithstanding those provisions, permit a purchaser's deposit that is held in escrow pursuant to a binding sales contract for a lot or parcel within a subdivision that is not yet constructed or developed to be disbursed before closing to pay for project expenses, as specified. If the deposit is equal to or exceeds 3% of the purchase price, the bill would authorize disbursement before closing if specified conditions are met, including that the Department of Real Estate has approved the developer's final public report for the project that prominently displays a specified notice. The bill would entitle the purchaser to a full refund of the deposit if the purchaser is unable to close at the time of completion of the project, as specified. The bill would also permit the amount actually paid pursuant to a liquidated damages provision to exceed 3% of the purchase price if these provisions are satisfied, in which case the bill would require that the liquidated damages equal the amount of the deposit."}], "other_titles": [{"note": "", "title": "Private investigators."}], "other_identifiers": [], "actions": [{"description": "Introduced. To print.", "date": "2025-02-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["introduction"], "related_entities": []}, {"description": "From printer. May be heard in committee March 24.", "date": "2025-02-22", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Read first time.", "date": "2025-02-24", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "Referred to Coms. on JUD. and B. & P.", "date": "2025-03-24", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Coms. on JUD. and B. & P.", "entity_type": "organization", "organization_id": null}]}, {"description": "From committee chair, with author's amendments: Amend, and re-refer to Com. on JUD. Read second time and amended.", "date": "2025-03-24", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["amendment-introduction", "amendment-passage", "reading-1", "reading-2"], "related_entities": []}, {"description": "Re-referred to Com. on JUD.", "date": "2025-03-25", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on JUD.", "entity_type": "organization", "organization_id": null}]}, {"description": "In committee: Set, first hearing. Hearing canceled at the request of author.", "date": "2025-04-02", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "In committee: Set, second hearing. Hearing canceled at the request of author.", "date": "2025-04-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ward", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ward\"}", "organization_id": null}, {"name": "Wilson", "classification": "author", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Wilson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1406", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1406", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/21/25 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1406&version=20250AB140699INT", "media_type": "application/pdf"}], "date": "2025-02-21", "classification": ""}, {"note": "03/24/25 - Amended Assembly", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1406&version=20250AB140698AMD", "media_type": "application/pdf"}], "date": "2025-03-24", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1406", "note": ""}], "extras": {"impact_clause": "An act to add Section 11013.7 to the Business and Professions Code, and to amend Section 1675 of the Civil Code, relating to subdivisions.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2025-12-29T08:46:50+00:00", "_id": "ead0a6b6-e492-11f0-8217-9aa9a5857dfc"}