{"legislative_session": "20252026", "identifier": "AB2125", "title": "Groundwater basin adjudication: notice.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Groundwaterbasinadjudication", "notice"], "abstracts": [{"note": "summary", "abstract": "Existing law requires a plaintiff who files an action to comprehensively determine rights to extract groundwater from a basin to provide the court a draft notice of commencement of groundwater basin adjudication and a draft form answer to adjudication complaint, as specified. Existing law also requires a plaintiff to file, within a specified timeframe, a motion for approval of the draft notice and draft form answer. Under existing law, once the court approves the draft notice, the plaintiff is required to serve the notice, as specified. Following a court order approving both the notice and draft form answer and authorizing service thereof, existing law requires the plaintiff to take additional steps to provide notice to defendants including, but not limited to, mailing, by registered mail or certified mail, return receipt requested, the notice, complaint, and form answer to all holders of fee title to real property in the basin. Under existing law, if a return receipt is not received for a parcel of real property, the plaintiff must post a copy of the notice, complaint, and form answer in a conspicuous place on the real property. After completing these notice procedures, existing law requires the plaintiff to file a notice of completion of the mailing with the court.\n\nThis bill would impose additional requirements on a plaintiff when filing the notice of completion of mailing. The bill would require the plaintiff to include with the notice of completion an affidavit of the person who mailed the notice and the certified or registered mail delivery receipt for each parcel showing the date, time, and place of mailing. The bill would also require the affidavit to be signed by the party to be served or their legally authorized representative. If a return receipt is not received for a parcel of real property, the bill would require the plaintiff to also include with the notice of completion an affidavit of the person who posted the notice specifying the date, time, and physical location of each parcel where the posting occurred, accompanied by a photograph depicting the posted notice."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Bennett", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bennett\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2125", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2125", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2125&version=20250AB212599INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2125", "note": ""}], "extras": {"impact_clause": "An act to amend Section 836 of the Code of Civil Procedure, relating to civil actions.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-19T09:01:02+00:00", "_id": "83dd17fc-0d71-11f1-814c-2ab210762532"}