{"legislative_session": "20252026", "identifier": "AB1967", "title": "Juveniles.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Juveniles"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law establishes the jurisdiction of the juvenile court, which may adjudge a child to be a dependent of the court under certain circumstances, including when the child suffered, or there is a substantial risk that the child will suffer, serious physical harm. Existing law establishes the grounds for removal of a dependent child from the custody of the child's parents or guardian. Under existing law, a proceeding in the juvenile court to declare a child to be a dependent child of the court is commenced by a social worker who files a petition with the court. Existing law also requires a social worker to investigate whether a petition should be filed with the court whenever any person applies to the social worker to commence proceedings in the juvenile court by affidavit.\n\nThis bill would require, if an application to commence proceedings is submitted by a minor on their own behalf, and the minor is currently residing at a residential facility for children and youth, the social worker, when conducting a safety assessment or substitute care provider safety assessment, to also assess the safety of the home of those who hold custodial rights of the minor.\n\n(2) Existing law authorizes, if the social worker fails to file a petition within 3 weeks of that application, the person to apply to the juvenile court to review the decision of the social worker and affirm the decision or order the social worker to commence juvenile court proceedings.\n\nThis bill would require, if the initial application to commence proceedings was submitted to the social worker by a minor on their own behalf, the court to review the decision and either affirm the decision or order the social worker to commence juvenile court proceedings within 14 days of the minor's application to the court for review.\n\n(3) Existing law authorizes the juvenile court to retain jurisdiction over any person who is found to be a ward or a dependent child of the juvenile court until the ward or dependent child attains 21 years of age. Existing law also authorizes a nonminor who has not yet attained 21 years of age and who exited foster care at or after the age of majority, to petition the court to assume dependency jurisdiction over the nonminor, if they meet one of several specified criteria, including, among others, that they are a nonminor former dependent who received specified public assistance or adoption assistance benefits after attaining 18 years of age and their former guardian or adoptive parent no longer provides ongoing support and no longer receives aid on behalf of the nonminor.\n\nThis bill would expand the eligibility criteria for filing that petition by eliminating the requirement that the nonminor's former guardians or adoptive parents, as applicable, no longer receive benefits on their behalf.\n\nExisting law additionally authorizes the nonminors described above to enter into a voluntary reentry agreement, either before or after filing the petition to assume dependency jurisdiction, in order to establish eligibility for foster care benefits.\n\nThis bill would require, if the nonminor enters into a voluntary reentry agreement pursuant to those provisions, the juvenile court to order that benefits paid on behalf of the nonminor pursuant to specified public assistance or adoption assistance benefits be suspended until the court determines that it should not assume dependency jurisdiction over the nonminor or until the juvenile court terminates dependency jurisdiction over the nonminor subsequent to assuming dependency, as applicable.\n\nThis bill would authorize the department to implement these provisions by means of all-county letters or similar instructions until January 1, 2028.\n\n(4) By imposing additional duties on county employees, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 16.", "date": "2026-02-14", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Zbur", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Zbur\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1967", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1967", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/13/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1967&version=20250AB196799INT", "media_type": "application/pdf"}], "date": "2026-02-13", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1967", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 329, 331, and 388.1 of the Welfare and Institutions Code, relating to juveniles.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:56+00:00", "_id": "3f75070e-0e3a-11f1-a618-2a6200350f1a"}