{"legislative_session": "20252026", "identifier": "AB1798", "title": "Genetic testing for life and disability insurance.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Genetictestingforlifeanddisabilityinsurance"], "abstracts": [{"note": "summary", "abstract": "Existing law generally regulates classes of insurance, including life and disability insurance. Existing law prohibits an insurer from requiring a test for the presence of a genetic characteristic for the purpose of determining insurability, except as specified. If an insurer requests an applicant to take a genetic characteristic test, existing law requires the insurer to obtain the applicant's written informed consent and to notify the applicant of the test result. Existing law prohibits a life or disability income insurer from requiring a genetic characteristic test if the results of the test would be used to determine eligibility for specified health care coverage.\n\nThis bill, until January 1, 2036, would repeal those provisions and would instead prohibit a life or disability insurer from canceling, limiting, or denying coverage, among other actions, based on a test for the presence of a genetic characteristic. Until January 1, 2036, the bill would prohibit a life or disability insurer from requiring, requesting, or soliciting genetic information, using genetic test results, or considering a person's decisions or actions relating to genetic testing in any manner for an insurance purpose.\n\nExisting law, the Insurance Information and Privacy Protection Act, prohibits an insurance institution, agent, or insurance-support organization from seeking specified information in connection with an insurance transaction or preparing or requesting an investigative consumer report about an individual for an insurance application, except as specified. Existing law prohibits an insurance institution or agent from basing an adverse underwriting decision on specified information. Existing law prohibits an insurance institution, agent, or insurance-support organization from utilizing a form or statement that authorizes disclosure of personal or privileged information as its disclosure form, unless the form or statement meets specified criteria.\n\nThis bill would require the above-described disclosure form to exempt genetic characteristics, a test of a person's genetic characteristics, or genetic testing from an authorization for medical records or other records that may contain this information. The bill would prohibit an insurance institution, agent, or insurance-support organization from seeking information in connection with an insurance transaction concerning, or preparing or requesting an investigative consumer report that seeks, an individual's full genome or genetic information originally requested by the individual or obtained by the individual from a direct-to-consumer genetic testing company. The bill would prohibit an insurance institution or agent from basing an adverse underwriting decision on an individual's full genome or genetic information originally requested by the individual or obtained by the individual from a direct-to-consumer genetic testing company."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Wilson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Wilson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1798", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1798", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/10/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1798&version=20250AB179899INT", "media_type": "application/pdf"}], "date": "2026-02-10", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1798", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 791.06, 791.07, 791.11, and 791.12 of, and to amend, repeal, and add Sections 10146, 10147, 10148, 10149, and 10149.1 of, the Insurance Code, relating to insurance.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-11T09:04:21+00:00", "_id": "a731f00a-0728-11f1-b7c8-26f8b3304434"}