{"legislative_session": "20252026", "identifier": "SB1033", "title": "Protein products.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Proteinproducts"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Sherman Food, Drug, and Cosmetic Law, under the administration and enforcement of the State Department of Public Health, provides for the regulation of various subjects relating to the manufacturing, processing, labeling, advertising, and sale of food, drugs, and cosmetics. Existing law places product testing and disclosure requirements on various products, including baby food and prenatal vitamins. A violation of the Sherman Food, Drug, and Cosmetic Law is punishable as a misdemeanor.\n\nThis bill would, commencing January 1, 2028, require a manufacturer of a bulk protein product or a packaged protein product, as defined, that is sold, manufactured, delivered, held, or offered for sale in this state to test a representative sample of each lot of the product for heavy metals, as defined. The bill would require both a manufacturer and brand owner to provide test results to an authorized agent of the department upon their request, as specified. The bill would, commencing January 1, 2028, require a brand owner of a packaged protein product that is sold, manufactured, delivered, held, or offered for sale in the state to disclose specified product information to the public, including, among other things, the heavy metal testing information. Commencing on or after January 1, 2028, the bill would require a statement regarding heavy metal testing to be included on the outermost package of a packaged protein product sold in a retail store and on the product details page on an internet website for products sold online or directly to consumers. The bill would, commencing January 1, 2028, prohibit a person from selling in the state or manufacturing, delivering, holding, or offering for sale in the state a protein product that does not comply with these provisions. By creating a new crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}], "sponsorships": [{"name": "Padilla", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Padilla\"}", "organization_id": null}, {"name": "Alvarado-Gil", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Alvarado-Gil\"}", "organization_id": null}, {"name": "Ochoa Bogh", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Ochoa Bogh\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1033", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1033", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/11/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1033&version=20250SB103399INT", "media_type": "application/pdf"}], "date": "2026-02-11", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1033", "note": ""}], "extras": {"impact_clause": "An act to add Chapter 4.7 (commencing with Section 110424.5) to Part 5 of Division 104 of the Health and Safety Code, relating to public health.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-12T08:59:53+00:00", "_id": "322a6dd6-07f1-11f1-8856-36e757393db5"}