{"legislative_session": "20252026", "identifier": "AB2380", "title": "Pest control: registration fees.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Pestcontrol", "registrationfees"], "abstracts": [{"note": "summary", "abstract": "Existing law authorizes the board of supervisors of any county to establish reasonable fees for the registration of any person advertising, soliciting, or operating as a pest control business and limits the registration fee of certain pest control businesses to the amount necessary to cover the costs of registration, not to exceed $25.\n\nThis bill would raise the maximum registration fee amount from $25 to $75.\n\nExisting law authorizes county boards of supervisors to set fees for registration to cover the cost of registering pest control aircraft pilots and pest control advisers, and limits those fees to no more than $10 per year for a pilot who registers in person in the county in which they intend to work and for an adviser who registers in person in the county listed in the adviser's address on a specified license or the county of occupational choice, and no more than $5 per year for a pilot or adviser already registered in a county to register in an additional county, as provided.\n\nThis bill would repeal those annual registration fee limits of $10 and $5.\n\nExisting law requires certain licensed structural pest control operator qualifying managers and structural pest control board registered companies to register with the county agricultural commissioner before operating a structural pest control business in the county. Existing law authorizes county boards of supervisors to require a registration fee not to exceed the actual cost of processing the registration or $10, whichever is less.\n\nThis bill would repeal that registration fee limit of $10.\n\nExisting law prohibits certain licensed structural pest controller licensees, as provided, from conducting fumigations in any county unless that person has also registered for the current calendar year with the county agricultural commissioner in that county, as provided. Existing law requires the county boards of supervisors to set that registration fee and for that fee not to exceed the cost of processing the registration or $25, whichever is less. Existing law authorizes structural pest control operators and field representatives to be added during the year and limits the fee for adding those operators and field representatives to the actual cost of processing the registration or $10, whichever is less.\n\nThis bill would repeal those annual registration fee limits of $25 and $10."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Papan", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Papan\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2380", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2380", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2380&version=20250AB238099INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2380", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 11734, 11923, 12034, 15204, and 15204.5 of the Food and Agricultural Code, relating to pest control.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:58:03+00:00", "_id": "43a49448-0e3a-11f1-a618-2a6200350f1a"}