{"legislative_session": "20252026", "identifier": "AB1578", "title": "State and local officials: antihate speech training.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Stateandlocalofficials", "antihatespeechtraining"], "abstracts": [{"note": "summary", "abstract": "Existing law requires each state agency to offer at least semiannually, and certain state officials to attend once every 2 years, an orientation course on the relevant ethics statutes and regulations that govern the official conduct of state officials. Existing law requires each state agency to maintain records indicating the specific attendees, each attendee's job title, and dates of their attendance for each orientation course offered for a period of not less than 5 years after each course is given.\n\nThis bill would require, beginning on January 1, 2028, a state official to complete at least one hour of antihate speech training and education within 6 months of taking office and subsequently every 4 years thereafter. The bill would require each state agency to maintain records indicating the date that a state official completed the antihate speech training and education for a period of not less than 5 years after the training is complete.\n\nExisting law requires local agency officials, as defined, to receive sexual harassment prevention training and education if the local agency provides any type of compensation, salary, or stipend to those officials. Existing law requires an entity that develops curricula to satisfy this requirement to consult with the city attorney or county counsel regarding the sufficiency and accuracy of that proposed content. Existing law requires a local agency that requires its local agency officials to complete the sexual harassment prevention training and education to maintain records related to the training, as specified.\n\nThis bill would also require a local agency official to receive at least one hour of antihate speech training and education within the first 6 months of taking office and every 4 years thereafter. The bill would require an entity that develops curricula to satisfy this requirement to consult with the city attorney or county counsel regarding the sufficiency and accuracy of that proposed content. The bill would require a local agency that requires its local agency officials to complete the antihate speech training and education prescribed to maintain records, as specified.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above.\n\nThe California Constitution requires local agencies, for the purpose of ensuring public access to the meetings of public bodies and the writings of public officials and agencies, to comply with a statutory enactment that amends or enacts laws relating to public records or open meetings and contains findings demonstrating that the enactment furthers the constitutional requirements relating to this purpose.\n\nThis bill would make legislative findings to that effect."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 12.", "date": "2026-01-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Jackson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Jackson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1578", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1578", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1578&version=20250AB157899INT", "media_type": "application/pdf"}], "date": "2026-01-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1578", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 53237.1 and 53237.2 of, and to add Article 13 (commencing with Section 11147) to Chapter 1 of Part 1 of Division 3 of Title 2 of, the Government Code, relating to public officials.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-08T08:48:40+00:00", "_id": "f77903c4-04ca-11f1-9308-1a8922ae3534"}