{"legislative_session": "20252026", "identifier": "AB2598", "title": "Health care facilities: notification of next of kin.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Healthcarefacilities", "notificationofnextofkin"], "abstracts": [{"note": "summary", "abstract": "Existing law provides for the licensure and regulation of health facilities, including general acute care hospitals and skilled nursing facilities, by the State Department of Public Health. A violation of these provisions is generally a crime. Existing law, the California Residential Care Facilities for the Elderly Act, provides for the licensure and regulation of residential care facilities for the elderly by the State Department of Social Services. A violation of the act is a misdemeanor.\n\nUnder existing law, if a person dies in a hospital, convalescent hospital, or board and care facility without known next of kin, the person in charge of the hospital or facility is required to give immediate notice of that fact to the public administrator of the county in which the hospital or facility is located, and if the person in charge fails to do so, the hospital or facility is liable for the cost of internment, as specified, and specified losses incurred by the estate or beneficiaries as a result of the failure to notify.\n\nThis bill would instead require a hospital, convalescent hospital, or board and care facility to make a reasonable attempt to notify any known next of kin that the person died in the facility, or if the body of a person is transferred to a hospital after death, the person in charge of the hospital or facility to make a reasonable attempt to notify any known next of kin that the person's body is being held by the hospital, and if after a reasonable attempt the facility cannot notify next of kin, to give notice to the public administrator as described above. The bill would make a hospital or a residential care facility for the elderly that fails to notify any known next of kin liable for a civil penalty of $200 per day, up to a maximum of $50,000, measured from the time it would take to make a reasonable effort to notify the next of kin, as determined by the State Department of Public Health or the State Department of Social Services, as applicable, until the actual knowledge by the next of kin of the decedent's death. The bill would authorize the applicable department to assess a penalty after notice and an opportunity to be heard.\n\nBecause a violation of the above-described provisions by a hospital or a residential care facility for the elderly would be a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Krell", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Krell\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2598", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2598", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2598&version=20250AB259899INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2598", "note": ""}], "extras": {"impact_clause": "An act to add Sections 1293.3 and 1569.492 to the Health and Safety Code, and to amend Section 7600.5 of the Probate Code, relating to health care facilities.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:41+00:00", "_id": "25f70f38-0fcb-11f1-9ce2-72e66fa16e68"}