{"legislative_session": "20252026", "identifier": "AB1715", "title": "Public utilities: reporting.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Publicutilities", "reporting"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law vests the Public Utilities Commission with regulatory authority over public utilities, including electrical corporations and gas corporations. Existing law requires electrical corporations and gas corporations to submit various information to the commission, and requires the commission to annually report to the Legislature on, among other things, all sources and amounts of funding and actual and proposed expenditures, including any costs to ratepayers, related to entities or programs established by the commission, as specified.\n\nThis bill would require each electrical corporation or gas corporation to report certain information for any taxpayer funding, as defined, greater than or equal to $1,000,000 that the utility has applied for or received, as specified. The bill would require the commission, for each application in which a electrical corporation or gas corporation is seeking ratepayer funding, to require the electrical corporation or gas corporation to report all relevant taxpayer funding greater than or equal to $1,000,000 that the electrical corporation or gas corporation is pursuing or has secured, and, if the commission determines that a electrical corporation or gas corporation is not in compliance with that requirement, the bill would authorize the commission to impose a penalty against the electrical corporation or gas corporation, as specified. The bill would require the commission to require each electrical corporation or gas corporation to promptly deliver to ratepayers the financial benefits of taxpayer funding received, as provided.\n\nThe bill would require the commission to provide an annual report to the Legislature with a summary of the information on taxpayer funding reported by each electrical corporation or gas corporation, including the number of grants or loans, the source of those grants or loans, the total dollar amount received, the projects funded by the grants or loans, and the total demonstrated ratepayer savings, as specified.\n\nThe bill would repeal these provisions on January 1, 2037.\n\n(2) Existing law requires, whenever any electrical, gas, heat, telephone, water, or sewer system corporation files an application to change any rate, the corporation to furnish to its customers affected by the proposed rate change notice of its application to the commission for approval of the new rate, with delineated exceptions, including when the rate change is proposed by the corporation pursuant to an advice letter submitted to the commission, as provided.\n\nThis bill would require the commission to issue universal guidelines for a searchable database of public utility advice letters, as provided, and require each public utility to maintain on its internet website a database meeting those guidelines. The bill would require the commission to require public utilities to provide, in any customer notice of a rate change, a link to the advice letter associated with the rate change.\n\n(3) Under existing law, a violation of the Public Utilities Act or any order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause the provisions of this bill would be a part of the act and because a violation of a commission action implementing the bill's requirements would be a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 7.", "date": "2026-02-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Schiavo", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Schiavo\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1715", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1715", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/04/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1715&version=20250AB171599INT", "media_type": "application/pdf"}], "date": "2026-02-04", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1715", "note": ""}], "extras": {"impact_clause": "An act to amend Section 454 of, to add Section 311.8 to, and to add and repeal Sections 593 and 913.7 of, the Public Utilities Code, relating to public utilities.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:52+00:00", "_id": "3d13f5c4-0e3a-11f1-a618-2a6200350f1a"}