{"legislative_session": "20252026", "identifier": "AB1599", "title": "Public transit: California Transit Stop Registry: transit datasets.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaTransitStopRegistry", "Publictransit", "transitdatasets"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Department of Transportation and vests it with various powers and duties.\n\nThis bill would require the department to create, on or before December 31, 2026, the California Transit Stop Registry as a centralized, statewide dataset of standardized information regarding transit stops that includes, but is not limited to, each transit stop's name, location, available amenities, and unique identifier, as specified.\n\nExisting law provides for the funding of public transit, including under the Mills-Alquist-Deddeh Act, also known as the Transportation Development Act.\n\nThis bill would require a transit operator that qualifies for funding under the act to ensure, on or before June 1, 2027, that the name and location of each of its transit stops conforms with the name and location for the stop in the California Transit Stop Registry and to use a transit stop's unique identifier listed in the registry when publishing any dataset with stop information or during publication of agency open datasets. By requiring a transit operator to perform new duties, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-16", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Ahrens", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ahrens\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1599", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1599", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/16/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1599&version=20250AB159999INT", "media_type": "application/pdf"}], "date": "2026-01-16", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1599", "note": ""}], "extras": {"impact_clause": "An act to add Section 14113 to the Government Code, and to add Section 99150.5 to the Public Utilities Code, relating to transportation.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-18T08:39:56+00:00", "_id": "444d4fe4-f449-11f0-8a32-ba924045e4c6"}