{"legislative_session": "20252026", "identifier": "AB2516", "title": "California Grid Manufacturing Initiative.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill", "appropriation"], "subject": ["CaliforniaGridManufacturingInitiative"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Governor's Office of Business and Economic Development (GO-Biz) within the Governor's office and requires GO-Biz to serve the Governor as the lead entity for economic strategy and the marketing of California on issues relating to business development, private sector investment, and economic growth. Existing law creates within GO-Biz the Energy Unit to accelerate the planning, financing, and execution of critical energy infrastructure projects, as specified.\n\nThis bill would require the Energy Unit, in coordination with other specified state entities, to establish the California Grid Manufacturing Initiative. The bill would require the Energy Unit to serve as the state's central entity for aggregating demand for critical electricity grid components, to coordinate the procurement of electricity grid components, and to incentivize new or existing in-state manufacturing of electricity grid components.\n\nThis bill would require each public utility, as defined, on or before January 1, 2028, to submit to the Energy Unit a projection of its purchasing needs for critical electricity grid components for the period of January 1, 2028, through December 31, 2032, inclusive, as provided. The bill would require the Energy Unit, based on the projections, to determine the statewide aggregate purchasing needs for electricity grid components, as specified. The bill would require a public utility that purchases electricity grid components identified pursuant to the bill to purchase those components from the initiative, except as provided. The bill would permit an electrical corporation, and require the Public Utilities Commission, to authorize the recovery of costs incurred by the electrical corporation in implementing the above-described requirements, and would authorize a local publicly owned electric utility to recover the costs incurred from the implementation of the above-described requirements from its ratepayers. By imposing new duties on local publicly owned electric utilities, the bill would impose a state-mandated local program. \n\nUnder existing law, a violation of an order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause a violation of a commission action implementing the bill's requirement regulating the procurement practices of electrical corporations would be a crime, this bill would impose a state-mandated local program.\n\nThis bill would authorize the Energy Unit to issue requests for proposals or other competitive solicitations to procure electricity grid components, as provided, and would authorize the Energy Unit, if it determines that supply is constrained or unreasonably costly, to offer targeted incentives to suppliers that establish or expand manufacturing capacity within California. The bill would also authorize the Energy Unit to enter into production joint ventures with qualified private suppliers, as provided, and to provide bond financing and other assistance.\n\nExisting law, the Bergeson-Peace Infrastructure and Economic Development Bank Act, establishes the California Infrastructure and Economic Development Bank (I-Bank) within GO-Biz and, among other things, authorizes the I-Bank to make loans, issue bonds, and provide financial assistance for various types of projects that qualify as economic development or public development facilities, as provided. \n\nThis bill would create the California Grid Manufacturing Initiative Revolving Fund in the State Treasury, and the Manufacturing Incentive Account and the Procurement Account within the revolving fund, for the purpose of providing financial assistance pursuant to the initiative. The bill would make the moneys in the revolving fund continuously appropriated for expenditure in accordance with the initiative. The bill would authorize the I-Bank, on behalf of the Energy Unit, to issue revenue bonds to finance procurement and manufacturing of electricity grid components, and would require the proceeds of the bonds to be deposited into the respective accounts and used exclusively for the purposes of the initiative. By establishing a continuously appropriated fund, the bill would make an appropriation. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for specified reasons."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Petrie-Norris", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Petrie-Norris\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2516", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2516", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2516&version=20250AB251699INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2516", "note": ""}], "extras": {"impact_clause": "An act to add Article 8 (commencing with Section 12100.80) to Chapter 1.6 of Part 2 of Division 3 of Title 2 of, and to add Article 12 (commencing with Section 63049.80) to Chapter 2 of Division 1 of Title 6.7 of, the Government Code, relating to electricity, and making an appropriation therefor.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:20+00:00", "_id": "a7b60df0-0f01-11f1-bd68-62084ebb1ff2"}