{"legislative_session": "20252026", "identifier": "AB2348", "title": "Medi-Cal: community supports.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Medi-Cal", "communitysupports"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Medi-Cal program, which is administered by the State Department of Health Care Services and under which qualified low-income individuals receive health care services. The Medi-Cal program is in part governed by, and funded pursuant to, federal Medicaid program provisions.\n\nExisting law, the California Advancing and Innovating Medi-Cal (CalAIM) Act, subject to any necessary federal approvals, establishes the CalAIM initiative in order to, among other things, improve quality outcomes, reduce health disparities, and transition and transform the Medi-Cal program to a more consistent and seamless system by reducing complexity and increasing flexibility. Under existing law, the CalAIM initiative ends on December 31, 2026. Existing law authorizes the department to seek to extend the payment methodologies or programs set forth in CalAIM, as specified, consistent with applicable federal requirements.\n\nExisting law, subject to CalAIM implementation, authorizes a Medi-Cal managed care plan to elect to cover community supports. Under existing law, community supports that the department is authorized to approve include, among others, housing transition navigation services and medically supportive food and nutrition services. Existing law requires the department to annually publish a public report on reported community supports utilization data, populations served, and demographic data, as specified.\n\nThis bill would authorize a Medi-Cal managed care plan to continue to cover those community supports approved by the department as cost effective and medically appropriate, as specified. Under the bill, this continued coverage would commence on January 1, 2027, would be conditioned on the availability of federal financial participation, and would be set forth as part of a CalAIM successor program.\n\nThe bill would require the department to continue to publish the above-described public report, but on a quarterly basis. The bill would require the department to provide ongoing technical assistance to Medi-Cal managed care plans and providers of community supports to enhance their ability to effectively provide these services."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Bonta", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bonta\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2348", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2348", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2348&version=20250AB234899INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2348", "note": ""}], "extras": {"impact_clause": "An act to add Article 5.52 (commencing with Section 14184.1000) to Chapter 7 of Part 3 of Division 9 of the Welfare and Institutions Code, relating to Medi-Cal.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:35+00:00", "_id": "2249100c-0fcb-11f1-9ce2-72e66fa16e68"}