{"legislative_session": "20252026", "identifier": "AB1809", "title": "Public contracts: school and community college districts.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Publiccontracts", "schoolandcommunitycollegedistricts"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law, the Local Agency Public Construction Act, authorizes job order contracting, as defined, for school districts until January 1, 2027. Existing law requires job order contractors to submit a questionnaire to the school district containing specified information verified under oath, under penalty of perjury. \n\nThis bill would delete the January 1, 2027, repeal date for these provisions, thereby making them operative indefinitely.\n\nExisting law authorizes a school district to utilize job order contracting only if the school district has entered into a project labor agreement or agreements that will apply to all public works awarded through job order contracting and to all other public works of the school district that exceed a monetary threshold set by the school district until January 1, 2027, regardless of what contracting procedure is used to award that work.\n\nThis bill would delete the January 1, 2027, date for the above provisions, thereby making them operative indefinitely.\n\nExisting law requires a school district to prepare an execution plan for all modernization projects that may be eligible for job order contracting. Existing law requires the school district to select from that plan a sufficient number of projects to be initiated as job order contracts during each calendar year and to determine for each selected project that job order contracting will reduce the total cost of that project, as specified.\n\nThis bill would delete the above provisions.\n\nExisting law also authorizes job order contracting for community college districts until January 1, 2027. Existing law requires job order contractors to submit a questionnaire to the community college district containing specified information verified under oath, under penalty of perjury.\n\nThis bill would delete the January 1, 2027, repeal date for these provisions, thereby making them operative indefinitely.\n\nExisting law authorizes a community college district to utilize job order contracting only if the community college district has entered into a project labor agreement or agreements that will apply to all public works awarded through job order contracting and to all other public works of the district that exceed a monetary threshold set by the district until January 1, 2027, regardless of what contracting procedure is used to award that work.\n\nThis bill would delete the January 1, 2027, date for the above provisions, thereby making them operative indefinitely.\n\nBy extending the operation of those provisions that expand the crime of perjury, this bill would impose a state-mandated local program.\n\n(2) Existing law authorizes continuing contracts for a school district to be made with an accepted vendor for work or services, or for apparatus or equipment, not to exceed 5 years, or for materials or supplies, not to exceed 3 years. \n\nThis bill would prohibit the duration of any task order procurement contract or job order contract issued pursuant to specified Public Contract Code provisions from exceeding 5 years. The bill would additionally provide that any individual task order or job order issued pursuant to those contracts shall remain valid and enforceable despite the expiration of the term of the task order procurement contract or job order contract pursuant to which the individual task order or job order was validly issued.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 13.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Fong", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Fong\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1809", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1809", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/10/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1809&version=20250AB180999INT", "media_type": "application/pdf"}], "date": "2026-02-10", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1809", "note": ""}], "extras": {"impact_clause": "An act to amend Section 17596 of the Education Code, and to amend Sections 20655.23 and 20919.23 of, and to repeal Sections 20665.33 and 20919.33 of, the Public Contract Code, relating to public contracts.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:53+00:00", "_id": "3df815d8-0e3a-11f1-a618-2a6200350f1a"}