{"legislative_session": "20252026", "identifier": "SB1136", "title": "Intercity rail and commuter rail: special events service plans.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Intercityrailandcommuterrail", "specialeventsserviceplans"], "abstracts": [{"note": "summary", "abstract": "Existing law requires revenues attributable to a certain portion of the sales tax on diesel fuel to be continuously appropriated to the Transportation Agency under a program commonly known as the State Rail Assistance Program for allocation to public agencies responsible for state-supported intercity rail services, and public agencies responsible for commuter rail services, to be used for operations and capital improvements.\n\nThis bill would require, as a condition of receiving funding under the program, a public agency responsible for commuter rail services that has a transfer connection station between 2 or more commuter rail services to adopt a special events service plan for each event that meets specified requirements. The bill would require the special events service plan to include schedules to access the event without requiring a transfer, ticket interoperability, and all other technical, equipment, and infrastructure requirements.\n\nExisting law authorizes the Department of Transportation, subject to approval of the Secretary of Transportation, to enter into an interagency transfer agreement under which a joint powers board assumes responsibility for administering the state-funded intercity rail service in a particular corridor. Existing law provides for the allocation of state funds by the secretary to a joint powers board under an interagency transfer agreement based on an annual business plan for the intercity rail corridor and subsequent appropriation of state funds. Existing law requires the joint powers board to submit the annual business plan to the secretary for review and recommendation by April 1 of each year.\n\nThis bill would require an interagency transfer agreement to require a joint powers board to ensure that supplemental service is provided for major, publicly attended events, as specified. The bill would require the business plan to include a special events service plan that includes detailed operating schedules, fare information, and rolling stock requirements designed to satisfy the requirement to provide that supplemental service. To the extent that the bill would add to the duties of a joint powers board, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-17", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 20.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Blakespear", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Blakespear\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1136", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1136", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/17/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1136&version=20250SB113699INT", "media_type": "application/pdf"}], "date": "2026-02-17", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1136", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 14070.2 and 14070.4 of the Government Code, and to amend Section 99312.3 of the Public Utilities Code, relating to transportation.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:02+00:00", "_id": "eabf0cb8-0fca-11f1-9ce2-72e66fa16e68"}