{"legislative_session": "20252026", "identifier": "AB2266", "title": "Electricity: load-serving entities.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Electricity", "load-servingentities"], "abstracts": [{"note": "summary", "abstract": "Existing law requires the Public Utilities Commission to set resource adequacy and resource procurement obligations for load-serving entities, which include electrical corporations, electric service providers, and community choice aggregators. Existing law requires various compliance reporting for load-serving entities.\n\nThis bill would require the commission, on and after January 1, 2030, when setting certain resource adequacy and resource procurement obligations for load-serving entities, to use the same capacity valuation method to assess the reliability contribution of each resource type, as specified. The bill would require the commission, on or before January 1, 2030, to initiate a process to consolidate certain compliance reporting for load-serving entities, as specified.\n\nExisting law establishes the Independent System Operator as a nonprofit, public benefit corporation and requires the Independent System Operator, among other duties, to ensure the efficient use and reliable operation of the electrical transmission grid consistent with the achievement of planning and operating reserve criteria, as provided.\n\nThis bill would require the commission, if the Independent System Operator exercises its backstop procurement authority to ensure sufficient resources to operate the electrical grid, to include in a specified annual report an explanation of why the need for the backstop procurement arose, as provided.\n\nUnder existing law, a violation of the Public Utilities Act or any order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause the provisions of this bill would be a part of the act and a violation of a commission action implementing certain provisions of the bill would be a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Schultz", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Schultz\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2266", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2266", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2266&version=20250AB226699INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2266", "note": ""}], "extras": {"impact_clause": "An act to add Section 380.9 to the Public Utilities Code, relating to electricity.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:33+00:00", "_id": "21156da2-0fcb-11f1-9ce2-72e66fa16e68"}