{"legislative_session": "20252026", "identifier": "AB1939", "title": "Professional fiduciaries: corporate practice.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Professionalfiduciaries", "corporatepractice"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law, the Professional Fiduciaries Act, establishes, until January 1, 2028, the Professional Fiduciaries Bureau, and requires the bureau to license and regulate professional fiduciaries. Existing law defines various terms for these purposes. Existing law requires the bureau to maintain specified information in each licensee's file, and requires a licensee to annually file with the bureau a statement under penalty of perjury containing specified information, including among other things, any licenses or professional certificates held by the licensee.\n\nThis bill, beginning January 1, 2028, would authorize licensees to organize professional fiduciary professional corporations to provide professional fiduciary services, and would prescribe requirements and regulations for those professional corporations to provide fiduciary services. The bill would require the bureau to set the professional fiduciary professional corporations regulatory fee in the amount of at least $1,000 but not to exceed the reasonable costs of implementing these provisions.\n\nThis bill would require the information maintained by the bureau in each licensee's file, and the annual statement filed by a licensee, to include additional information, including information related to whether the licensee is serving with or under a professional fiduciary corporation. By expanding the scope of the crime of perjury, this bill would impose a state-mandated local program.\n\nExisting law authorizes the bureau to suspend, revoke, deny, or impose other disciplinary action on a professional fiduciary license for specified causes, including, among other things, violating specified laws, rules, or regulations pertaining to duties or functions of a professional fiduciary.\n\nThis bill would add to that list of causes the failure of a licensee to, in a timely manner, respond to inquiries or produce documents requested by the bureau, including inquiries and documents related to a professional fiduciary professional corporation.\n\n(2) Existing law, the Moscone-Knox Professional Corporation Act, defines and regulates professional corporations. Existing law provides that a professional organization renders professional services that may be lawfully rendered only pursuant to a license, certification, or registration authorized by, among others, the Business and Professions Code pursuant to a certificate of registration issued by the governmental agency regulating the profession, as specified.\n\n This bill would require a professional fiduciary professional corporation to register with the Secretary of State, as provided, and would require the corporation, its officers, directors, shareholders, and employees rendering professional fiduciary services to be in compliance with the Moscone-Knox Professional Corporation Act.\n\n(3) Existing law generally regulates probate, guardianship, conservatorship, and other protective proceedings. Existing law defines various terms for these purposes, including \"professional fiduciary.\"\n\nThis bill would additionally define \"professional fiduciary professional corporation\" for these purposes.\n\nExisting law prohibits a superior court from appointing a person to carry out the duties of a professional fiduciary unless that person holds a valid, unexpired, and unsuspended license as a professional fiduciary or is exempt from those licensing requirements, as specified.\n\nThis bill would repeal those provisions and would instead prohibit a superior court from appointing a professional fiduciary as, or permitting a professional fiduciary to continue as, a guardian, conservator, personal representative, or trustee, unless the professional fiduciary satisfies one of specified requirements. The bill would make conforming changes.\n\n(4) Existing constitutional provisions require that a statute that limits the right of access to the meetings of public bodies or the writings of public officials and agencies be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\nThis bill would make legislative findings to that effect.\n\n(5) The California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Flora", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Flora\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1939", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1939", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/13/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1939&version=20250AB193999INT", "media_type": "application/pdf"}], "date": "2026-02-13", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1939", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 6501, 6534, 6561, 6584, and 6592 of, and to add Article 7 (commencing with Section 6593) to Chapter 6 of Division 3 of, the Business and Professions Code, to amend Section 13401 of the Corporations Code, and to amend Sections 60.1, 1510, 1821, 2250, 2614.7, and 2643.1 of, to add Part 9.5 (commencing with Section 310) to Division 2 of, and to repeal Section 2340 of, the Probate Code, relating to professional fiduciaries.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-17T09:01:41+00:00", "_id": "46584dea-0bdf-11f1-b31e-ca74f9f6c31f"}