{"legislative_session": "20252026", "identifier": "SB907", "title": "Driving under the influence and other driving offenses: comprehensive reform.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Drivingundertheinfluenceandotherdrivingoffenses", "comprehensivereform"], "abstracts": [{"note": "summary", "abstract": "Existing law defines the term \"violent felony\" for various purposes, including, among others, enhancing the punishment for felonies pursuant to existing sentencing provisions commonly known as the \"3 strikes law.\" The Legislature may directly amend the three strikes law by a statute passed in each house by a 23 vote, or by a statute that becomes effective only when approved by the voters.\n\nThis bill would add to those crimes that are within the definition of a violent felony for all purposes, including of the three strikes law, vehicular manslaughter, as specified. By expanding the scope of an enhancement, this bill would impose a state-mandated local program.\n\nExisting law requires a person convicted of 2 or more felonies to be sentenced to an aggregate term of imprisonment for all convictions at a sum of the principal term, the subordinate term, and any additional term imposed for applicable enhancements, prior convictions, and prior prison terms. Under existing law, a principal term consists of the greatest term of imprisonment imposed by the court for any of the crimes, including any term imposed for applicable enhancements. Under existing law, the subordinate term for each consecutive offense is 13 of the middle term of imprisonment prescribed for each other felony conviction for which a consecutive term of imprisonment is imposed, including 13 of the term imposed for any specific enhancements applicable to those subordinate offenses. In lieu of an aggregate term as described above, existing law authorizes the imposition of a full, separate, and consecutive term for each violation of a certain class of manslaughter.\n\nThis bill would additionally authorize the imposition of a full, separate, and consecutive term for each violation of gross vehicular manslaughter and vehicular manslaughter while intoxicated, as specified. By authorizing the imposition of longer custody terms, this bill would establish a state-mandated local program.\n\nExisting law makes it a crime to operate a vehicle while under the influence of alcohol or drugs, and sets forth the penalties for a violation of these provisions. Existing law provides that a person who is guilty of driving under the influence or driving under the influence causing injury is subject to enhanced penalties if the current offense occurred within 10 years of a prior conviction that was punished as a felony for driving under the influence, driving under the influence causing injury, or vehicular manslaughter with gross negligence.\n\nThis bill would impose for a person convicted of certain driving under the influence offenses an additional 3-year term for each prior conviction of those offenses occurring within 10 years, as specified. By imposing a sentencing enhancement, this bill would establish a state-mandated local program.\n\nExisting law requires the driver of a vehicle involved in an accident resulting only in damage to property, including vehicles, to immediately stop the vehicle at the nearest location that will not impede traffic or otherwise jeopardize the safety of other motorists and provide specified personal information to driver of the other vehicle. Existing law makes failing to comply with these requirements a misdemeanor. Existing law requires the driver of a vehicle involved in an accident resulting in injury to a person, other than that driver, or in the death of a person, to immediately stop the vehicle at the scene of the accident and provide specified personal information to the injured person or the occupants of the other vehicle and to any traffic or police officer at the scene of the accident. Existing law makes failing to comply with these requirements a crime.\n\nThis bill would impose an increased penalty for each of the above-described violations if it occurred within 10 years of a separate driving under the influence, reckless driving, or gross vehicular manslaughter violation, as specified. By creating a sentencing enhancement, the bill would impose a state-mandated local program.\n\nExisting law requires a person who is convicted of specified crimes related to driving under the influence to be advised by the court of the dangerousness of their actions and that if that behavior in the future results in a person's death, they may be charged with murder.\n\nThis bill would additionally require this advisement to be given if the court dismisses an allegation of a violation of driving under the influence or if a person enters a plea to a different or lesser offense, as described.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement. By imposing an increased term of imprisonment, this bill would create a state-mandated local program.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-01-22", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after February 22.", "date": "2026-01-23", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Petrie-Norris", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Petrie-Norris\"}", "organization_id": null}, {"name": "Archuleta", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Archuleta\"}", "organization_id": null}, {"name": "Seyarto", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Seyarto\"}", "organization_id": null}, {"name": "Lackey", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Lackey\"}", "organization_id": null}, {"name": "Stefani", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Stefani\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB907", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB907", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/22/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB907&version=20250SB90799INT", "media_type": "application/pdf"}], "date": "2026-01-22", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB907", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 667.1, 667.5, 1170.125, and 1170.16 of the Penal Code, and to amend Sections 20001, 20002, and 23635 of, and to add Section 23583 to, the Vehicle Code, relating to driving offenses.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-08T08:48:11+00:00", "_id": "e64404e6-04ca-11f1-9308-1a8922ae3534"}