{"legislative_session": "20252026", "identifier": "AB1851", "title": "Pupil health: social-emotional, behavioral, and mental health supports.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill", "appropriation"], "subject": ["Pupilhealth", "social-emotional,behavioral,andmentalhealthsupports"], "abstracts": [{"note": "summary", "abstract": "Existing law requires the governing board of a school district to give diligent care to the health and physical development of pupils and authorizes the governing board of a school district to employ properly certified persons for this purpose. Existing law requires a school of a school district or county office of education and a charter school to notify pupils and parents or guardians of pupils no less than twice during the school year on how to initiate access to available pupil mental health services on campus or in the community, or both, as provided.\n\nThis bill would require the State Department of Education to establish a statewide Tier 1 Social and Emotional Learning, behavioral health, and restorative justice education program for pupils in kindergarten and any of grades 1 to 12, inclusive, as provided. The bill would require a school district, county office of education, or charter school to implement the program with guidance issued by the department and supported using funds appropriated for the Children and Youth Behavioral Health Initiative, as specified. By changing the purposes for which previously appropriated funds may be used, this bill would make an appropriation.\n\nBy imposing additional duties on local educational agencies, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 14.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Gipson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Gipson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1851", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1851", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/11/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1851&version=20250AB185199INT", "media_type": "application/pdf"}], "date": "2026-02-11", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1851", "note": ""}], "extras": {"impact_clause": "An act to add Article 15 (commencing with Section 49591) to Chapter 9 of Part 27 of Division 4 of Title 2 of the Education Code, relating to pupil health, and making an appropriation therefor.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-14T08:44:47+00:00", "_id": "6ab1b4b6-0981-11f1-baff-1a052d2b7fdd"}