{"legislative_session": "20252026", "identifier": "AB1694", "title": "California Career Technical Education Incentive Grant Program: renewal grants.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaCareerTechnicalEducationIncentiveGrantProgram", "renewalgrants"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the California Career Technical Education Incentive Grant Program, administered by the State Department of Education, with the purpose of encouraging, maintaining, and strengthening the delivery of high-quality career technical education programs. Existing law requires, for the 2021–22 fiscal year and each fiscal year thereafter, $300,000,000 to be available to the department, upon appropriation by the Legislature, for the program. Existing law requires a grant applicant to demonstrate a proportional dollar-for-dollar match and sets that amount at $2 for every $1 received from the program. Existing law prohibits an applicant from being awarded an amount higher than the amount that the allocation formula determines the applicant to be eligible to receive under the program. Existing law authorizes a grant recipient under the program to consist of one or more, or any combination, of school districts, county offices of education, charter schools, or regional occupational centers or programs operated by joint powers authorities or county offices of education, as provided. Existing law provides that an applicant receiving a grant from the program in a prior fiscal year is eligible to apply to receive a renewal grant if the applicant's career technical education program continues to meet specified requirements, as provided.\n\nThis bill would delete the prohibition against an applicant being awarded more than the amount determined by the allocation formula and would instead provide that an applicant receiving a grant from the program in a prior fiscal year is required to receive a renewal grant for 3 additional years, as provided. The bill would require, beginning with the 2026–27 fiscal year, up to 90% of the grants awarded pursuant to the program to be designated for renewal grants and up to 10% to be designated for grants for new applicants, unless otherwise determined by the Superintendent of Public Instruction, as provided. The bill would require the Superintendent to cease distribution of funding and recover previously distributed funding if certain conditions occur, including, among others, that the grant recipient did not implement the program substantively as was initially proposed, as provided."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-03", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 6.", "date": "2026-02-04", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Carrillo", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Carrillo\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1694", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1694", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/03/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1694&version=20250AB169499INT", "media_type": "application/pdf"}], "date": "2026-02-03", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1694", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 53071 and 53073 of the Education Code, relating to career technical education.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-09T09:08:51+00:00", "_id": "f35436f2-0596-11f1-9704-d2e31143f527"}