{"legislative_session": "20252026", "identifier": "AB2138", "title": "Medi-Cal: enhanced care management: peer support specialists.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Medi-Cal", "enhancedcaremanagement", "peersupportspecialists"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Medi-Cal program, which is administered by the State Department of Health Care Services and under which qualified low-income individuals receive health care services. The Medi-Cal program is in part governed by, and funded pursuant to, federal Medicaid program provisions.\n\nExisting law requires the department to implement an enhanced care management (ECM) benefit designed to address the clinical and nonclinical needs on a whole-person-care basis for certain target populations of Medi-Cal beneficiaries enrolled in Medi-Cal managed care plans. Under existing law, target populations include, among others, high utilizers with frequent hospital admissions, short-term skilled nursing facility stays, or emergency room visits, and individuals experiencing homelessness.\n\nExisting law authorizes a county, or an agency representing a county, to develop a peer support specialist certification program, subject to departmental approval. Under existing law, these specialists are individuals, at least 18 years of age, who self-identify as having lived experience with the process of recovery from mental illness, substance use disorder, or both, as specified. Existing law requires the department to seek any federal waivers that it deems necessary to establish a demonstration or pilot project for the provision of peer support services in counties that agree to participate.\n\nThis bill would require the department to require, as a condition of providing ECM, that each ECM provider maintain an interdisciplinary care team that includes at least one peer support specialist who is integrated into ECM service delivery and available to support ECM members. The bill would set forth the functions of a peer support specialist for ECM purposes.\n\nThe bill would authorize the department to allow an ECM provider to satisfy the requirement through any combination of staffing models, as specified. The bill would require the department to ensure that Medi-Cal managed care plan contracts, policies, and guidance reflect the requirement and to establish monitoring and compliance mechanisms to ensure that ECM providers implement the requirement.\n\nThe bill would prohibit the department, a Medi-Cal managed care plan, or a Medi-Cal provider, as applicable, from disqualifying a peer support specialist solely or primarily on the basis of a criminal background check, fingerprint-based background check, or similar screening that is a condition of employment, contracting, certification, credentialing, enrollment, or participation in providing peer support services.\n\nUnder the bill, this restriction would be implemented to the extent not in conflict with federal law, and the restriction would not prohibit background checks under specified circumstances. The bill would also authorize consideration of an individual's criminal record as part of their overall fitness for the position of peer support specialist. The bill would condition implementation of these provisions on receipt of any necessary federal approvals and the availability of federal financial participation."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Krell", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Krell\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2138", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2138", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2138&version=20250AB213899INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2138", "note": ""}], "extras": {"impact_clause": "An act to add Sections 14045.195 and 14184.2051 to the Welfare and Institutions Code, relating to Medi-Cal.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:30+00:00", "_id": "1f40a3b6-0fcb-11f1-9ce2-72e66fa16e68"}