{"legislative_session": "20252026", "identifier": "SB1007", "title": "Common interest developments: annual reports: assessments: discipline.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Commoninterestdevelopments", "annualreports", "assessments", "discipline"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Davis-Stirling Common Interest Development Act, governs the formation and operation of common interest developments. Existing law requires that a common interest development be managed by an association. Existing law requires an association of a common interest development to levy regular and special assessments to perform its obligations under the governing documents and the act, as provided. Existing law requires an association to prepare an annual budget report and a policy statement, as specified. Existing law requires the association to either deliver to all members the full report or a summary of the report that includes specified information, on the first page, whenever the annual budget report or a policy statement is prepared, as provided.\n\nThis bill would require the annual budget report to include a high-level summary breakdown of what the regular assessments fund and a statement regarding compensation of a management company, as provided. The bill would require a summary of an annual budget or policy statement to also include a high-level breakdown that describes what the regular assessments fund, as specified.\n\nExisting law prohibits increases in regular assessments for any fiscal year, unless the board complies with certain requirements, including certain information in its annual budget report. Existing law prohibits an association from increasing regular assessments by more than 20 percent, without the approval of a majority of a quorum of members.\n\nThis bill would prohibit an association from increasing a regular assessment, unless the board includes the above-referenced information pertaining to regular assessments. The bill would, instead, prohibit a board from imposing a regular assessment for the association's preceding year, adjusted for inflation, without the approval of the majority of a quorum members.\n\nExisting law requires the association to notify a member 10 days before a meeting to consider or impose discipline on a member, or a monetary charge, as a means of reimbursing the association for costs incurred by the association in the repair of damage to the common area and facilities caused by a member, as provided. Existing law requires the notification to include, among other information, the nature of the alleged violation, or nature of the damage to the common area and facilities.\n\nThis bill would require the association to make any physical evidence used to determine a violation of the governing documents has occurred available to the member at least 5 business days before the hearing or deadline for the member's response, if the association seeks to impose a monetary penalty against a member for violation of the governing documents, as provided."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-09", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 12.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Menjivar", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Menjivar\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1007", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1007", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/09/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1007&version=20250SB100799INT", "media_type": "application/pdf"}], "date": "2026-02-09", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1007", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 5300, 5320, and 5605 of, and to add Section 5860 to, the Civil Code, relating to common interest developments.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-16T09:01:06+00:00", "_id": "07677f58-0b16-11f1-8107-d26818b831da"}