{"legislative_session": "20252026", "identifier": "AB1859", "title": "Public works.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Publicworks"], "abstracts": [{"note": "summary", "abstract": "Existing law requires that, except as specified, not less than the general prevailing rate of per diem wages be paid to workers employed on public works. Existing law defines \"public works,\" for the purposes of regulating public works contracts as, among other things, construction, alteration, demolition, installation, or repair work done under contract and paid for, in whole or in part, out of public funds. Existing law makes any officer, agent, or representative of the state or of any political subdivision who willfully violates specified provisions, including providing notice of certain public works projects, as specified, to the Department of Industrial Relations, guilty of a misdemeanor.\n\nExisting law requires the Labor Commissioner to investigate allegations that a contractor or subcontractor violated the law regulating public works projects, including the payment of prevailing wages. Existing law requires each contractor and subcontractor on a public works project to keep accurate payroll records, showing the name, address, social security number, work classification, straight time and overtime hours worked each day and week, and the actual per diem wages paid to each journeyman, apprentice, worker, or other employee employed by the contractor or subcontractor in connection with the public work.\n\nThis bill would require an awarding body or owner to give reasonable access, as defined, to representatives of a joint-labor management committee in order to monitor compliance with the prevailing wage and apprenticeship requirements. The bill would authorize the committee to bring an action against an awarding body, contractor, or subcontractor that willfully denies the committee's representative reasonable access. The bill would require the court to award various civil penalties and costs, as specified. By expanding the definition of a crime, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 14.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ortega", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ortega\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1859", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1859", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/11/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1859&version=20250AB185999INT", "media_type": "application/pdf"}], "date": "2026-02-11", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1859", "note": ""}], "extras": {"impact_clause": "An act to add Section 1771.25 to the Labor Code, relating to public works.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-15T08:45:37+00:00", "_id": "b34f7a9a-0a4a-11f1-8cce-128f59e91945"}