{"legislative_session": "20252026", "identifier": "AB2650", "title": "CalSavers: retirement savings.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill", "appropriation"], "subject": ["CalSavers", "retirementsavings"], "abstracts": [{"note": "summary", "abstract": "Existing law, the CalSavers Retirement Savings Trust Act, administered by the CalSavers Retirement Savings Board (board) , establishes the CalSavers Retirement Savings Program (program) and the CalSavers Retirement Savings Trust (trust) . Under existing law, the trust consists of a program fund and an administrative fund with trust moneys that are continuously appropriated and administered by the CalSavers Retirement Savings Board for the purpose of promoting greater retirement savings for California private employees. Existing law requires eligible employers to offer a payroll deposit retirement savings arrangement so that eligible employees may contribute a portion of their salary or wages to a retirement savings program account in the program, as specified.\n\nExisting law defines \"eligible employer\" as a person or entity engaged in a business, industry, profession, trade, or other enterprise in the state, whether for profit or not for profit, excluding, among others, specified federal, state, and local governmental entities, with at least one eligible employee and that satisfies certain requirements to establish or participate in a payroll deposit retirement savings arrangement.\n\nThis bill would expand that definition of \"eligible employer\" to include household employers, defined as those who have hired or contracted someone to work in or around their home for the benefit of their personal household and who provide the employee a W-2 federal tax form to evidence tax deductions at the federal and state level. By expanding eligibility under these provisions, the bill would remove a restriction limiting expenditure of funds and authorize the expenditure of continuously appropriated moneys for a new purpose, thereby making an appropriation.\n\nExisting law requires the board, subject to its authority and fiduciary duty, to design and implement the program. Existing law authorizes the board to provide for investment in myRAs. Existing law requires the program to include, as determined by the board, one or more payroll deduction IRA arrangements. Existing law provides the board with the power and authority to, among other things, make and enter into contracts necessary for the administration of the trust and to disseminate information concerning tax credits available to small business owners for allowing their employees to participate in the program and the federal Retirement Savings Contribution Credit (Saver's Credit) .\n\nThis bill would eliminate the authority of the board to invest in myRAs and would make related conforming changes. The bill would require the program, with board approval, to establish an IRA on behalf of participants who are eligible to receive federal or state retirement benefits, as specified, establish a payroll deposit emergency savings account on behalf of participants for the purpose of preserving retirement investments, and notify participants at least 30 days prior to the creation of the accounts.\n\nThis bill would additionally authorize the board to assess the feasibility of multi-state or regional agreements to administer the program and to disseminate information concerning tax credits available to small business owners for allowing their employees to participate in the successor to the Saver's Credit, known as the Saver's Match.\n\nExisting law requires the board, prior to opening the program for enrollment, to establish a retirement investments clearinghouse on its internet website and a vendor registration process, if there is sufficient interest by vendors to participate and provide the necessary funding. Existing law requires vendors that would like to participate in the board's retirement investments clearinghouse and be listed on the board's internet website as a registered vendor to provide specified information to the board.\n\nThis bill would eliminate the above-described requirement for the board to establish a retirement investments clearinghouse on its internet website and a vendor registration process, and would instead require vendors that would like to contract with the board to provide specified information to the board. The bill would make related conforming changes.\n\nExisting law authorizes an employer to choose to have a payroll deposit retirement savings arrangement to allow employee participation in the program under the terms and conditions prescribed by the board. Existing law requires, by December 31, 2025, eligible employers with one or more eligible employees and do not offer a retirement savings program, as provided, to have a payroll deposit retirement savings arrangement to allow employee participation in the program. Existing law provides the board the powers and duties necessary to administer the enforcement of employer compliance, as provided.\n\nThis bill would instead, beginning December 31, 2027 and by December 31 of each calendar year, require eligible employers with one or more eligible employees who do not offer a retirement savings program, as specified, to have a payroll deposit retirement savings arrangement to allow employee participation in the program.\n\nExisting law requires the board to issue to each employer who fails to allow its eligible employees to participate in the program, as provided, a notice of penalty application. Existing law requires each eligible employer that, without good cause, fails to allow its employees to participate in the program, as specified, after the board serves a final notice of penalty application, to be subject to a penalty of $250 per eligible employee and an additional penalty of $500 per eligible employee if noncompliance continues, as described. Existing law requires the Franchise Tax Board to issue a first notice of the imposition of a penalty to an eligible employer for failure to comply after the board informs the Franchise Tax Board of the eligible employer's noncompliance. Existing law requires amounts collected by the Franchise Tax Board for these purposes to be transmitted to the board for deposit in the trust.\n\nThis bill would additionally subject each eligible employer that fails to allow its eligible employees to participate in the program after the above-described penalties have been assessed to a penalty of $500 per eligible employee. The bill would prohibit the penalties assessed from being imposed more than once every 180 days since the last violation. By depositing additional penalties into the trust, a continuously appropriated fund, the bill would make an appropriation."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Pellerin", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Pellerin\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2650", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2650", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2650&version=20250AB265099INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2650", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 100000, 100002, 100004, 100008, 100010, 100012, 100016, 100022, 100026, 100030, 100032, 100033, and 100046 of, and to repeal Sections 100018, 100020, 100024, and 100028 of, the Government Code, relating to retirement, and making an appropriation therefor.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:23+00:00", "_id": "a959afb8-0f01-11f1-bd68-62084ebb1ff2"}