{"legislative_session": "20252026", "identifier": "AB1734", "title": "Count Hunger Act.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CountHungerAct"], "abstracts": [{"note": "summary", "abstract": "Existing law declares the established policy of the state that every human being has the right to access sufficient affordable and healthy food. Existing law defines food insecurity as the occasional or constant lack of access to the food one needs to live a healthy life and the uncertainty of being able to acquire enough food to meet the needs of an individual or household due to insufficient money or other resources.\n\nExisting law requires the State Department of Public Health to consider the above-described state policy when establishing grant criteria pertinent to the distribution of sufficient affordable food. Existing law requires the department to administer or oversee various programs addressing nutrition, including, among other things, pupil access to healthy food and the California Special Supplemental Nutrition Program for Women, Infants, and Children.\n\nThis bill, the Count Hunger Act, would require the department to establish a 2-year pilot program, in collaboration with the University of California at Los Angeles (UCLA) , to ensure that certain sets of questions linked to food insecurity are funded and covered within the California Health Interview Survey (CHIS) . The bill would define CHIS as the statewide health survey administered by UCLA and conducted annually through interviews with thousands of households in the state, as specified.\n\n Under the bill, the CHIS portion relating to food insecurity would apply to all households whose income is at or below 400% of the federal poverty level. The bill would require UCLA, in collaboration with the department, to publish any available statewide-, regional-, and county-level data, as feasible, that are linked to the food insecurity portion, as specified.\n\nThe bill would condition implementation of these provisions on an appropriation by the Legislature and a resolution by the Regents of the University of California, for implementation in the 2027 and 2028 calendar years or as otherwise specified."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 8.", "date": "2026-02-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Stefani", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Stefani\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1734", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1734", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/05/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1734&version=20250AB173499INT", "media_type": "application/pdf"}], "date": "2026-02-05", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1734", "note": ""}], "extras": {"impact_clause": "An act to add Chapter 26 (commencing with Section 28050) to Division 20 of the Health and Safety Code, relating to nutrition.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-10T09:11:56+00:00", "_id": "8c712646-0660-11f1-90ab-3249eb54b40b"}