{"legislative_session": "20252026", "identifier": "AB2208", "title": "Medi-Cal: cost sharing, retroactivity, and accessibility.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Medi-Cal", "costsharing,retroactivity,andaccessibility"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Medi-Cal program, which is administered by the State Department of Health Care Services and under which qualified low-income individuals receive health care services. The Medi-Cal program is in part governed by, and funded pursuant to, federal Medicaid program provisions.\n\nExisting federal law, enacted on July 4, 2025, sets forth various changes to Medicaid eligibility with regard to community engagement reporting, redeterminations, cost sharing, and retroactive coverage, among other factors, for certain Medicaid populations, including beneficiaries between 19 and 64 years of age, inclusive, with income up to 138% of the federal poverty level, commonly known as Medicaid expansion adults.\n\n The above-described federal law requires the state, beginning October 1, 2028, to impose deductions, cost sharing, or similar charges determined appropriate by the state, in an amount greater than $0, with respect to certain care, items, or services furnished to Medicaid expansion adults, with income exceeding 100% and up to 138% of the federal poverty level, as determined by the state. The federal law excludes certain services from these provisions and prohibits the charge from exceeding $35.\n\nThis bill would, no sooner than October 1, 2028, set a copayment of $0.01 for nonemergency services for the above-described population, as specified. The bill would authorize the provider to collect, retain, or waive the copayment amount. The bill would not apply the copayment requirements to emergency services, family planning services, or any services under certain categories. The bill would prohibit a service provider from denying care or services to an individual solely because of nonpayment of copayment.\n\n The bill would create an exemption from a copayment requirement for any visit, service, device, or item for which the Medi-Cal program's payment is $10 or less. The bill would prohibit the total aggregate amount of deductions, cost sharing, or similar charges imposed for all individuals in a family from exceeding 5% of the family income.\n\nThe above-described federal law reduces the period of retroactive coverage prior to the date of Medicaid application from 3 months to one month for Medicaid expansion adults and to 2 months for other Medicaid beneficiaries.\n\nUnder state law, a Medi-Cal card is authorization for payment for health care services rendered, to the extent required by federal law, during any of the 3 months immediately before the month of application and for which the person would have otherwise been eligible.\n\nUnder this bill, upon request by an individual who is determined to be eligible for the Medi-Cal program, assistance would be made available for care and services, whether federally funded or state-funded, and furnished during any of the 3 months immediately before the month of application, if the individual was, or upon application would have been, eligible for medical assistance. The bill would make conforming changes to related provisions, with specification that the 3 months of retroactive eligibility would be federally funded or state funded, with federal reimbursement sought to the maximum extent federally allowable.\n\nExisting law requires the department to develop a single, accessible, standardized paper, electronic, and telephone application for insurance affordability programs, including Medi-Cal, for use by all entities authorized to make an eligibility determination for those programs.\n\nThis bill would require that the application be user-tested for accuracy and readability and be operational by the date as required by the federal Secretary of Health and Human Services, including before the effective date of any applicable changes required pursuant to the above-described federal law. The bill would authorize use of the application form, to the extent possible, to determine compliance with work or community engagement requirements set forth in the federal law, including any exemptions to those requirements, without seeking additional information.\n\nExisting law authorizes all insurance affordability programs to accept self-attestation for age, date of birth, family size, household income, state residence, pregnancy, and any other applicable criteria needed to determine eligibility, to the extent permitted by state and federal law.\n\nThis bill would instead require those programs to accept self-attestation, and would incorporate work or community engagement activities or exemptions into that self-attestation provision, to the extent permitted by state and federal law. The bill would incorporate work or community engagement into other related provisions, and would make other changes to eligibility systems.\n\nBy creating new duties for counties relating to Medi-Cal eligibility and coverage determinations, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Stefani", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Stefani\"}", "organization_id": null}, {"name": "Boerner", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Boerner\"}", "organization_id": null}, {"name": "Bonta", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Bonta\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2208", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2208", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2208&version=20250AB220899INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2208", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 14005.37, 14016.2, 14019, and 15926 of, and to add Section 14134 to, the Welfare and Institutions Code, relating to Medi-Cal.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:59+00:00", "_id": "41c6d2e4-0e3a-11f1-a618-2a6200350f1a"}