{"legislative_session": "20252026", "identifier": "AB2346", "title": "Vehicles: electric bicycles and speed limits.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Vehicles", "electricbicyclesandspeedlimits"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law defines an electric bicycle as a bicycle equipped with fully operable pedals and an electric motor of less than 750 watts, and classifies electric bicycles into 3 classes with different restrictions for various purposes.\n\nThis bill would require all class 1 and class 2 electric bicycles manufactured, sold, or offered for sale on or after January 1, 2029, to be equipped with a speedometer. The bill would also require all electric bicycles manufactured, sold, or offered for sale on or after January 1, 2029, to be equipped with an integrated front lamp and a rear lamp, as specified.\n\nThe bill would also require manufacturers and distributors of electric bicycles to include a written description of California's electric bicycle laws with the bicycle's packaging to be provided to the consumer. The bill would also require sellers and distributors of electric bicycles to provide specified disclosures at or before the point of sale. The bill would make a violation of these provisions punishable by a civil penalty not to exceed $15,000 for a first violation and not to exceed $50,000 for each subsequent violation, upon an action brought by the Attorney General, a city attorney, a county counsel, or a district attorney. The bill would specify that a violation of these provisions is not a criminal offense.\n\n(2) Existing law regulates the operation of bicycles on highways and authorizes local authorities to, among other things, prohibit, by ordinance, the operation of an electric bicycle or any class of electric bicycle on equestrian trails or hiking or recreational trails.\n\nThis bill would authorize a local authority to set a speed limit on a bicycle path of 15 or 20 miles an hour or on a multiuse trail to 10, 15, or 20 miles per hour, subject to specified signage requirements. The bill would also prohibit a person under 16 years of age from riding a self-propelled device at a speed greater than 15 miles per hour on a highway or a bicycle path unless that person possesses an instruction permit issued by the department. The bill would also make technical, nonsubstantive changes to these provisions.\n\n(3) Existing law establishes various prima facie speed limits.\n\nThis bill would set a prima facie speed limit of 5 miles per hour on a sidewalk and 15 miles per hour for a Class IV bikeway.\n\n(4) Under existing law, a violation of the Vehicle Code is a crime.\n\nBy creating new requirements within the Vehicle Code, the violation of which would be a crime, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Wilson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Wilson\"}", "organization_id": null}, {"name": "Berman", "classification": "author", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Berman\"}", "organization_id": null}, {"name": "Weber Pierson", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Weber Pierson\"}", "organization_id": null}, {"name": "Davies", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Davies\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2346", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2346", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2346&version=20250AB234699INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2346", "note": ""}], "extras": {"impact_clause": "An act to amend Section 22352 of, to add Sections 21214.8 and 21214.9 to, and to add Article 19 (commencing with Section 28170) to Chapter 5 of Division 12 of, the Vehicle Code, relating to vehicles.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:35+00:00", "_id": "22430856-0fcb-11f1-9ce2-72e66fa16e68"}