{"legislative_session": "20252026", "identifier": "AB1582", "title": "Higher Education Employer-Employee Relations Act: collective bargaining: unfair labor practices.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["HigherEducationEmployer-EmployeeRelationsAct", "collectivebargaining", "unfairlaborpractices"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Higher Education Employer-Employee Relations Act, administered by the Public Employment Relations Board (PERB) , provides for negotiations concerning wages, hours, and other terms and conditions of employment between a higher education employer, as defined, and representatives of recognized employee organizations. Existing law grants higher education employees the right to form, join, and participate in the activities of employee organizations of their own choosing for the purpose of representation on all matters of employer-employee relations and for the purpose of meeting and conferring with their employer.\n\nExisting law authorizes an employer and an exclusive representative who enter into a written memorandum of understanding to agree to procedures for final and binding arbitration of disputes that may arise under the memorandum of understanding or between the parties. Existing law makes it unlawful for the higher education employer to, among other things, refuse or fail to meet and confer with an exclusive representative. \n\nThis bill would, with respect to arbitrations over violations of a collective bargaining agreement that relate to the contracting out of bargaining unit work, make it an unfair practice for a higher education employer to, among other things, circumvent or disregard an arbitrator's decision by extending or renewing an existing contract, or entering into one or more new contracts for the same or similar services, or otherwise violating the same contract term or terms already interpreted by an arbitrator to prohibit the employer's conduct.\n\nThis bill would prohibit PERB from deferring repeat offenses in the above-described cases to subsequent arbitration proceedings. If an arbitrator or PERB finds the employer to be a repeat offender, as described above, the bill would authorize PERB to award civil penalties of $1,000 per day, as specified. The bill would require remedies for a violation of these provisions to include the charging party's attorney's fees and costs."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 13.", "date": "2026-01-14", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ortega", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ortega\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1582", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1582", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/13/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1582&version=20250AB158299INT", "media_type": "application/pdf"}], "date": "2026-01-13", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1582", "note": ""}], "extras": {"impact_clause": "An act to add Section 3571.01 to the Government Code, relating to public employment.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-23T08:42:49+00:00", "_id": "7f42e838-f837-11f0-a1f9-ce581d18a2f9"}