{"legislative_session": "20252026", "identifier": "AB1933", "title": "Land surveyors: records of survey.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Landsurveyors", "recordsofsurvey"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes a record of survey review process, which requires a county surveyor to examine a record of survey for compliance with specified requirements, and authorizes the county surveyor to charge a reasonable fee for examining a record of survey, as provided, and not to exceed the cost of the service. Existing law requires that, if a record of survey complies with the specified requirements, the county surveyor must endorse a statement of examination on the record of survey and present it to the county recorder for filing. Existing law requires that, if the record of survey does not comply with the above requirements, the county surveyor must return it to the person who presented it with a written statement of the changes necessary to make it conform.\n\nThis bill would, instead, require the county surveyor to return the record of survey to the licensed land surveyor or registered civil engineer who presented it with a written statement of the changes necessary to make it conform.\n\nExisting law requires a corner record, as defined, to be examined for compliance with specified provisions, including that a corner record be signed and sealed by a land surveyor or civil engineer, as specified. Existing law requires that a monument set by a licensed land surveyor or registered civil engineer be permanently and visibly marked or tagged with the licensee's certificate number, as specified.\n\nThis bill would revise the above corner record examination provisions to require a county surveyor or engineer, when examining a corner record for compliance, to include compliance with specified monument identification and tagging requirements, as specified. By requiring a higher level of service from a county surveyor, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 16.", "date": "2026-02-14", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Hoover", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Hoover\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1933", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1933", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/13/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1933&version=20250AB193399INT", "media_type": "application/pdf"}], "date": "2026-02-13", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1933", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 8767 and 8773.2 of the Business and Professions Code, relating to land surveyors.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-19T09:00:58+00:00", "_id": "820d6558-0d71-11f1-814c-2ab210762532"}