{"legislative_session": "20252026", "identifier": "AB1636", "title": "Cerritos Community College District: data sharing.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CerritosCommunityCollegeDistrict", "datasharing"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the California Community Colleges, under the administration of the Board of Governors of the California Community Colleges, as one of the segments of public postsecondary education in this state. Existing law establishes community college districts throughout the state, and authorizes them to provide instruction to students at community college campuses. One of these districts is the Cerritos Community College District.\n\n Existing law establishes the California College Promise, under the administration of the Chancellor of the California Community Colleges, to provide funding, upon appropriation by the Legislature, to each community college meeting prescribed requirements. Existing law authorizes a community college to use that funding to waive some or all of the fees for 2 academic years for certain first-time students at the college.\n\nExisting law authorizes the governing board of a community college district to enter into a College and Career Access Pathways (CCAP) partnership with the governing board of a school district, a county office of education, or the governing body of a charter school for the purpose of offering or expanding dual enrollment opportunities for pupils who may not already be college bound or who are underrepresented in higher education, as provided.\n\nThis bill, until January 1, 2032, would authorize the governing board of the Cerritos Community College District to enter into a data sharing agreement with the governing board of a school district, county office of education, or charter school that partners with the district under the California College Promise or the College and Career Access Pathways Program to ensure that pupils have seamless and streamlined access from high school to community college with an active and ready-to-enroll student record, as specified. The bill would require the data to be shared under the agreement on a form developed by the chancellor, and populated by the chancellor with certain data from statewide data systems. The bill would require, on or before January 1, 2031, the chancellor to submit a report to the Legislature on the effectiveness of the program, as specified.\n\nThis bill would make legislative findings and declarations as to the necessity of a special statute for the Cerritos Community College District."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-26", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 26.", "date": "2026-01-27", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Solache", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Solache\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1636", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1636", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/26/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1636&version=20250AB163699INT", "media_type": "application/pdf"}], "date": "2026-01-26", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1636", "note": ""}], "extras": {"impact_clause": "An act to add and repeal Section 76005 of the Education Code, relating to pupil instruction.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-08T08:48:41+00:00", "_id": "f815c786-04ca-11f1-9308-1a8922ae3534"}