{"legislative_session": "20252026", "identifier": "SB1365", "title": "Unlawful business practices: price gouging.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Unlawfulbusinesspractices", "pricegouging"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law, commonly known as the Cartwright Act, generally regulates trusts, defined as a combination of capital, skill, or acts by 2 or more persons for certain purposes, including to create or carry out restrictions in trade or commerce. Existing law makes every trust unlawful, against public policy, and void, except as provided. Under existing law, a violation of these provisions is a conspiracy against trade and is punishable by fines or imprisonment, or both, as specified.\n\nExisting law authorizes any person who is injured in their business or property by reason of any violation of these provisions to file a lawsuit, as provided, and to recover 3 times the damages sustained, plus interest and other relief, as specified. Existing law deems the state and any of its political subdivisions and public agencies as a person for purposes of these provisions.\n\nExisting law authorizes the Attorney General, or the district attorney of any county, subject to specified notice requirements, to initiate civil actions or criminal proceedings for violation of these provisions, and authorizes the Attorney General or the district attorney to initiate an action against a corporation or association, including a foreign corporation or foreign association, for specified remedies.\n\nThis bill would similarly authorize the city attorney of any city with a population in excess of 750,000 to initiate and prosecute those actions on behalf of the city or any public agency or political subdivision located wholly within the city, or on behalf of natural persons residing in the city.\n\nUnder existing law, an Attorney General or district attorney who initiates an action is entitled to retain a specified amount from the proceeds, if any, for expenses for investigation and prosecution, and to retain a specified amount from the collection of a fine or civil penalty, as provided.\n\nThis bill would similarly entitle a city attorney of any city with a population in excess of 750,000 who initiates an action to retain similar amounts.\n\nExisting law grants to a district attorney who reasonably believes that there may be a violation of these provisions all of those powers granted to the Attorney General as a head of a department for purposes of specified laws relating to investigation and prosecution, and subjects the district attorney to other specified laws relating to financial privacy.\n\nThis bill would similarly grant those powers to a city attorney who reasonably believes that there may be a violation, and would subject the city attorney to those specified laws relating to financial privacy.\n\nThe bill would make other related changes.\n\n(2) Under existing law, upon the proclamation of a state of emergency by the President of the United States or the Governor, or upon the declaration of a local emergency by the executive officer of any county, city, or city and county, and for 30 days following the proclamation or declaration of emergency, it is a misdemeanor for any person, business, or other entity, to increase the rental price advertised, offered, or charged for housing, to an existing or prospective tenant, by more than 10%. Existing law exempts an increase from these provisions if the person can prove that the increase is directly attributable to additional costs for repairs or additions beyond normal maintenance that were amortized over the rental term that caused the rent to be increased greater than 10%.\n\nThis bill would instead exempt an increase if the increase was directly attributable to additional costs for repairs or additions beyond normal maintenance and the costs were incurred as a result of the event that triggered the proclamation or declaration of emergency, or, if the increase was directly attributable to additional costs for repairs or additions beyond normal maintenance incurred within the year prior to the proclamation or declaration and either the housing was rented, advertised for rent, or offered for rent at the time the costs were incurred or the person can prove that within a year before the proclamation or declaration, the intent to offer the housing for rent within 6 months of the repair or addition already existed.\n\nExisting law defines housing for these purposes as any rental housing with an initial lease term of no longer than one year.\n\nThis bill would expand the definition of \"housing\" to include any rental housing without regard to the length of the initial lease term.\n\nExisting law defines the rental price of housing advertised, offered, or charged at a daily rate at the time of the proclamation or declaration of emergency that is advertised, offered, or charged on a periodic lease agreement after the declaration or proclamation of emergency as being 160% of the fair market rent established by the United States Department of Housing and Urban Development, which may be increased by 5% if the housing is offered for rent fully furnished. \n\nThis bill would define the rental price of housing advertised, offered, or charged at a daily rate following a declaration or proclamation of emergency, but that was not advertised, offered, or charged at a daily rate in the year prior to the declaration or proclamation of emergency as being 130 of the amount above.\n\nBy expanding the scope of a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Allen", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Allen\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1365", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1365", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1365&version=20250SB136599INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1365", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 16750, 16750.2, 16752, 16753, 16754, 16754.5, 16755, 16755.1, 16758, 16759, and 16760 of the Business and Professions Code, and to amend Section 396 of the Penal Code, relating to business.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:05+00:00", "_id": "ecfcdcbc-0fca-11f1-9ce2-72e66fa16e68"}