{"legislative_session": "20252026", "identifier": "AB1922", "title": "Restraint of incarcerated persons.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Restraintofincarceratedpersons"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Board of State and Community Corrections and declares that the mission of the board is to provide statewide leadership, coordination, and technical assistance to promote effective state and local efforts and partnerships in California's adult and juvenile criminal justice system consistent with the statewide goal of improved public safety through cost-effective, promising, and evidence-based strategies for managing criminal justice populations. Existing law requires the board to establish minimum standards for local correctional facilities, including the safety of incarcerated individuals, and to biennially review and make appropriate revisions to those standards. \n\nThis bill would require the board's standards to prohibit an incarcerated patient who is admitted to a hospital from being restrained by the use of mechanical restraints, as defined, while receiving care. If there is an immediate physical threat while the incarcerated patient is in the hospital, the bill would require the standards to provide that a hospital may initiate their medical restraint process, as specified, and would prohibit the use of mechanical restraints by local correctional facility staff if there is an immediate physical threat while the incarcerated patient is in the hospital. \n\nExisting law prohibits the application of restraints to incarcerated pregnant persons, as specified. Existing law requires a pregnant person who is incarcerated in a prison to be temporarily taken to a hospital outside the prison for the purpose of giving childbirth and to be transported in the least restrictive way possible and in accordance with the above-described provisions. Existing law also specifies the circumstances during which a juvenile may be placed in mechanical restraints, including during transportation between facilities.\n\nThis bill would prohibit juveniles and incarcerated persons admitted to a hospital from being restrained by the use of mechanical restraints while receiving care, as defined. The bill would authorize a hospital to initiate its medical restraint process, as specified, and would prohibit the use of mechanical restraints by state correctional facility staff or juvenile facility staff if there is an immediate physical threat while the incarcerated patient is in the hospital. By placing new requirements on local correctional facility and juvenile facility staff, this bill would impose a state-mandated local program. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 15.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Lowenthal", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Lowenthal\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1922", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1922", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1922&version=20250AB192299INT", "media_type": "application/pdf"}], "date": "2026-02-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1922", "note": ""}], "extras": {"impact_clause": "An act to amend Section 6030 of, and to add Section 2652.6 to, the Penal Code, and to amend Section 210.6 of the Welfare and Institutions Code, relating to incarcerated persons.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-17T09:01:40+00:00", "_id": "463406e2-0bdf-11f1-b31e-ca74f9f6c31f"}