{"legislative_session": "20252026", "identifier": "SB1314", "title": "Smoke shops: locations, hours of operation, and sale of nitrous oxide.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Smokeshops", "locations,hoursofoperation,andsaleofnitrousoxide"], "abstracts": [{"note": "summary", "abstract": "The Stop Tobacco Access to Kids Enforcement (STAKE) Act requires the State Department of Public Health to establish and develop a program to reduce the availability of tobacco products to persons under 21 years of age through specified enforcement activities. In addition to the primary enforcement responsibility assumed by the department, existing law authorizes other state and local governmental agencies to conduct inspections and assess penalties for violations of the act, as specified, and encourages state and local enforcement agencies to share the results of inspections and coordinate with the department when enforcing the act. In this regard, existing law authorizes an enforcing agency to assess specified civil penalties against any person, firm, or corporation that sells, gives, or in any way furnishes to another person who is under 21 years of age any tobacco, cigarettes, or cigarette papers. Existing law, upon the assessment of a civil penalty for the 3rd, 4th, or 5th violation, requires the department to notify the California Department of Tax and Fee Administration (CDTFA) , and requires the CDTFA to assess civil penalties and suspend or revoke a license issued under the Cigarette and Tobacco Products Licensing Act of 2003.\n\nThis bill, effective January 1, 2028, would prohibit the retail location for a smoke shop, as defined, from being located within a 600-foot radius of a school or a day care center in existence at the time the retail license is issued, unless the local jurisdiction specifies a different radius. The bill would prohibit a smoke shop from engaging in the retail sale of tobacco products directly to the public between the hours of 10:00 p.m. to 6:00 a.m. The bill would authorize the State Department of Public Health or the CDTFA to establish regulations relating to the operation of smoke shops, including the creation of a separate license category with administrative processes and separate fee rates. The bill would also prohibit a smoke shop from possessing, storing, owning, or selling nitrous oxide or paraphernalia relating to the consumption of nitrous oxide. The bill would authorize an enforcement agency to assess civil penalties for a violation of those provisions. The bill would authorize the CDTFA to then assess a civil penalty and suspend or revoke a license for a violation of those provisions. The bill would define various terms relating to the bill's provisions.\n\nThe California Constitution provides for the establishment of the State Board of Equalization, which, before July 1, 2017, had primary responsibility for most of the state's duties, powers, and responsibilities regarding the administration of taxes and fees. Existing law, on July 1, 2017, transferred to the CDTFA various duties, powers, and responsibilities of the State Board of Equalization, including administration of the STAKE Act, as specified.\n\nThis bill would change references in the provisions of the STAKE Act amended by this bill from the \"State Board of Equalization\" to the \"California Department of Tax and Fee Administration\" to reflect the transfer of the board's duties, powers, and responsibilities to the CDTFA."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Menjivar", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Menjivar\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1314", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1314", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1314&version=20250SB131499INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1314", "note": ""}], "extras": {"impact_clause": "An act to amend Section 22958 of, and to add Section 22965 to, the Business and Professions Code, relating to smoke shops.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:05+00:00", "_id": "ec839a50-0fca-11f1-9ce2-72e66fa16e68"}