{"legislative_session": "20252026", "identifier": "AB2273", "title": "Crimes: Scrivner Act.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Crimes", "ScrivnerAct"], "abstracts": [{"note": "summary", "abstract": "Existing law provides that any person who willfully and lewdly commits any lewd or lascivious act, including any of the acts constituting other crimes, as provided, upon or with the body, or any part or member thereof, of a child who is under 14 years of age, with the intent of arousing, appealing to, or gratifying the lust, passions, or sexual desires of that person or the child, is guilty of a felony, punishable by imprisonment in the state prison for 3, 6, or 8 years.\n\nThis bill would remove the requirement that the person had that specific intent of arousing, appealing to, or gratifying the lust, passions, or sexual desires of that person or child, if the person was under the influence of a mind- or mood-altering substance. By expanding the scope of a crime, this bill would create a state-mandated local program.\n\nThe bill would additionally require the Department of Justice, upon completion of an investigation of a person who holds an elected office in which the department determines the person committed specified crimes relating to rape, that the victim was a minor, and that the case is appropriate for prosecution, to bring criminal charges against that person within 30 days.\n\nExisting law authorizes a court to grant pretrial diversion to a defendant suffering from a mental disorder, on an accusatory pleading alleging the commission of a misdemeanor or felony offense, in order to allow the defendant to undergo mental health treatment. Existing law makes a defendant ineligible for this diversion program if the defendant is charged with specified offenses, including, among other offenses, any sex offense except indecent exposure.\n\nThis bill would make a defendant ineligible for pretrial diversion if the court determines that the facts alleged in the accusatory pleading or disclosed in the preliminary hearing transcript, police reports, or other evidence would constitute any of the offenses prohibited from receiving diversion, regardless of whether the prosecution formally charges or ultimately proceeds on those offenses. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Bains", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bains\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2273", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2273", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2273&version=20250AB227399INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2273", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 288 and 1001.36 of, and to add Section 11110 to, the Penal Code, relating to crimes.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:33+00:00", "_id": "214490dc-0fcb-11f1-9ce2-72e66fa16e68"}