{"legislative_session": "20252026", "identifier": "AB1537", "title": "Peace officers: secondary employment.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Peaceofficers", "secondaryemployment"], "abstracts": [{"note": "summary", "abstract": "Existing law provides that every executive or ministerial officer, employee, or appointee of the State of California, or any county or city therein, or any political subdivision thereof, who knowingly asks, receives, or agrees to receive any emolument, gratuity, or reward, or any promise thereof excepting such as may be authorized by law for doing an official act, is guilty of a misdemeanor. Existing law exempts from that offense certain employment by a peace officer while off duty, as specified. Existing law also provides that a peace officer shall not be prohibited from engaging in other employment while off duty, as specified.\n\nThis bill would, notwithstanding those provisions, prohibit a peace officer from being employed by, or being an independent contractor of or volunteer for, the United States Department of Homeland Security or its contractors or any other entity that assists with or engages in immigration enforcement. The bill would provide that failure to comply with this provision constitutes, for certain purposes, an act of dishonesty and that it is grounds for decertification as a peace officer. The bill would require a peace officer to report to their employing law enforcement agency any secondary employment relating to immigration enforcement. By imposing additional duties on local law enforcement agencies to accept these reports, this bill would impose a state-mandated local program. The bill would also explicitly state that records related to secondary employment of peace officers are public records for the purposes of the California Public Records Act. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-05", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 5.", "date": "2026-01-06", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Bryan", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bryan\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1537", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1537", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/05/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1537&version=20250AB153799INT", "media_type": "application/pdf"}], "date": "2026-01-05", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1537", "note": ""}], "extras": {"impact_clause": "An act to amend Section 70 of the Penal Code, relating to peace officers.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-18T08:39:55+00:00", "_id": "43b325ae-f449-11f0-8a32-ba924045e4c6"}