{"legislative_session": "20252026", "identifier": "AB2299", "title": "California Antihunger Response and Employment Training Act of 2026.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaAntihungerResponseandEmploymentTrainingActof2026"], "abstracts": [{"note": "summary", "abstract": "Existing federal law establishes the Supplemental Nutrition Assistance Program (SNAP) , known in California as CalFresh, under which supplemental nutrition assistance benefits allocated to the state by the federal government are distributed to eligible individuals by each county.\n\nExisting federal law limits a participant who is an able-bodied adult without dependents (ABAWD) to 3 months of CalFresh benefits in a 3-year period unless that participant has met work participation requirements or is otherwise exempt. Existing federal law authorizes a waiver of that time limit upon the request of a state if it is determined that the area in which the individuals reside has an unemployment rate of over 10% or does not have a sufficient number of jobs to provide employment for the individuals. Existing state law requires the State Department of Social Services, to the extent permitted by federal law, to annually seek a federal waiver of the time limit. Existing federal law also authorizes a state to provide, in each fiscal year, an exemption from the 3-month time limit for covered individuals, to the extent that the average monthly number of exemptions in effect during a fiscal year does not exceed 8% of the number of covered individuals in the state.\n\nExisting law authorizes counties to participate in the CalFresh Employment and Training (CalFresh E&T) program, established by federal law, and requires a participating county to demonstrate in its CalFresh E&T plan how it is effectively using CalFresh E&T funds for each of the components that the county offers, including work experience or training and job searching.\n\nThis bill would require the department to establish the California Antihunger Response and Employment Training (CARET) , a state-funded program to provide benefits to a person who has been determined ineligible for CalFresh benefits, or for whom CalFresh benefits have been discontinued, as a result of the ABAWD time limit, and who also is ineligible for a percentage exemption, as specified. The bill would require that the person receive the same amount of benefits under the CARET program that they would have received under the CalFresh program if the ABAWD time limit did not make them ineligible. The bill would also make a CARET program recipient eligible for CalFresh E&T program benefits, and would make a CalFresh E&T provider serving a CARET recipient eligible to draw down a state-funded reimbursement in the same amount that the provider would have been eligible to receive for allowable CalFresh E&T services for a CalFresh recipient. The bill would require the issuance of CARET benefits through a state-administered and state-funded electronic benefits transfer system, as specified.\n\nThe bill would require the department to develop, in consultation with specified entities, and to issue guidance to maximize the use of percentage exemptions from the 3-month time limit available under federal law and guidance relating to SNAP. The bill would authorize the guidance to include redistribution of percentage exemptions between counties, as specified. The bill would require the guidance to be issued no later than April 1, 2028, and to remain operative until the CARET program is operative.\n\nThe bill would make related findings and declarations.\n\nTo the extent that the bill would expand eligibility for county-administered benefits through the establishment of the CARET program, the bill would impose a state-mandated local program.\n\n The California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Calderon", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Calderon\"}", "organization_id": null}, {"name": "Boerner", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Boerner\"}", "organization_id": null}, {"name": "Davies", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Davies\"}", "organization_id": null}, {"name": "Jackson", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Jackson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2299", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2299", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2299&version=20250AB229999INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2299", "note": ""}], "extras": {"impact_clause": "An act to add Chapter 10.6 (commencing with Section 18947) to Part 6 of Division 9 of the Welfare and Institutions Code, relating to CalFresh.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:58:01+00:00", "_id": "42c9d880-0e3a-11f1-a618-2a6200350f1a"}