{"legislative_session": "20252026", "identifier": "AB1684", "title": "Common interest developments: cooling systems.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Commoninterestdevelopments", "coolingsystems"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Davis-Stirling Common Interest Development Act, governs the formation and operation of common interest developments, and requires a common interest development to be managed by an association, as specified. Existing law includes provisions that limit the authority of an association or the governing documents, as defined, to regulate the use of a member's separate interest, as defined.\n\nExisting law, the Mobilehome Residency Law, governs tenancies in mobilehome parks and includes provisions that are applicable to those who have an ownership interest in a subdivision, cooperative, or condominium for mobilehomes, or a resident-owned mobilehome park, as specified. Existing law makes any covenant, restriction, or condition contained in any rental agreement or other instrument affecting the tenancy of a homeowner or resident that effectively prohibits or restricts the installation, upgrade, replacement, or use of a cooling system in a mobilehome void and unenforceable. Existing law provides that a \"cooling system\" includes a portable air-conditioning unit, a window air-conditioning unit, a swamp cooler or any evaporative cooler, a cooling fan system, a heat pump, or any other technology that reasonably creates an internal temperature cooling benefit, and meets applicable health and safety standards and requirements imposed by law.\n\nThis bill would, under the Davis-Stirling Common Interest Development Act, make any provision of the governing documents, architectural guidelines, or policies void and unenforceable if the provision prohibits or restricts the installation, upgrade, replacement, or use of a cooling system. The bill would also make any covenant, restriction, or condition contained in any, among other specified agreements, deed that effectively prohibits or restricts the installation, upgrade, replacement, or use of a cooling system, void and unenforceable. The bill would make it unlawful for an association to prohibit or restrict a member from installing, upgrading, replacing, or using a cooling system in the member's separate interest, or to take other specified actions in connection with the installation, upgrade, replacement, or use of a cooling system, subject to specified exceptions.\n\nThis bill would make an association that willfully violates these provisions liable to the member for actual damages occasioned thereby, and for a civil penalty paid to the member in an amount not to exceed $2,000."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-02", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 5.", "date": "2026-02-03", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ward", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ward\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1684", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1684", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/02/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1684&version=20250AB168499INT", "media_type": "application/pdf"}], "date": "2026-02-02", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1684", "note": ""}], "extras": {"impact_clause": "An act to add Section 4737 to the Civil Code, relating to common interest developments.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:51+00:00", "_id": "3cc2c8f2-0e3a-11f1-a618-2a6200350f1a"}