{"legislative_session": "20252026", "identifier": "AB2169", "title": "Social media platforms: artificial intelligence models.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Socialmediaplatforms", "artificialintelligencemodels"], "abstracts": [{"note": "summary", "abstract": "The California Consumer Privacy Act of 2018 (CCPA) grants a consumer various rights with respect to personal information, as defined, that is collected or sold by a business, as defined, including the right to request that a business that collects personal information about the consumer disclose to the consumer certain information about that personal information, including the categories of personal information it has collected about that consumer and the specific pieces of personal information it has collected about that consumer.\n\nThis bill, the Digital Choice Act, would require a social media company or a person that deploys an artificial intelligence model, defined as a model operator, to allow a consumer to request a copy of the consumer's personal information, contextual data, and social graph and would require the social media company or model operator to respond to that request within five business days in a format that is, among other things, portable to the extent technically feasible. The bill would define \"contextual data\" to mean information provided by a user to an artificial intelligence model and any context or derivative data associated with the user's interactions with the artificial intelligence model, as specified, and any model-generated or inferred data linked to or generated from those interactions. The bill would define \"social graph\" to mean data that represents a person's connections and interactions within a social media platform, as specified.\n\nThis bill would require, among other things, a social media company to implement a transparent, third-party-accessible interoperability interface that allows a user to choose to share a covered user's social graph or user-selected parts of the social graph to a social media platform designated by the user and enable a third party to, with the user's permission, access a social graph created by the user and be notified when a new or updated social graph is available, as prescribed. The bill would require a model operator to implement a third-party-accessible interoperability interface to allow a user to share the user's contextual data directly with other artificial intelligence models as the user designates and enable those artificial intelligence models to be notified when new or updated data is available, as prescribed.\n\nThis bill would authorize the Attorney General to adopt specified regulations, as provided, and require the Attorney General to enforce the bill's provisions by bringing an administrative action, as specified."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Lowenthal", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Lowenthal\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2169", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2169", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2169&version=20250AB216999INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2169", "note": ""}], "extras": {"impact_clause": "An act to add Chapter 22.2.10 (commencing with Section 22589.10) to Division 8 of the Business and Professions Code, relating to personal information.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:30+00:00", "_id": "1fa831b6-0fcb-11f1-9ce2-72e66fa16e68"}