{"legislative_session": "20252026", "identifier": "AB2088", "title": "Public Utilities: gas corporations: duty to serve: thermal energy networks.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["PublicUtilities", "dutytoserve", "gascorporations", "thermalenergynetworks"], "abstracts": [{"note": "summary", "abstract": "Existing law vests the Public Utilities Commission (PUC) with regulatory authority over public utilities, including gas corporations and heat corporations. Existing law requires every public utility to furnish and maintain adequate, efficient, just, and reasonable service, instrumentalities, equipment, and facilities, as are necessary to promote the safety, health, comfort, and convenience of its customers, its employees, and the public. Existing law authorizes a gas corporation to cease providing service if a certain pilot program has been implemented and the PUC determines that adequate substitute energy service is reasonably available for the energy end uses of affected gas corporation customers.\n\nThis bill would authorize a gas corporation to satisfy its obligation to provide gas service by providing thermal energy through a thermal energy network, as defined, if the PUC determines that the network offers an adequate and reliable substitute for the thermal end-use energy needs of its customers. The bill would specify that a project for the construction, maintenance, or repair of a thermal energy network is a public work and would require a gas corporation undertaking the project to ensure that all contractors and subcontractors performing work on the project use a skilled and trained workforce. The bill would require to PUC to initiate a proceeding to establish a regulatory framework for the provision of thermal energy service by gas corporations, as provided.\n\nThis bill would require the State Energy Resources Conservation and Development Commission, in consultation with the PUC, to develop technical standards for thermal energy networks, as provided.\n\nUnder existing law, a violation of the Public Utilities Act or an order, decision, rule, direction, demand, or requirement of the PUC is a crime.\n\nBecause the labor requirements for a thermal energy network project would be part of the act and a violation of a PUC action implementing those requirements would be a crime, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Papan", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Papan\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2088", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2088", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2088&version=20250AB208899INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2088", "note": ""}], "extras": {"impact_clause": "An act to add Section 25236 to the Public Resources Code, and to add Sections 236.5, 451.10, and 719.5 to the Public Utilities Code, relating to public utilities.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:12+00:00", "_id": "a280b006-0f01-11f1-bd68-62084ebb1ff2"}