{"legislative_session": "20252026", "identifier": "AB1610", "title": "Elections: notice.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Elections", "notice"], "abstracts": [{"note": "summary", "abstract": "Existing law requires a county elections official to take various actions to confirm voters' residency, including by, among other things, mailing a postcard to each registered voter of the county or obtaining change-of-address data from the United States Postal Service. If the postcard is returned by the post office as undeliverable and the voter has no forwarding address, or if the change-of-address data indicates that the voter has moved and left no forwarding address, existing law requires the county elections official to update the voter's registration status to inactive and mail notice to the voter of that change.\n\nThis bill would require a county elections official to take the following additional steps to provide notice to a voter when United States Postal Service data indicates a voter's mailing address is no longer valid: 1) if a new mailing address is available via change-of-address data, the elections official would be required to update the voter's registration record with the new mailing address and send a forwardable notice to the new address to confirm the change; 2) if a new mailing address is not identified and the voter can receive mail at their physical residence, the elections official would be required to send notice to the voter's physical residence and remove the invalid mailing address from the record; or, 3) if a new mailing address is not identified and the voter cannot receive mail at their physical residence, the elections official would be required to send a specified notice to the voter's mailing address on the voter's registration record.\n\nBy increasing the duties of county elections officials, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee February 20.", "date": "2026-01-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ransom", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ransom\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1610", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1610", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1610&version=20250AB161099INT", "media_type": "application/pdf"}], "date": "2026-01-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1610", "note": ""}], "extras": {"impact_clause": "An act to amend Section 2225 of the Elections Code, relating to elections.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-25T08:42:36+00:00", "_id": "cc730168-f9c9-11f0-9c44-9e9f9e2e2562"}