{"legislative_session": "20252026", "identifier": "AB2050", "title": "Common interest developments: reserve accounts.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Commoninterestdevelopments", "reserveaccounts"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Davis-Stirling Common Interest Development Act, governs the management and operation of common interest developments, and requires an association to manage a common interest development, including requiring the association to levy regular and special assessments sufficient to perform its obligations, subject to specified limitations on increases in those assessments. The act requires an association to distribute an annual budget report 30 to 90 days before the end of its fiscal year. Under existing law, that budget report includes, among other things, a summary of the association's reserve accounts. The act requires an association to perform a study of the reserve account requirements, as defined, and, as part of that study, cause to be conducted a visual inspection of the accessible areas of major components that the association is obligated to repair, replace, restore, or maintain.\n\nThis bill would, beginning January 1, 2032, revise the requirement to perform a study of the reserve account requirements to, among other things, include the minimum reserve contribution level to prevent the projected association reserve account balance from falling below zero over the following 30 years. The bill would require an association to fund the reserve account on an annual basis in at least the minimum reserve contribution level. If the association is unable to fund the reserve account in at least the minimum reserve contribution level without exceeding the above-described specified limitations on increases on assessments, then, notwithstanding those specified limitations, the bill would require the association to levy a reserve special assessment in an amount necessary to allow the association to fund to minimum contribution level without a reserve special assessment within 3 fiscal years, as provided."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Caloza", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Caloza\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2050", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2050", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2050&version=20250AB205099INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2050", "note": ""}], "extras": {"impact_clause": "An act to amend, repeal, and add Section 5550 of, and to add Section 5552 to, the Civil Code, relating to common interest developments.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:11+00:00", "_id": "a21a73c2-0f01-11f1-bd68-62084ebb1ff2"}