{"legislative_session": "20252026", "identifier": "AB1845", "title": "Student safety: human trafficking.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Studentsafety", "humantrafficking"], "abstracts": [{"note": "summary", "abstract": "(1) Existing federal law, known as Title IX, prohibits a person, on the basis of sex, from being excluded from participation in, being denied the benefits of, or being subject to discrimination under any educational program or activity receiving federal financial assistance. A portion of the Donahoe Higher Education Act, known as the Equity in Higher Education Act, requires the appropriate governing board or body of each campus of the University of California, the California State University, and the California Community Colleges, private postsecondary educational institutions, and independent institutions of higher education, as a condition of receiving state financial assistance, to, among other things, provide training to all employees on the identification of sexual harassment, including the person to whom it should be reported. Provisions of the Donahoe Higher Education Act apply to the University of California only to the extent that the Regents of the University of California act, by resolution, to make them apply.\n\nThis bill would require those postsecondary educational institutions, as part of the above-described sexual harassment training for employees, to also include certain information related to human trafficking. The bill would also require those postsecondary educational institutions to ensure that each employee annually completes this training. The bill would prohibit the failure of a postsecondary educational institution employee to report human trafficking to the institution or to local law enforcement authorities from, by itself, resulting in the liability of the institution.\n\n(2) Existing law requires the governing board of a community college district, the Trustees of the California State University, the Board of Directors of the College of the Law, San Francisco, the Regents of the University of California, and the governing board of a postsecondary educational institution receiving public funds for student financial assistance to require the appropriate officials at each campus to compile records of crimes on campus that are reported and involve violence, hate violence, theft, destruction of property, illegal drugs, or alcohol intoxication. Under existing law, this requirement and others related to student safety do not apply to community colleges unless and until the Legislature makes funds available to the community colleges for this purpose.\n\nThis bill would require the appropriate officials at each campus to also compile records of crimes on campus that are reported and involve human trafficking. The bill would impose this requirement and others related to student safety on all community colleges, regardless of whether the Legislature has made funds available to community colleges for this purpose.\n\n(3) Existing law requires the Trustees of the California State University, the governing board of independent postsecondary institutions, the governing board of a community college district, and the Regents of the University of California to adopt rules requiring each of their respective campuses to enter into written agreements with local law enforcement agencies that clarify operational responsibility for investigations of certain violent crimes, sexual assaults, and hate crimes occurring on campus. Existing law requires these written agreements to be reviewed and updated, as specified.\n\nThis bill would require the written agreements with local law enforcement agencies to also clarify operational responsibilities for investigations of human trafficking occurring on campus. The bill would also require the written agreements between community colleges and local law enforcement agencies to apply to additional on-campus crimes. The bill would require these written agreements to be reviewed and updated, if necessary, on or before July 1, 2027, and every 5 years thereafter.\n\n(4) Existing law requires the governing board of a community college district, the Trustees of the California State University, the Regents of the University of California, and the governing boards of independent postsecondary educational institutions, in order to receive state funds for student financial assistance, to (A) adopt a policy concerning sexual assault, domestic violence, dating violence, and stalking involving a student, as specified, and (B) adopt detailed and victim-centered policies and protocols regarding sexual assault, domestic violence, dating violence, and stalking involving a student, as provided.\n\nThis bill would require those postsecondary educational institutions to also adopt a policy concerning incidents of human trafficking that involve students, faculty, or staff. The bill would require the policy to include, among other things, a statement that human trafficking is a state and federal crime, and the physical and mental signs that may indicate that human trafficking is occurring.\n\n(5) Existing law establishes various student financial aid programs, including the Cal Grant Program. As a condition for participation in the Cal Grant Program, existing law requires the governing board of a community college district, the Trustees of the California State University, the Regents of the University of California, and the governing board of a private or independent postsecondary educational institution to adopt and implement written policies and procedures to ensure that any report of certain violent crimes, sexual assault, or hate crimes, committed on or off campus, that is received by a campus security authority, and made by the victim for purposes of notifying the institution or law enforcement, is immediately, or as soon as practicably possible, forwarded to the appropriate law enforcement agency, as provided.\n\nThis bill would require those postsecondary educational institutions, on or before July 1, 2027, to adopt and implement revised written policies and procedures that include human trafficking in the above-described reporting requirement.\n\n(6) By imposing new duties on community college districts, this bill would create a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 14.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Krell", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Krell\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1845", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1845", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/11/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1845&version=20250AB184599INT", "media_type": "application/pdf"}], "date": "2026-02-11", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1845", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 67380, 67381, and 67383 of, to add Section 66281.85 to, and to repeal and add Section 67381.1 of, the Education Code, relating to postsecondary education.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:07+00:00", "_id": "9fd64028-0f01-11f1-bd68-62084ebb1ff2"}