{"legislative_session": "20252026", "identifier": "AB2651", "title": "Informed Parents, Healthy Schools Act.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["InformedParents,HealthySchoolsAct"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the State Department of Public Health, headed by the State Public Health Officer, and sets forth its powers and duties, including the administration of provisions relating to the prevention and control of communicable diseases. Existing law authorizes the department to take necessary measures to ascertain the nature and prevent the spread of communicable diseases. Existing law prohibits the governing authority of a school or other institution from unconditionally admitting or advancing to the 7th grade level any person as a pupil of any public or private elementary or secondary school, childcare center, day nursery, nursery school, family daycare home, or development center, unless, prior to their admission or advancement to that institution, they have been fully immunized against various communicable diseases, as provided, subject to any specific age criteria. Existing law requires the governing authority of a school or other institution, on at least an annual basis, to file a written report on the immunization status of new entrants to the school or institution under their jurisdiction with the department and the local health department at times and on forms prescribed by the department.\n\nThis bill would require the department to establish levels of immunization rates needed to prevent the spread of specified communicable diseases. The bill would require the department to establish notification procedures designed to inform designated parties when an immunization rate is determined to fall below the rate established by the department.\n\nExisting law requires the governing board of a school district to annually notify parents or guardians of minor pupils of specified rights and responsibilities of the parent or guardian and of specified school district policies and procedures.\n\nThis bill would require the governing authority of a school or other institution, as defined, to notify parents or guardians of enrolled pupils when an immunization rate at that school or institution has fallen below the rate established by the State Department of Public Health. The bill would require the governing authority to follow the procedures established by the State Department of Public Health in distributing this notification to parents or guardians.\n\nBy requiring school districts to comply with these requirements, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Bonta", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Bonta\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2651", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2651", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2651&version=20250AB265199INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2651", "note": ""}], "extras": {"impact_clause": "An act to add Section 48986.5 to the Education Code, and to add Section 120141 to the Health and Safety Code, relating to immunizations.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:42+00:00", "_id": "26cf8a34-0fcb-11f1-9ce2-72e66fa16e68"}