{"legislative_session": "20252026", "identifier": "AB1896", "title": "Public employment: disqualifications.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Publicemployment", "disqualifications"], "abstracts": [{"note": "summary", "abstract": "Existing law contains numerous provisions governing the qualifications, standards, and training of peace officers. Existing law specifies circumstances that disqualify a person from holding office or being employed as a peace officer, including, among other things, having been convicted of a felony.\n\nThis bill would disqualify a person from being a peace officer if they were previously employed by an entity that engages in immigration enforcement, as defined, during the period beginning January 20, 2025, and ending January 20, 2029, except as specified. \n\nExisting law requires each class of peace officers to meet minimum standards, including good moral character and being free from any physical, emotional, or mental condition, such as bias against race or ethnicity, gender, nationality, religion, disability, or sexual orientation.\n\nThis bill would add to these minimum standards the requirement that a person has not been previously employed by an entity that engages in immigration enforcement, as defined, during the period beginning January 20, 2025, and ending January 20, 2029, except as specified. \n\nExisting law authorizes the Department of Human Resources (CalHR) or a designated appointing power to refuse to examine or, after examination, to refuse to declare as eligible, or to withhold or withdraw from certification, prior to appointment, anyone who meets certain criteria, such as a person who has misrepresented themselves during the application process. \n\nThis bill would add to these criteria a person who was previously employed by an entity that engages in immigration enforcement, as defined, during the period beginning January 20, 2025, and ending January 20, 2029, except as specified. \n\nExisting law makes a person ineligible to hold office or employment of any kind with the state, or any county, city, district, or other political or governmental unit of the state, if the person has by oath bound themselves to support, maintain, or further the military or political activities or policies of a foreign government, as specified, or to obey the orders or directions of any foreign government or its officials. \n\nThis bill would make a person ineligible to hold public employment, including employment with a city, county, district, or any other public agency of the state, if the person was previously employed by an entity that engages in immigration enforcement, as defined, during the period beginning January 20, 2025, and ending January 20, 2029, except as specified.\n\nBy increasing the duties of local agencies, this bill would impose a state-mandated local program.\n\nThe bill would make the provisions of the act severable. \n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 15.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Mark González", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Mark Gonz\\u00e1lez\"}", "organization_id": null}, {"name": "Rivas", "classification": "author", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Rivas\"}", "organization_id": null}, {"name": "Carrillo", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Carrillo\"}", "organization_id": null}, {"name": "Durazo", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Durazo\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1896", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1896", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1896&version=20250AB189699INT", "media_type": "application/pdf"}], "date": "2026-02-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1896", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 1029, 1031, and 18935 of, and to add Section 1025 to, the Government Code, relating to public employment.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-14T08:44:47+00:00", "_id": "6b153d92-0981-11f1-baff-1a052d2b7fdd"}