{"legislative_session": "20252026", "identifier": "AB2765", "title": "CalFresh and CalWORKs: childhood hunger and foster youth.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CalFreshandCalWORKs", "childhoodhungerandfosteryouth"], "abstracts": [{"note": "summary", "abstract": "Existing federal law establishes the Supplemental Nutrition Assistance Program (SNAP) , known in California as CalFresh, under which supplemental nutrition assistance benefits allocated to the state by the federal government are distributed to eligible individuals by each county.\n\nExisting federal law limits a participant who is an able-bodied adult without dependents (ABAWD) to 3 months of CalFresh benefits in a 3-year period unless that participant has met work participation requirements or is otherwise exempt. Existing state law requires the State Department of Social Services to annually seek a federal waiver of this limitation. Existing state law requires the department to ensure that all recipients subject to the federal ABAWD time limit are permitted to meet the work requirements of the time limit through all forms of work, as specified.\n\nExisting federal law, enacted on July 4, 2025, sets forth various changes to SNAP benefits, including the removal of an exemption from the time limit for certain former foster youth under 25 years of age, and the narrowing of an exemption for a household with a dependent under 18 years of age to instead a household with a dependent under 14 years of age, as specified.\n\nThis bill would specify that an ABAWD participant includes a parent or other member of a household with responsibility for a dependent child 14 years of age or older as a result of the above-described federal law. The bill would also require the department to seek a federal waiver to protect the most vulnerable foster youth from experiencing hunger as a result of the cuts to their assistance. The bill would require that the waiver request that specified categories of foster youth be exempted from any cuts to their SNAP benefits as a result of the new SNAP time limit for this population.\n\nThe bill would require the department to issue an all-county letter to implement the waiver within 3 months after receiving approval and, to the extent allowable under federal law, to instruct counties of steps that they would be authorized to take to maximize the ability of foster youth participating in any of specified programs to be automatically deemed exempt from, or in compliance with, the time limit.\n\nTo the extent that the bill would increase CalFresh eligibility for certain foster youth and expand county duties, the bill would impose a state-mandated local program.\n\nExisting law establishes the California Work Opportunity and Responsibility to Kids (CalWORKs) program, under which, through a combination of federal, state, and county funds, each county provides cash assistance and other benefits to qualified low-income families.\n\nUnder existing law, in addition to specified CalWORKs aid amounts, a family is entitled to receive an allowance for recurring special needs relating to, among other things, food, utilities, and transportation. Under existing law, the allowance for each family per month is prohibited from exceeding that amount resulting from multiplying the sum of $10 by the number of recipients in the family who are eligible for assistance.\n\nThis bill would increase the maximum threshold for the allowance by switching the factor from $10 to $15 within the formula. The bill would, subject to the department's discretion, authorize the allowance to be provided instead in the form of a food benefit of equivalent value.\n\nThe bill would, subject to the department's discretion to establish a mechanism, authorize a household that receives aid under any provision of the Welfare and Institutions Code and that is also eligible for CalWORKs aid, regardless of whether the household receives CalWORKs aid, to receive a recurring special needs allowance in order to prevent immediate child suffering and long-term harm caused by prolonged periods of childhood hunger or other unmet needs, if unmitigated.\n\nBy creating new duties for counties relating to the recurring special needs allowance, the bill would impose a state-mandated local program.\n\nExisting law continuously appropriates moneys from the General Fund to defray a portion of county costs under the CalWORKs program.\n\nThis bill would instead provide that the continuous appropriation would not be made for purposes of the bill.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Ahrens", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ahrens\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2765", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2765", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2765&version=20250AB276599INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2765", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 11450, 18926, and 18926.1 of the Welfare and Institutions Code, relating to nutrition assistance.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:25+00:00", "_id": "aa9e36c8-0f01-11f1-bd68-62084ebb1ff2"}