{"legislative_session": "20252026", "identifier": "SB1371", "title": "Solid waste handling services: labor dispute.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Solidwastehandlingservices", "labordispute"], "abstracts": [{"note": "summary", "abstract": "Existing law contains various provisions relating to franchise agreements between a local jurisdiction and a service provider for the provision of services such as utilities, waste hauling, and cable television.\n\nThis bill would prohibit any franchise contracts, licenses, or permits for solid waste handling services, as defined, entered into or substantially amended, as defined, by a local agency on or after January 1, 2027, from including a force majeure provision that excuses or suspends the service provider's obligation to perform under the franchise contract, license, or permit in the event of a work stoppage arising out of or in connection with a labor dispute, as defined. The bill would also provide that any force majeure provision in a franchise contract, license, or permit for solid waste handling services that excuses or suspends performance due to a work stoppage arising out of or in connection with a labor dispute is void and unenforceable, regardless of the date on which the contract, license, or permit was entered into. By imposing new duties on local governments with respect to the franchise contracts, licenses, or permits for solid waste handling services, the bill would impose a state-mandated local program.\n\nThis bill would prohibit a local agency and an employer from issuing, requesting, inducing, relying upon, or causing to be issued, a sanitation, health, or safety order, directive, or determination for the purpose or effect of compelling the performance of work during a lawful labor dispute involving solid waste handling services, unless specified conditions are satisfied.\n\nThis bill would provide that its provisions are severable.\n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Durazo", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Durazo\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1371", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1371", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1371&version=20250SB137199INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1371", "note": ""}], "extras": {"impact_clause": "An act to add Section 53064.3 to the Government Code, relating to local government.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:43:59+00:00", "_id": "77656d58-0f01-11f1-bd68-62084ebb1ff2"}