{"legislative_session": "20252026", "identifier": "AB2095", "title": "Employment discrimination: conviction history.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Employmentdiscrimination", "convictionhistory"], "abstracts": [{"note": "summary", "abstract": "Existing law, the California Fair Employment and Housing Act, except as specified, makes it an unlawful employment practice for an employer with 5 or more employees to include on any application for employment, before the employer makes a conditional offer of employment to the applicant, any question that seeks the disclosure of an applicant's conviction history, to consider the conviction history of the applicant until after the employer has made a conditional offer of employment to the applicant, or to distribute information about an arrest not followed by conviction, referral to or participation in a pretrial or posttrial diversion program, or convictions that have been sealed, dismissed, expunged, or statutorily eradicated or any conviction for which the convicted person has received a full pardon or has been issued a certificate of rehabilitation while conducting a conviction history background check in connection with an application for employment, as specified.\n\nThis bill would include among those things that it is unlawful for an employer with 5 or more employees to do while conducting a conviction history background check in connection with an application for employment, asking any question that directly or indirectly seeks consent for a conviction history background check or requesting consent for or beginning a conviction history background check before providing the applicant with a list of all specific job duties of the position with which a conviction may have a direct and adverse relationship and potentially result in an adverse action, requiring a job applicant to cover the cost of a conviction history background check, or requiring any time before or after the conditional job offer, that an applicant self-disclose conviction history or provide the employer with any documentary evidence related to conviction history or rehabilitation, as specified.\n\nExisting law requires an employer that intends to deny an applicant a position of employment solely or in part because of the applicant's conviction history to make an individualized assessment of whether the applicant's conviction history has a direct and adverse relationship with the specific duties of the job that justify denying the applicant the position considering specified factors.\n\nThis bill, instead, would prohibit an employer from denying an applicant a position of employment or taking other adverse action solely or in part because of the applicant's conviction history unless the employer first, reasonably and in good faith, demonstrates via an individualized assessment, that the applicant's conviction history has a direct and adverse relationship with the specific duties of the job that justifies denying the applicant the position and it complies with a specified process. The bill would establish a rebuttable presumption that the relationship between the position is not sufficiently direct and adverse for these purposes if the applicant has completed a sentence for the conviction of the crime, as specified, or possesses a license, certificate, authorization, or any other similar credential from a governmental agency or board that is required for the position. The bill would require the employer to commit the results of the individualized assessment to writing. The bill would specify that it is not an adverse action for an employer to temporarily suspend an employee, with pay and for a reasonable amount of time, while the employer complies with the requirements of these provisions.\n\nExisting law makes these provisions inapplicable to a position as a farm labor contractor, as specified or to a position where an employer or agent thereof is required by any state, federal, or local law to conduct criminal background checks for employment purposes or to restrict employment based on criminal history. \n\nThis bill would remove the exemption for farm labor contractors and add additional requirements to be satisfied to qualify for an exemption with regard to a position for which an employer or agent thereof is required by any state or federal law to conduct a conviction history background check for employment purposes or to restrict employment based on conviction history, as specified."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Lee", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Lee\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2095", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2095", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2095&version=20250AB209599INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2095", "note": ""}], "extras": {"impact_clause": "An act to amend Section 12952 of the Government Code, relating to discrimination.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:29+00:00", "_id": "1eab2520-0fcb-11f1-9ce2-72e66fa16e68"}