{"legislative_session": "20252026", "identifier": "AB2034", "title": "Food safety: unsafe additives and ingredient disclosures.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Foodsafety", "unsafeadditivesandingredientdisclosures"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Sherman Food, Drug, and Cosmetic Law, under the administration and enforcement of the State Department of Public Health (department) , provides for the regulation of various subjects relating to the manufacturing, processing, labeling, advertising, and sale of food, drugs, and cosmetics. A violation of the Sherman Food, Drug, and Cosmetic Law is punishable as a misdemeanor.\n\n Existing law makes it unlawful for any person to adulterate any food or to manufacture, sell, deliver, hold, or offer for sale any food that is adulterated. Existing law deems a food as adulterated if it is, bears, or contains any food additive that is unsafe, or if it bears or contains any color additive or added poisonous or deleterious substance that is unsafe. Existing law deems, among other things, any food additive, color additive, or an added poisonous or deleterious substance as unsafe for use with respect to any food unless there is in effect a regulation, as specified, that limits the quantity and the use, or intended use, of the substance.\n\nThis bill would deem a color additive, food additive, or dietary ingredient as unsafe in food intended for humans if it is found to induce cancer, as specified. This bill would deem a food additive or dietary ingredient as unsafe in food intended for humans with respect to its intended use unless the substance and its intended use meet a specified condition, including, among others, that the substance and its intended use were introduced after January 1, 1958, and are used in accordance with the below-described notice, public listing, and licensing requirements. Commencing July 1, 2027, if an individual intends to use a food additive or dietary ingredient in food intended for humans pursuant to these provisions, the bill would require the individual to submit a notice to the department that includes the same information required for a specified federal notice. The bill would require the department to verify the information and, if the information is complete, publish the notice in a public database, as specified. The bill would require the department to issue or decline to issue a license for those food additives, as specified, and would require the department, when assessing the safety of a food additive, to consider various factors, including, among others, whether the substance is banned or restricted in other jurisdictions due to concerns about adverse health consequences. The bill would authorize the department to create and update user fees for notices, assessments, and reassessments.\n\nThe bill would require, on or before July 1, 2027, the manufacturer of any packaged food product that is sold in this state to provide the department with a complete and accurate list of its food products that, as of the date of submission, are sold in the state and that do not individually list each of the product's ingredients in the ingredient list. For every product submitted, the bill would require the manufacturer to identify each ingredient not individually named in the ingredient list, as specified.\n\nBy creating new crimes, this bill would impose a state-mandated local program. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-17", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 20.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Addis", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Addis\"}", "organization_id": null}, {"name": "Connolly", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Connolly\"}", "organization_id": null}, {"name": "Hart", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Hart\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2034", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2034", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/17/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2034&version=20250AB203499INT", "media_type": "application/pdf"}], "date": "2026-02-17", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2034", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 109940, 110285, 110445 of, and to add Article 8.3 (commencing with Section 110961) and Article 8.4 (commencing with Section 110961.20) to Chapter 5 of Part 5 of Division 104 of, the Health and Safety Code, relating to food safety.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-19T09:01:00+00:00", "_id": "8303a01c-0d71-11f1-814c-2ab210762532"}