{"legislative_session": "20252026", "identifier": "AB2279", "title": "California Advanced Services Fund: Rural and Urban Regional Broadband Consortia Grant Account.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaAdvancedServicesFund", "RuralandUrbanRegionalBroadbandConsortiaGrantAccount"], "abstracts": [{"note": "summary", "abstract": "Existing law requires the Public Utilities Commission to establish the Rural and Urban Regional Broadband Consortia Grant Account in the California Advanced Services Fund and makes the moneys in the account available for grants to eligible consortia to facilitate deployment of broadband services by assisting infrastructure applicants in the project development or grant application process. Existing law requires each consortium to conduct an annual audit of its expenditures for programs funded pursuant to those provisions and to submit to the commission an annual report that includes specified information.\n\nThis bill would instead require moneys in the Rural and Urban Regional Broadband Consortia Account to be available for grants to eligible consortia to promote regional economic prosperity by conducting activities that will close the digital divide, promote digital inclusion, and achieve digital equity, as provided. The bill would require the commission to approve a regional work plan for each consortium consistent with a standardized scope of work determined by the commission, as provided. The bill would require the commission to allocate sufficient funds to the account to provide multiyear grants to eligible consortia to engage and regularly convene identified representatives and to implement an approved regional work plan, as specified. The bill would require the annual base funding grant per consortium to be no less than $200,000, plus an increased amount based on the number of unserved and underserved locations and the number of low-income households in the region, but not to exceed $500,000 per consortium per year. The bill would delete the requirement for each consortium to conduct an annual audit and would revise the information required to be included in the annual report to the commission. The bill would authorize the commission to engage experienced nonprofit organizations through an open, competitive process to assist the commission and support the consortia, as provided.\n\nUnder existing law, a violation of the Public Utilities Act or any order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause the above provisions would be part of the act and a violation of a commission action implementing this bill's requirements would be a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Gipson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Gipson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2279", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2279", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2279&version=20250AB227999INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2279", "note": ""}], "extras": {"impact_clause": "An act to amend Section 281 of the Public Utilities Code, relating to communications.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:33+00:00", "_id": "2156af24-0fcb-11f1-9ce2-72e66fa16e68"}