{"legislative_session": "20252026", "identifier": "SB994", "title": "Local government: nondisclosure agreements.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Localgovernment", "nondisclosureagreements"], "abstracts": [{"note": "summary", "abstract": "Existing law, the legislative code of ethics, prohibits Members of the Legislature from entering into, or requesting that another party enter into, a nondisclosure agreement relating to the drafting, negotiation, or discussion of proposed legislation. Existing law also makes any nondisclosure agreement relating to the drafting, negotiation, or discussion of proposed legislation entered into after January 1, 2026, void and unenforceable. Existing law provides an exception for nondisclosure agreements, or portions thereof, that prevent only the disclosure of trade secrets, financial information, or proprietary information, as specified.\n\nThis bill would prohibit a local government official acting in their official capacity from entering into, or requesting that another individual enter into, a nondisclosure agreement relating to public business that precludes their ability to share information with fellow local government officials serving on the same council, board, commission, district, or agency. The bill would require a local government official in violation of that provision to, among other things, disclose the existence of the nondisclosure agreement, as specified, and would provide that these requirements imposed on a local government official also apply to a local government official acting in their official capacity who entered into, or requested that another individual enter into, a nondisclosure agreement described above before January 1, 2027. By imposing additional duties on local government officials, the bill would impose a state-mandated local program. The bill would also make any nondisclosure agreement relating to public business that precludes the ability of a local government official to share information with fellow local government officials serving on the same council, board, commission, district, or agency and that is entered into after January 1, 2027, void and unenforceable. \n\nThe bill would prohibit staff of a local government official acting in their official capacity from entering into, or requesting that another individual enter into, a nondisclosure agreement relating to public business that precludes their ability to share information with the local government official who they serve under. The bill would also make any nondisclosure agreement relating to public business that precludes the ability of any staff of a local government official acting in their official capacity to share information with the local government official who they serve under and that is entered into after January 1, 2027, void and unenforceable.\n\nThe bill would provide an exception for nondisclosure agreements, or portions thereof, that prevent only the disclosure of trade secrets, financial information, or proprietary information, as specified. The bill would define \"local government official\" for its purposes to mean any public official serving on behalf of a city, county, local agency formation commission, special district, or local educational agency, as specified, and would exempt from its provisions a local government official serving on behalf of a charter city or charter county.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-05", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}], "sponsorships": [{"name": "Cabaldon", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Cabaldon\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB994", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB994", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/05/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB994&version=20250SB99499INT", "media_type": "application/pdf"}], "date": "2026-02-05", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB994", "note": ""}], "extras": {"impact_clause": "An act to add Article 2.4.4 (commencing with Section 53235.5) to Chapter 2 of Part 1 of Division 2 of Title 5 of the Government Code, relating to local government.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-09T09:08:21+00:00", "_id": "e1d34526-0596-11f1-9704-d2e31143f527"}