{"legislative_session": "20252026", "identifier": "SB1420", "title": "Vote by mail ballots and early voting.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Votebymailballotsandearlyvoting"], "abstracts": [{"note": "summary", "abstract": "Existing law provides that no later than 29 days before the day of an election, a voter using a vote by mail ballot may, before the polls close, vote the ballot at the office of the elections official or a satellite location. Existing law provides that a voter may vote their vote by mail ballot, without the identification envelope, in person at the office of the county elections official, a satellite location, the polling place designated for the voter's home precinct, or a vote center, as specified. Existing law provides that for a statewide election, a county that does not conduct an all-mailed ballot election must provide at least one early voting location for at least 6 hours on the Saturday before election day. Existing law requires the Secretary of State to prepare and publish the state voter information guide containing specified information.\n\nThis bill would require the Secretary of State to promulgate, and post on its internet website, regulations setting forth procedures that a county elections official must follow to implement voter education and outreach initiatives to inform the public about the vote by mail and early voting procedures described above. The bill would require the Secretary of State to include information about these vote by mail and early voting procedures in the state voter information guide.\n\nBy imposing new duties on county elections officials, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above.\n\nThis bill would declare that it is to take effect immediately as an urgency statute."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Richardson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Richardson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1420", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1420", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1420&version=20250SB142099INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1420", "note": ""}], "extras": {"impact_clause": "An act to amend Section 9084 of, and to add Section 3016.6 to, the Elections Code, relating to elections, and declaring the urgency thereof, to take effect immediately.", "tags": ["fiscal committee", "local program", "urgency"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:44:00+00:00", "_id": "77d3e422-0f01-11f1-bd68-62084ebb1ff2"}