{"legislative_session": "20252026", "identifier": "AB2556", "title": "Evidence: credibility of witnesses and evidence affected or excluded by extrinsic policies.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Evidence", "credibilityofwitnessesandevidenceaffectedorexcludedbyextrinsicpolicies"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law sets forth the procedure by which, in any prosecution for rape or other specified sexual offenses, evidence of sexual conduct of the complaining witness may be offered to attack the credibility of the complaining witness. This procedure involves, among other things, the filing of a written motion by the defendant, accompanied by an affidavit filed under seal stating an offer of proof, and, if the court determines that the offer is sufficient, a hearing out of the presence of the jury regarding the offer of proof. At the conclusion of the hearing, the court may make an order stating what evidence may be introduced by the defendant. Under existing law, these procedures do not apply if the specified offenses are alleged to have occurred in a local detention facility or state prison, as defined.\n\nThis bill would remove this exception, thereby also applying these procedures to specified offenses alleged to have occurred in a local detention facility or state prison.\n\n(2) Existing law provides that evidence of a person's character or a trait of their character is generally inadmissible when offered to prove the person's conduct on a specified occasion. Existing law prohibits, during the prosecution of specified sex crimes, the admission of, among other things, opinion evidence, reputation evidence, or specific instances of sexual conduct involving the victim and persons other than the defendant to prove the victim's consent. This prohibition does not apply to specified offenses alleged to have occurred in a local detention facility or state prison, as defined.\n\nThis bill would additionally remove this exception, thereby also prohibiting the admission of such evidence in the prosecution of specified offenses alleged to have occurred in a local detention facility or state prison."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Boerner", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Boerner\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2556", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2556", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2556&version=20250AB255699INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2556", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 782 and 1103 of the Evidence Code, relating to evidence.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:40+00:00", "_id": "25663080-0fcb-11f1-9ce2-72e66fa16e68"}