{"legislative_session": "20252026", "identifier": "AB2569", "title": "California Environmental Quality Act: natural hazards and adverse environmental conditions.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaEnvironmentalQualityAct", "naturalhazardsandadverseenvironmentalconditions"], "abstracts": [{"note": "summary", "abstract": "The California Environmental Quality Act (CEQA) requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of an environmental impact report (EIR) on a project that it proposes to carry out or approve that may have a significant effect on the environment or to adopt a negative declaration if it finds that the project will not have that effect. CEQA also requires a lead agency to prepare a mitigated negative declaration for a project that may have a significant effect on the environment if revisions in the project would avoid or mitigate that effect and there is no substantial evidence that the project, as revised, would have a significant effect on the environment.\n\n CEQA defines \"environment\" and \"significant effect on the environment\" for its purposes. CEQA requires the EIR to include a detailed statement setting forth specified facts.\n\nThis bill would expand those definitions to include impacts on people, as specified. The bill would additionally require the lead agency to include in the EIR a detailed statement on any significant effects that may result from locating the proposed project near, or attracting people to, existing or reasonably foreseeable natural hazards or adverse environmental conditions. Because the lead agency would be required to undertake this additional consideration, the bill would impose a state-mandated local program.\n\n The California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Hart", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Hart\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2569", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2569", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2569&version=20250AB256999INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2569", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 21060.5, 21068, and 21100 of the Public Resources Code, relating to environmental quality.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:21+00:00", "_id": "a854e1a0-0f01-11f1-bd68-62084ebb1ff2"}