{"legislative_session": "20252026", "identifier": "AB2257", "title": "Corrections.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Corrections"], "abstracts": [{"note": "summary", "abstract": "Existing law authorizes a board of supervisors of any county to, by resolution, establish a department of corrections, to be headed by an officer appointed by the board, which has jurisdiction over all county functions, personnel, and facilities, or so many as the board names in its resolution, relating to institutional punishment, care, treatment, and rehabilitation of prisoners, including, but not limited to, the county jail and industrial farms and road camps, their functions and personnel. Existing law, except as specified, requires the sheriff to take charge of and be the sole and exclusive authority to keep the county jail and the prisoners in it, as specified.\n\nThis bill would require a board exercising the authority to establish a department of corrections and rehabilitation described above to set forth its reasons for doing so. The bill would specifically include fire camps within the jurisdiction of the department of corrections and rehabilitation. The bill would also require the executive officer appointed by the board to head the department of corrections and rehabilitation to meet specified qualifications and to assume specified duties over county jails. The bill would also revise the provision requiring the sheriff to take charge of and be the sole and exclusive authority to keep the county jail and the incarcerated persons to state that the provision does not apply in counties that have established a department of corrections and rehabilitation pursuant to the authority described above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Hart", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Hart\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2257", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2257", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2257&version=20250AB225799INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2257", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 23013 and 26605 of the Government Code, relating to corrections.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:58:00+00:00", "_id": "424f8ed6-0e3a-11f1-a618-2a6200350f1a"}