{"legislative_session": "20252026", "identifier": "AB1598", "title": "Behavioral sciences.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Behavioralsciences"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Board of Behavioral Sciences within the Department of Consumer Affairs and requires the board to regulate licensees and registrants under the Licensed Marriage and Family Therapist Act (LMFTA) , the Educational Psychologist Practice Act (EPPA) , the Clinical Social Worker Practice Act (CSWPA) , and the Licensed Professional Clinical Counselor Act (LPCCA) . Existing law makes a violation of those acts a crime.\n\nThe LMFTA, the CSWPA, and the LPCCA each contain varying provisions limiting their application to the practice of certain medical and other behavioral science professionals, attorneys, and certain religious personnel, including priests, rabbis, and ministers of the gospel of any religious denomination.\n\nThis bill would revise and recast those provisions to make them consistent across those 3 acts. Specifically, the bill would provide that LMFTA, the CSWPA, and the LPCCA do not prevent qualified members of other professional groups, including those referenced above, from doing work of a psychosocial nature consistent with the standards, ethics, and scope of practice of their respective professions. The bill would prohibit those other professionals from stating or implying that they are licensed or registered under the LMFTA, the CSWPA, or the LPCCA, as specified. The bill would exempt a religious official of any denomination, including those specified above and imams, when providing faith-based counseling services as part of their regular professional duties for an established and legally recognizable faith-based entity if certain criteria are met.\n\nExisting law establishes examination and experiential requirements under the LMFTA, the EPPA, the CSWPA, and the LPCCA to qualify for licensure or registration under those acts, and requires an applicant for licensure or registration to have passed certain examinations or obtain specified experience within a certain timeline for it to be accepted by the board. In this regard, existing law generally requires the applicant to gain the required experience no more than 6 years before the board receives the application. For licensed educational psychologists, the EPPA authorizes the board to accept a passing score on a written examination administered by the board for a period of 6 years from the date the examination was taken. Under the LMFTA, the CSWPA, and the LPCCA, registrants and applicants for licensure, registration, or a subsequent registration number are required to pass a California law and ethics examination. The LMFTA, the CSWPA, and the LPCCA require an applicant for licensure to pass a clinical examination within 7 years from the initial attempt, unless the applicant obtains a passing score on the current version of the California law and ethics examination.\n\nThis bill, instead, would require applicants for licensure under the LMFTA, the EPPA, the CSWPA, and the LPCCA, to obtain the relevant experience and to pass the relevant examination within 7 years preceding the date on which the board receives the application. The bill would require those applicants and registrants under the LMFTA, the CSWPA, and the LPCCA who submit applications to the board on and after January 1, 2030, to have passed the California law and ethics examination no more than 7 years before the board receives the application, as specified.\n\nExisting law authorizes an associate marriage and family therapist registration, an associate clinical social worker registration, or an associate professional clinical counselor registration to be renewed a maximum of 5 times and prohibits a registration from being renewed beyond 6 years from the last day of the month of issuance. Existing law authorizes an applicant to apply for a subsequent registration number when no renewals are possible if certain requirements are met. Existing law prohibits an applicant who is issued a subsequent associate registration number from being employed or volunteering in a private practice.\n\nThis bill would increase the maximum number of renewals for those registrations to 6 and would extend the renewal deadline to 7 years from the last day of the month of issuance. The bill would authorize an applicant applying for or holding a subsequent associate registration number to request a 2-year hardship extension of the subsequent associate registration number to allow them to be employed or volunteer at one private practice or professional employer, subject to specified conditions and requirements, including signing an application under penalty of perjury. By expanding the crime of perjury, the bill would impose a state-mandated local program.\n\nExisting law establishes a $20 fee for rescoring a written examination under the LMFTA, the EPPA, the CSWPA, and the LPCCA. \n\nThis bill would delete that fee.\n\nThis bill would delete obsolete provisions and make other technical and nonsubstantive changes.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-01-16", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Quirk-Silva", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Quirk-Silva\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1598", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1598", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "01/16/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1598&version=20250AB159899INT", "media_type": "application/pdf"}], "date": "2026-01-16", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1598", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 4980.01, 4980.397, 4980.399, 4980.40, 4980.41, 4980.43, 4980.50, 4984.01, 4984.7, 4984.72, 4989.20, 4989.68, 4992.05, 4992.09, 4992.1, 4996.1, 4996.3, 4996.4, 4996.13, 4996.23, 4996.28, 4999.22, 4999.46, 4999.50, 4999.52, 4999.53, 4999.55, 4999.64, 4999.100, and 4999.120 of, and to repeal Sections 4980.398, 4992.07, and 4999.46.1 of, the Business and Professions Code, relating to healing arts.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-01-19T08:48:42+00:00", "_id": "a82626b0-f513-11f0-a4ab-4637a27ff409"}