{"legislative_session": "20252026", "identifier": "AB2746", "title": "Consumer debt: medical debt.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Consumerdebt", "medicaldebt"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Consumer Credit Reporting Agencies Act, defines and regulates consumer credit reports and consumer credit reporting agencies. Existing law regulates the treatment of medical debt in this regard by, among other things, prohibiting a consumer credit reporting agency from making any consumer credit report containing medical debt information, prohibiting a person who uses a consumer credit report in connection with a credit transaction from using medical debt as a negative factor when making a credit decision, and prohibiting a person from furnishing information regarding a medical debt to a consumer credit reporting agency. Existing law makes a violation of certain provisions related to medical debt by a person holding a license or permit issued by the state to be deemed a violation of the law governing that license or permit.\n\nExisting law, the Investigative Consumer Reporting Agencies Act, defines and regulates investigative consumer reports and investigative consumer reporting agencies. Existing law prohibits an investigative consumer reporting agency from making or furnishing any investigative consumer report containing specified items of information, including medical debt.\n\nExisting law defines \"medical debt\" for the purposes of the Consumer Credit Reporting Agencies Act and the Investigative Consumer Reporting Agencies Act as a debt owed by a consumer to a person whose primary business is providing medical services, products, or devices, or to the person's agent or assignee, for the provision of medical services, products, or devices, as specified.\n\nThis bill would, instead, define \"medical debt\" for these purposes as a debt related to, in whole or in part, a transaction, account, or balance arising from a medical service, product, or device, except as provided. By changing the scope of what is considered medical debt, and because certain violations of the Consumer Credit Reporting Agencies Act are deemed a violation of a licensing statute and the violation of some licensing statutes is a crime, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Schiavo", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Schiavo\"}", "organization_id": null}, {"name": "Harabedian", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Harabedian\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2746", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2746", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2746&version=20250AB274699INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2746", "note": ""}], "extras": {"impact_clause": "An act to amend Section 1785.3 of the Civil Code, relating to consumer debt.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:45+00:00", "_id": "281f5fea-0fcb-11f1-9ce2-72e66fa16e68"}