{"legislative_session": "20252026", "identifier": "AB1842", "title": "California Emergency Mortgage Relief Act.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["CaliforniaEmergencyMortgageReliefAct"], "abstracts": [{"note": "summary", "abstract": "Existing law authorizes a borrower who is experiencing financial hardship that prevents the borrower from making timely payments on a specified residential mortgage loan due directly to a specified state of emergency proclaimed by the Governor, or a specified federally declared disaster, to request forbearance on their residential mortgage loan, as prescribed. Existing law requires a mortgage servicer, except as specified, to offer mortgage payment forbearance for an initial 90-day period that may be extend up to a maximum forbearance period of 12 months and prohibits a mortgage servicer from assessing any late fees to the borrower's account or charging a default rate of interest during the forbearance period.\n\nThis bill would, among other things, similarly authorize a borrower to request forbearance on a residential mortgage loan, as defined, secured by a residential real property that has become uninhabitable as a direct result of an emergency, as specified. The bill would require the borrower to affirm that as a direct result of an emergency, a residential unit is uninhabitable. Because the bill would expand the crime of perjury, the bill would impose a state-mandated local program.\n\nThis bill would, except as specified, require a mortgage servicer to offer mortgage payment forbearance of a period of up to an initial 180 days, to be extended at the request of the borrower in 90-day increments, up to a maximum forbearance period of 12 months. The bill would provide that the forbearance period includes any period of forbearance related to the emergency that a mortgage servicer has provided to a borrower before the effective date of these provisions. The bill would also prohibit a mortgage servicer from assessing any late fees to the borrower's account or charging a default rate of interest during the forbearance period.\n\nThis bill would require a mortgage servicer to report the credit obligations of borrowers under an emergency-related forbearance plan in compliance with the federal Fair Credit Reporting Act. For accounts granted emergency-related mortgage payment relief, the bill would prohibit mortgage servicers from furnishing information during the forbearance period indicating that the payments are in forbearance and would require them to report the credit obligation or account as current or delinquent, as specified.\n\nThis bill would authorize a borrower to bring a certain civil action to enforce these provisions.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-11", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 14.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Harabedian", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Harabedian\"}", "organization_id": null}, {"name": "Irwin", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Irwin\"}", "organization_id": null}, {"name": "Allen", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Allen\"}", "organization_id": null}, {"name": "Pérez", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"P\\u00e9rez\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1842", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1842", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/11/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1842&version=20250AB184299INT", "media_type": "application/pdf"}], "date": "2026-02-11", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1842", "note": ""}], "extras": {"impact_clause": "An act to add Title 19.2 (commencing with Section 3273.31) to Part 4 of Division 3 of the Civil Code, relating to emergency relief.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:07+00:00", "_id": "9fceebde-0f01-11f1-bd68-62084ebb1ff2"}