{"legislative_session": "20252026", "identifier": "AB2115", "title": "California Native Americans: formal apology.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill", "appropriation"], "subject": ["CaliforniaNativeAmericans", "formalapology"], "abstracts": [{"note": "summary", "abstract": "Existing law provides that the State of California recognizes and accepts responsibility for the harms and atrocities committed by the state in promoting, facilitating, enforcing, and permitting chattel slavery and apologizes for perpetuating the harms African Americans have faced, as specified. Existing law requires a plaque memorializing this apology to be publicly and conspicuously installed and maintained in the State Capitol Building.\n\nThis bill would provide that the State of California recognizes and accepts responsibility for all of the harms and atrocities committed by its representatives who promoted, permitted, facilitated, and enforced policies of violence against California Native Americans. The bill would further provide that the State of California apologizes for perpetuating the harms California Native Americans as a result of policies enacted, sanctioned, or tolerated by the Legislature. The bill would require a plaque memorializing this apology to be publicly and conspicuously installed and maintained in the State Capitol Building. The bill would impose various duties on the Department of General Services and the Joint Rules Committee relating to the installation and maintenance of the plaque. The bill would authorize the Department of General Services and the Joint Rules Committee to receive money from grants and private donations and would continuously appropriate those funds for this purpose, as specified.\n\nThe bill would require the Legislature to prepare the formal apology and would request it be signed by specified state leaders. The bill would require the Secretary of State to submit a final copy of this formal apology to the State Archives, where it would be available for viewing by the general public in perpetuity. The bill would include related legislative findings."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ramos", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ramos\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2115", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2115", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2115&version=20250AB211599INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2115", "note": ""}], "extras": {"impact_clause": "An act to add Chapter 4.7 (commencing with Section 8304) to Division 1 of Title 2 of the Government Code, relating to state government, and making an appropriation therefor.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:58+00:00", "_id": "40e335c0-0e3a-11f1-a618-2a6200350f1a"}