{"legislative_session": "20252026", "identifier": "AB2122", "title": "Infractions: warrants and penalties.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Infractions", "warrantsandpenalties"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law makes it a misdemeanor to willfully fail to appear in court, as specified. Existing law, when a person has failed to appear and has not posted bail, requires the magistrate to issue a warrant for the person's arrest within 20 days of the failure to appear.\n\nThis bill would make those sections only apply when the underlying charge is not an infraction.\n\n(2) Existing law authorizes the issuance of a bench warrant of arrest when a person fails to appear in court as promised in specified criminal proceedings. \n\nThis bill would prohibit the issuance of a bench warrant of arrest when the underlying crime is an infraction.\n\n(3) Existing law makes it a misdemeanor to willfully fail to appear in court for a violation of the Vehicle Code, and requires the court to report a conviction of this offense to the Department of Motor Vehicles.\n\nThis bill would make that misdemeanor only apply when the underlying charge is not an infraction. The bill would also remove the requirement for the court to report a conviction of this offense to the department.\n\n(4) Existing law authorizes the imposition of a civil assessment or the issuance of an arrest warrant when a person fails to make an installment payment on bail imposed by the court for an infraction violation of the Vehicle Code. Existing law also makes it a misdemeanor to fail to pay bail in installments or to fail to pay a fine imposed for the violation of a state or local traffic law.\n\nThis bill would repeal the misdemeanor for failure to pay a bail installment or fine. The bill would remove the authorization to issue an arrest warrant for failure to pay a bail installment.\n\n(5) Existing law, if a defendant does not appear at the time the case is called for a violation of the Vehicle Code, authorizes the court to declare the bail forfeited and order that no further proceedings be had in the case, or to issue a warrant for the arrest of the defendant. However, if a defendant is charged with specified crimes, including disposing of a flaming or glowing substance on or near a road and littering a highway, has previously been convicted of the same crime, and fails to appear at the time the case is called to trial, existing law authorizes the court to declare the bail forfeited and requires the court to issue a bench warrant for the arrest of the person charged, unless the magistrate finds that undue hardship will be imposed by requiring the defendant to appear.\n\nThis bill would remove the requirement that the magistrate issue a bench warrant when the person has committed one of the crimes specified above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Kalra", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Kalra\"}", "organization_id": null}, {"name": "Lowenthal", "classification": "author", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Lowenthal\"}", "organization_id": null}, {"name": "Harabedian", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Harabedian\"}", "organization_id": null}, {"name": "Pérez", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"P\\u00e9rez\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2122", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2122", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2122&version=20250AB212299INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2122", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 19.7, 853.7, 853.8, 978.5, and 1043 of the Penal Code, and to amend Sections 1803, 40508, 40510.5, 40512, 40512.5, 40514, and 40515 of the Vehicle Code, relating to crimes.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:29+00:00", "_id": "1f0d54ca-0fcb-11f1-9ce2-72e66fa16e68"}