{"legislative_session": "20252026", "identifier": "AB2224", "title": "County recorders: fees.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Countyrecorders", "fees"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the office of county recorder and requires the county recorder to accept for recordation any instrument, paper, or notice that is authorized or required to be recorded, subject to the collection of specified fees.\n\nThis bill would require the county recorder to provide access to a true copy of the public record for each recorded instrument, paper, or notice, as specified. By imposing new duties on county recorders, the bill would impose a state-mandated local program.\n\nExisting law prohibits the fee for recording and indexing an instrument, paper, or notice from exceeding $10 for recording the first page and $3 for each additional page, which charges are to reimburse the county for the costs of services rendered. Existing law requires the county recorder to impose additional recording fees of $1 per page for nonconforming print spacing and $3 per page for nonconforming page dimensions. Existing law requires $1 of each $3 fee for each additional page to be deposited in the county general fund.\n\nThe bill would, instead, set the fee for recording and indexing at $15 for recording the first page and $4 for each additional page, and would prohibit the fees from exceeding the reasonable costs of the county recorder's office for providing these services. The bill would delete the provisions requiring $1 and $3 fees for nonconforming spacing and page dimensions, and $1 of each $3 fee for each additional page to be deposited in the county general fund. The bill would require the county recorder collecting a prescribed fee to implement an electronic recording delivery system, and would provide that various other fees are restricted, as prescribed, or solely for the county recorder's office, as specified.\n\nExisting law authorizes a county recorder to charge an additional fee of $1 for specified documents requiring additional indexing based on the number of names listed and for each reference to a previously recorded document, other than the first such reference, as specified.\n\nThe bill would repeal these provisions.\n\nExisting law authorizes the county board of supervisors to provide for an additional fee of $1 for each instrument, paper, or notice of record to order to defray the cost of converting the county recorder's document storage system to micrographics. Existing law provides for that, upon completing this conversation and payment of costs, this fee would no longer be imposed.\n\nThe bill would, instead, specify the above-described $1 fee is to defray the cost of archiving as determined by the county recorder, and would delete the above described provisions related to micrographics conversion, thereby extending this fee indefinitely.\n\nThe bill would include related legislative findings concerning county recorders and county recorder fees.\n\nBy imposing new duties on counties relative to recording fees, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Hadwick", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Hadwick\"}", "organization_id": null}, {"name": "Bennett", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Bennett\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2224", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2224", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2224&version=20250AB222499INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2224", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 27201, 27361, 27361.4, and 27388.2 of, and to repeal Sections 27361.2 and 27361.8 of, the Government Code, relating to local government.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:32+00:00", "_id": "20775838-0fcb-11f1-9ce2-72e66fa16e68"}