{"legislative_session": "20252026", "identifier": "AB2494", "title": "State forests: forest management.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Stateforests", "forestmanagement"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law authorizes the Department of Forestry and Fire Protection to engage in management of state forests and defines \"management\" for purposes of the state forests as a means of handling forest crop and forest soil to achieve maximum sustained production of high-quality forest products while giving consideration to values relating to, among other values, recreation, watershed, and wildlife, as provided.\n\nThis bill would redefine \"management\" for purposes of state forests as the handling of forest vegetation and soils within state forests for biodiversity conservation and fire resilience, while maximizing the promotion of durable onsite carbon storage and sequestration, climate resiliency goals, equitable forest access, wildlife and recreation opportunities, and compatible research efforts.\n\n(2) Existing law declares it is in the interest of the welfare of the people of the state and their industries and other activities involving the use of wood, lumber, poles, piling, wood pulp, and other forest products that desirable cutover forest lands be made fully productive and that the holding and reforestation of such lands is a necessary measure predicated on waning supplies of original old growth timber, as provided. Existing law further declares it is in the interest of the welfare of the people of the state that the state retain the existing land base of state forests in timber production for research and demonstration.\n\nThis bill would instead declare that desirable forest lands should be restored to fulfill ecological conditions and processes, and managed consistent with the definition of management, and would further declare policy of the state to be to respect California Native American tribal sovereignty and to seek opportunities for comanagement and integration of indigenous traditional ecological knowledge in forest management. The bill would instead declare that the state should retain the existing land base of state forests primarily for research and demonstration purposes and allow the sale of timber and other forest products only when harvest occurs for ecological restoration or research purposes.\n\n(3) Existing law requires the management of state forests and the cutting and sale of timber and other forest products from state forests to conform with regulations prepared by the Director of Forestry and Fire Protection and approved by the State Board of Forestry and Fire Protection. Existing law requires the regulations to conform with forest management practices designed to achieve maximum sustained production of high-quality forest products while giving consideration to values relating to, among other values, recreation, watershed, and wildlife, as specified. Existing law authorizes state forest lands to be used for grazing and mining purposes pursuant to regulations established by the board. Under existing law, a person who violates the rules and regulations pertaining to the state forests established by the board is guilty of a misdemeanor. \n\n The bill would prohibit the sale of timber and other forest products from state forests unless harvest occurs for ecological restoration or research purposes in a manner consistent with the definition of management, as provided. The bill would repeal the authorization for state forest lands to be used for mining purposes. The bill would require the regulations concerning the management of state forests and the cutting and sale of timber and other forest products to prioritize management practices, as specified. The bill would require the regulations permitting grazing on state forest lands to be updated to reflect the redefinition of management. Because a violation of these regulations would be a crime, the bill would impose a state-mandated local program. \n\n(4) Existing law requires the Secretary of the Natural Resources Agency, in consultation with the Secretary for Environmental Protection, to submit a report to the Joint Legislative Budget Committee on the activities of all state departments, agencies, and boards relating to forest and timberland regulation, as specified. \n\nThis bill would, among other changes to the report, require the report include additional information including, among other things, any identified staffing needs, by department, and costs per position, to support a more efficient review of timber harvest plans.\n\n(5) Existing law authorizes the department to collect recreational user fees for overnight camping and reserved group activities in a demonstration state forest. Existing law requires all user fees collected by the department to be deposited into the Forest Resources Improvement Fund and requires the fees to be used, upon appropriation by the Legislature, to reimburse the department's cost of maintaining and improving the campground facilities, associated recreational facilities, natural environment, and access thereto. Under existing law, the Forest Resources Improvement Fund is the depository for all revenue derived from the receipts from the sale of forest products, as defined, from state forests to support specified operations. Existing law authorizes money in the Forest Resource Improvement Fund to only be expended, upon appropriation by the Legislature, for the cost of operations associated with management of lands held in trust by the state and operated as demonstration state forests, as specified.\n\n Existing law creates the Timber Regulation and Forest Restoration Fund in the State Treasury and requires that specified revenues received from a lumber or engineered wood products assessment, less amounts deducted for refunds and reimbursements, be deposited in the Timber Regulation and Forest Restoration Fund and, upon appropriation by the Legislature, be used for specified purposes, including for forest resources improvement grants and projects administered by the department.\n\nThis bill would instead require that all recreational user fees received by the department be deposited into the Timber Regulation and Forest Restoration Fund, as provided. The bill would instead also require that all revenue derived from the receipts from the sales of forest products, and any other funds generated by a demonstration state forest, be deposited in the Timber Regulation and Forest Restoration Fund, except as provided. The bill would require moneys deposited in the Timber Regulation and Forest Restoration Fund to, upon appropriation by the Legislature, be expended to support demonstration state forests, as provided.\n\n(6) The California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Rogers", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Rogers\"}", "organization_id": null}, {"name": "McGuire", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"McGuire\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2494", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2494", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2494&version=20250AB249499INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2494", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 4629.6, 4629.8, 4629.9, 4631, 4631.5, 4639, 4651, 4652, and 4656 of, and to add Section 4649.5 to, the Public Resources Code, relating to state forests.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:20+00:00", "_id": "a762f89a-0f01-11f1-bd68-62084ebb1ff2"}