{"legislative_session": "20252026", "identifier": "AB1060", "title": "Local government: legal fee disclosures.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Localgovernment", "legalfeedisclosures"], "abstracts": [{"note": "summary", "abstract": "Existing law requires the city attorney to advise the city officials in all legal matters pertaining to city business and to perform other legal services required from time to time by the legislative body. Existing law requires a city attorney to receive compensation as is allowed by the legislative body.\n\nThis bill would require all invoices for work by the city attorney, or by any other attorney who is seeking, or has sought, compensation from a city, to be made available, without redaction, to each member of the city council promptly upon that member's request. The bill would require a member of the city council who receives an invoice to maintain the confidentiality of any confidential information contained in the invoice. \n\nExisting law authorizes the governing board of a school district to contract with a qualified attorney in private practice to provide legal services and provides that the compensation of the attorney is a proper use of school district funds, as provided.\n\nUnder existing law, every community college district is under the control of a board of trustees, known as the governing board. Existing law authorizes the governing board to initiate and carry on any program, activity, or otherwise act in any manner that is not in conflict with or inconsistent with, or preempted by, any law and that is not in conflict with the purposes for which community college districts are established.\n\nThis bill would require all invoices for work by an attorney who is seeking, or has sought, compensation from a school district or a community college district, to be made available, without redaction, to each member of the governing board of the school district or community college district upon that member's request. The bill would require a member of the governing board who receives an invoice to maintain the confidentiality of any confidential information contained in the invoice.\n\nThis bill would also require a city, school district, or community college district to prepare and update at least bimonthly a summary of all legal expenses incurred by the city, school district, or community college district, to publish the summary in a conspicuous location on its internet website, and to make the summary available for public inspection. The bill would provide an exception to that disclosure requirement for legal fees related to a pending and active litigation matter and for any other information protected by the attorney-client privilege.\n\nBy imposing new duties on local governmental agencies, the bill would impose a state-mandated local program.\n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2025-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 23.", "date": "2025-02-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Referred to Coms. on L. GOV. and JUD.", "date": "2025-03-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Coms. on L. GOV. and JUD.", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Ávila Farías", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"\\u00c1vila Far\\u00edas\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1060", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1060", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/25 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1060&version=20250AB106099INT", "media_type": "application/pdf"}], "date": "2025-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1060", "note": ""}], "extras": {"impact_clause": "An act to amend Section 41804 of, and to add Sections 41806, 50079.7 and 50079.8 to, the Government Code, relating to local government.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2025-12-06T08:37:13+00:00", "_id": "c39afd1a-d27e-11f0-9f93-aeeae4d45dc3"}