{"legislative_session": "20252026", "identifier": "AB2433", "title": "Housing development: affordable homes bonus.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Housingdevelopment", "affordablehomesbonus"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law, commonly referred to as the Density Bonus Law, requires a city or county to grant a density bonus, other incentives or concessions, and waivers or reductions of development standards, as specified, to an applicant for a housing development when the applicant seeks a density bonus for the housing development, as specified, if the applicant agrees to construct, among other things, a specified percentage of units for very low income, lower income, or senior citizen housing, and meets other requirements.\n\nThis bill would, instead, require a city or county to grant an affordable homes bonus, other incentives or concessions, and waivers or reductions of development standards, as specified, to an applicant for a housing development when the applicant submits an application for a housing development that a city, county, or city and county determines meets specified criteria, including, among others, the housing development includes specified percentage of units for very low income, lower income, or senior citizen housing. The bill would name the provisions commonly referred to as the \"Density Bonus Law\" as the \"Affordable Homes Bonus Program\" and make conforming changes related to the name change.\n\n(2) Existing law defines various terms for the purposes of the Density Bonus Law, including, among others, moderate-income households, lower income households, and very low income households. \n\nThis bill would provide that the definition of moderate-income household includes lower income households, very low income households, and extremely low income households, as defined. The bill would provide that the definition of lower income households also includes very low income households and extremely low income households. The bill would provide that the definition of very low income households also includes extremely low income households.\n\n(3) Existing law defines density bonus for the purposes of the Density Bonus Law to mean a density increase over the otherwise base density, as specified. Existing law specifies the base density calculation standards and requires base density to be determined using dwelling units per acre, except as otherwise provided. For the purpose of calculating a density bonus, existing law requires the residential units to be on contiguous sites that are the subject of one development application, as specified. Existing law also requires the density bonus to be permitted in geographic areas of the housing development other than the areas where the units for the lower income households are located.\n\nThis bill would revise the base density calculation standards to allow an applicant to use a site's entire floor area ratio for residential use, as specified, to calculate the base density on the realistic development capacity of the site's entire floor area ratio, if the applicable zoning ordinance, specific plan, or land use element of the general plan establish a floor area ratio standard where at least a portion of the floor area ratio may be used for residential purposes. The bill would include in the definition of density bonus, if the applicant elects to use the floor area ratio of the site for residential use for purposes of calculating the base density, the increase in the floor area ratio of the site.\n\nThis bill would remove the provisions requiring the residential units to be on contiguous sites that are the subject of one development application and requiring the density bonus to be permitted in geographic areas of the housing development other than the areas where the units for the lower income households are located. The bill would instead require a density bonus, incentive or concession, or waiver or reduction of development standards to be permitted within or outside the geographic areas of the housing development where the affordable or market-rate units are located.\n\n(4) Existing law requires a city or county to adopt procedures and timelines for processing a density bonus application and to notify the applicant for a density bonus whether the application is complete in a manner consistent with specified timelines.\n\nThis bill would require a city or county to adopt procedures and timelines for notifying an applicant of a housing development that the housing development is eligible for an affordable homes bonus, incentive or concession, or waiver or reduction of development standards pursuant to these provisions.\n\n(5) Existing law authorizes an applicant for a density bonus to submit to a city or county a proposal for the specific incentives or concessions that the applicant requests and requires the city or county to grant the concession or incentive requested by the applicant unless the city or county makes a certain written finding, based upon substantial evidence. Existing law specifies the number of incentives or concessions an applicant is eligible to receive based on certain criteria.\n\nThis bill would increase the number of incentives or concessions an applicant is eligible to receive.\n\n(6) The California Environmental Quality Act (CEQA) requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of an environmental impact report on a project that it proposes to carry out or approve that may have a significant effect on the environment or to adopt a negative declaration if it finds that the project will not have that effect. CEQA also requires a lead agency to prepare a mitigated negative declaration for a project that may have a significant effect on the environment if revisions in the project would avoid or mitigate that effect and there is no substantial evidence that the project, as revised, would have a significant effect on the environment. Existing law exempts from CEQA any aspect of a housing development project, as defined, including any permits, approvals, or public improvements required for the housing development project if the housing development project meets specified conditions, including, among other things, the project is consistent with the applicable general plan and zoning ordinance, as well as any applicable local coastal program.\n\nThis bill would require a housing development project that satisfies the requirements related to the above-described CEQA exemption and is eligible for a density bonus, incentives or concessions, and waivers or reductions of development standards for purposes of the Affordable Homes Bonus Program to be a use by right and subject to ministerial review.\n\n(7) Existing law specifies that the granting of a density bonus or incentive or concessions shall not require or be interpreted to require a general plan amendment, local coastal plan amendment, zoning change, or other discretionary approval.\n\nThis bill would specify that the granting of a waiver or reduction of development standards shall not require or be interpreted to require a general plan amendment, local coastal plan amendment, zoning change, or other discretionary approval. The bill would also specify that the granting of a density bonus, incentive or concession, or waiver or reduction of development standards shall be discretionary. The bill would specify that the granting of a density bonus, incentive or concession, or waiver or reduction of development standards shall not require or be interpreted to require environmental review under CEQA.\n\n(8) Existing law, the Bagley-Keene Open Meeting Act, requires, with specified exceptions, that all meetings of a state body be open and public and all persons be permitted to attend any meeting of a state body. Existing law requires the notice of a meeting of a body that is a state body to include a specific agenda for the meeting, containing a brief description of the items of business to be transacted or discussed in either open or closed session. Existing law, the Ralph M. Brown Act, requires the meetings of the legislative body of a local agency to be conducted openly and publicly, with specified exceptions. Existing law requires that the legislative body of a local agency post an agenda, as specified, at least 72 hours before a regular meeting of that body. Existing law requires the agenda to contain a brief general description of each item of business to be transacted or discussed at the meeting, including items to be discussed in closed session.\n\nThis bill would require, for the purpose of meetings held pursuant to the Bagley-Keene Open Meeting Act or the Ralph M. Brown Act, an agenda item discussing or considering the approval of any element of a project that is eligible for an affordable homes bonus, incentive or concession, or waiver or reduction of development standards pursuant to these provisions to clearly list in the agenda title the words \"affordable homes density project\" or \"density bonus project.\"\n\n(9) The bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\n(10) By imposing new requirements on local governments, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Alvarez", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Alvarez\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2433", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2433", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2433&version=20250AB243399INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2433", "note": ""}], "extras": {"impact_clause": "An act to amend Section 65915 of the Government Code, relating to housing.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:19+00:00", "_id": "a69de8b6-0f01-11f1-bd68-62084ebb1ff2"}