{"legislative_session": "20252026", "identifier": "AB2235", "title": "The Judicial Home Security Act.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["TheJudicialHomeSecurityAct"], "abstracts": [{"note": "summary", "abstract": "Existing law authorizes a person who faces threats of violence or violence and harassment from the public because of their work for a public entity to apply to the Secretary of State for the purposes of enabling state and local agencies to respond to requests for public records without disclosing a program participant's residence address contained in any public record and otherwise provide for confidentiality of identity for that person, subject to specified conditions. Under existing law, any person who makes a false statement in an application is guilty of a misdemeanor.\n\nThis bill would establish the Judicial Home Security Act, which would require the Attorney General to establish a program for a current or former judicial officer who is domiciled in California to apply to have a designated alternate mailing address substituted for any reference to the person's home address in records that are made public. The bill would establish the Judicial Home Security Program Fund in the General Fund and authorize moneys in the fund to be made available for the administration of the program upon appropriation by the Legislature.\n\nThe bill would require the Attorney General to approve an application if it is filed in the manner and on the form prescribed by the Attorney General and contains all prescribed information, including, among other things, documentation showing the individual is to commence employment or is currently or formerly employed as a judicial officer, a sworn statement that the applicant fears for their safety or the safety of their family due to their employment as a judicial officer, and an alternate mailing address requested for substitution for any reference to the person's home address in public records. The bill would require the application to be dated and signed under penalty of perjury. Under the bill, it would be a misdemeanor for a person to knowingly provide false or incorrect information in the application, and the bill would require a notice to be printed in the application informing the applicant.\n\nThe bill would require the Attorney General to create, maintain, and update monthly a publicly available list that includes information for each current program participant, including their name, county of residence, and designated alternate mailing address. The bill would also require the Attorney General to create, maintain, and update monthly a list that includes former participants who are no longer in the program, and make the list available to state and local agencies and third-party data brokers and aggregators.\n\nThe bill would require, when disclosing or releasing records or information that would otherwise contain the home address of a program participant in any format or medium, a state or local agency to substitute the participant's alternate mailing address for any reference to the participant's home address. The bill would require, when disclosing or releasing records or information that would otherwise contain the situs of the home address of a program participant in any format or medium, County Assessor and Recorder offices to substitute the program participant's alternate mailing address for the situs address on real property deeds, real estate records, and any other records containing the home address of a program participant.\n\nThe bill would prohibit the disclosure of a participant's home address by the Attorney General and state and local agencies except in specified circumstances. The bill would prohibit a person or organization from publicly posting or displaying the home address of a program participant, including on the internet, and would prohibit a third-party data broker or aggregator from selling, licensing, trading, purchasing, transferring, releasing, or otherwise sharing in any format or medium, the home address of a program participant, including on the internet.\n\nThe bill would authorize the Attorney General to adopt guidance to facilitate the administration of the act by state and local agencies. The bill would require the Attorney General to submit to the Legislature, no later than January 10 of each year, a report that includes the total number of applications received for the program.\n\nBy imposing new duties on local agencies and expanding the scope of the crime of perjury, this bill would create a state-mandated local program.\n\nExisting constitutional provisions require that a statute that limits the right of access to the meetings of public bodies or the writings of public officials and agencies be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\nThis bill would make legislative findings to that effect.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Pacheco", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Pacheco\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2235", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2235", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2235&version=20250AB223599INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2235", "note": ""}], "extras": {"impact_clause": "An act to add Chapter 3.4 (commencing with Section 6225) to Division 7 of Title 1 of the Government Code, relating to courts.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:14+00:00", "_id": "a4369b90-0f01-11f1-bd68-62084ebb1ff2"}