{"legislative_session": "20252026", "identifier": "SB1292", "title": "Enhanced curb management system.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Enhancedcurbmanagementsystem"], "abstracts": [{"note": "summary", "abstract": "Existing law authorizes, until January 1, 2030, a local agency, as defined, to install automated forward facing parking control devices on city-owned or district-owned parking enforcement vehicles for the purpose of taking photographs of parking violations occurring in bicycle lanes. Existing law requires a designated employee of a city, county, city and county, or a contracted law enforcement agency for a special transit district, who is qualified by the city and county or the district to issue parking citations, to review photographs for the purpose of determining whether a parking violation occurred in a bicycle lane and to issue a notice of violation to the registered owner of a vehicle within 15 calendar days, as specified. Existing law requires these photographic records to be confidential and makes these records available only to public agencies to enforce parking violations. Existing law requires any local agency that implements this pilot program to report to specified committees of the Legislature on the system's effectiveness and impact on traffic outcomes, among other things, by December 31, 2028.\n\nThis bill would authorize a local agency, as defined, to establish an enhanced curb management system (system) that records images of vehicles for the purpose of enforcing parking violations or automating parking payments if certain requirements are met. The bill would require the governing body of the local agency to adopt a public ordinance or resolution that would authorize the use of a system in specified locations, including, among others, passenger loading zones and commercial loading zones. The bill would require a local agency that automates parking payments by charging vehicles a fee for access to outline the fee, and any adjusted rates, in an ordinance or resolution.\n\nThis bill would require the system to record images of the vehicle and license plate at the time of the violation, and requires, before mailing a notice of parking violation, that the image data be reviewed and approved by a peace officer or person authorized to enforce parking laws. The bill would require the notice of violation to be mailed to the registered owner of the vehicle within 15 calendar days, as specified. The bill would require the image data collected by the system and any identifying information to be confidential, and would require the image data to only be used for the purpose of processing parking violations and charging vehicles a fee for access.\n\nThis bill would require a local agency to observe a public information campaign for at least 60 days before issuing citations, as specified. The bill would require a local agency to report periodically to the Legislature on the system's impact, as specified.\n\nExisting constitutional provisions require that a statute that limits the right of access to the meetings of public bodies or the writings of public officials and agencies be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\nThis bill would make legislative findings to that effect."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Richardson", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Richardson\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1292", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1292", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1292&version=20250SB129299INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1292", "note": ""}], "extras": {"impact_clause": "An act to add Article 5 (commencing with Section 40275) to Chapter 1 of Division 17 of the Vehicle Code, relating to vehicles.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:43:58+00:00", "_id": "76c2f8f2-0f01-11f1-bd68-62084ebb1ff2"}