{"legislative_session": "20252026", "identifier": "AB2200", "title": "Controlled environment horticulture space: thermal curtains.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Controlledenvironmenthorticulturespace", "thermalcurtains"], "abstracts": [{"note": "summary", "abstract": "Existing law, the California Building Standards Law, establishes the California Building Standards Commission within the Department of General Services. Existing law requires the commission to approve and adopt building standards and to codify those standards in the California Building Standards Code. Existing law requires the commission to publish, or cause to be published, editions of the code in its entirety once every 3 years. Existing law requires the responsibility for the enforcement and administration of building standards to remain in the state or local agency, as specified.\n\nThis bill, notwithstanding any other law, would require a controlled environment horticulture space, as defined, that uses single-paned windows and either thermal curtains, shade cloths, or equivalent technologies, to be considered compliant under the California Energy Code. The bill would require that provision to remain in effect until the next triennial update of the California Building Standards Code. The bill would also require the commission to, commencing with the next triennial edition of the California Building Standards Code and in consultation with the Energy Commission and the Department of Food and Agriculture, develop and adopt building standards to allow controlled environmental horticulture spaces or conditioned greenhouses to use thermal curtains, thermal screens, shade cloths, or equivalent technologies, in lieu of the requirements for double-paned windows or two or more glazings separated by either air or gas glazing. By increasing the duties of local officials, this bill would impose a state-mandated local program.\n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Hart", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Hart\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2200", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2200", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2200&version=20250AB220099INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2200", "note": ""}], "extras": {"impact_clause": "An act to add Section 18944.22 to the Health and Safety Code, relating to building standards.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:59+00:00", "_id": "41b60dd8-0e3a-11f1-a618-2a6200350f1a"}