{"legislative_session": "20252026", "identifier": "AB2178", "title": "Community colleges: county probation departments: instructional service agreements.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Communitycolleges", "countyprobationdepartments", "instructionalserviceagreements"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the California Community Colleges, under the administration of the Board of Governors of the California Community Colleges, as one of the segments of public postsecondary education in this state. Existing law establishes community college districts throughout the state and authorizes them to operate campuses and provide instruction.\n\nExisting law authorizes the governing board of a community college district to enter into a College and Career Access Pathways (CCAP) partnership with the governing board of a school district, a county office of education, or the governing body of a charter school for the purpose of offering or expanding dual enrollment opportunities for pupils who may not already be college bound or who are underrepresented in higher education, as provided. Existing law authorizes the office of the Chancellor of the California Community Colleges to establish the Rising Scholars Network to enter into agreements with community colleges to provide additional funds for services in support of postsecondary education for justice-involved students, as defined.\n\nThis bill, the Juvenile Justice Education Access and Equity Act, would authorize a home community college district, as defined, or an eligible institution associated with the home community college district, to enter into an instructional services agreement with a county probation department to provide academic or career technical education courses at a juvenile justice facility operated by the county probation department. The bill would authorize a non-home community college district, or an eligible institution associated with the non-home community college district, to enter into an instructional services agreement with a county probation department if the home community college district and associated eligible institutions are unable, unwilling, or fail to provide requested academic or career technical education courses to a juvenile justice facility within 90 days of a written request from the administrator of the juvenile justice facility. The bill would prohibit the home community college district and associated eligible institutions from prohibiting, blocking, or otherwise interfering with the ability of the non-home community college district, or an eligible institution associated with the non-home community college district, to provide instruction at the juvenile justice facility, as provided."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Quirk-Silva", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Quirk-Silva\"}", "organization_id": null}, {"name": "Pacheco", "classification": "author", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Pacheco\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2178", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2178", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2178&version=20250AB217899INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2178", "note": ""}], "extras": {"impact_clause": "An act to add Article 6.5 (commencing with Section 78078) to Chapter 1 of Part 48 of Division 7 of Title 3 of the Education Code, relating to community colleges.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:31+00:00", "_id": "1fc6961a-0fcb-11f1-9ce2-72e66fa16e68"}