{"legislative_session": "20252026", "identifier": "AB1770", "title": "Arbitration: health care service plans and health insurers.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Arbitration", "healthcareserviceplansandhealthinsurers"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Knox-Keene Health Care Service Plan Act of 1975, provides for the licensure and regulation of health care service plans by the Department of Managed Health Care. Existing law provides that a willful violation of provisions regulating health care service plans is a crime. Existing law provides for the regulation of health insurers by the Department of Insurance. Existing law requires a health care service plan contract and any disability insurance policy that includes terms requiring binding arbitration for dispute settlement to provide a specified disclosure to subscribers, enrollees, or insureds. Existing law, the California Arbitration Act, provides a statutory framework for the enforcement of contractual arbitration under California law. Existing law establishes standards for arbitration, and requires a court to vacate an arbitration award if it makes certain findings.\n\n The bill would require the disclosure provided to subscribers, enrollees, or insureds to include a statement that the parties are able to appeal the result of an arbitration on the basis of legal or factual error made by the arbitrator and would require the disclosure to be provided to a subscriber, enrollee, or insured annually.\n\nThis bill would also require, by no later than February 1, 2027, the Department of Managed Health Care to create a panel of qualified arbitrators, as defined, and would require any arbitration between a health care service plan and an enrollee or subscriber, or between a health care insurer and an insured, to be conducted by an arbitrator selected by the department. The bill would specify the process for selection of an arbitrator and would require a health care service plan or health insurer to be responsible for the costs of the arbitrator appointed pursuant to these provisions. The bill would require that a court reporter be present for an arbitration proceeding and would make the health care service plan or health insurer responsible for the cost of the court reporter. The bill would require the arbitrator to complete a report within 30 days of the completion of arbitration, to include, among other things, the amount of an award, if any, and the reasons for any award rendered or denied. The bill would also require all documents relating to the arbitration to be preserved by the health care service plan or health insurer and would require a copy of the documents to be provided the Director of the Department of Managed Health Care and to be maintained by the department for 5 years. The bill would require that all records of arbitration pursuant to these provisions be available to the public, except as specified. Because a violation of these provisions by a health care service plan would be a crime, this bill would impose a state-mandated local program.\n\nExisting constitutional provisions require that a statute that limits the right of access to the meetings of public bodies or the writings of public officials and agencies be adopted with findings demonstrating the interest protected by the limitation and the need for protecting that interest.\n\nThis bill would make legislative findings to that effect.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 12.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Garcia", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Garcia\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1770", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1770", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/09/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1770&version=20250AB177099INT", "media_type": "application/pdf"}], "date": "2026-02-09", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1770", "note": ""}], "extras": {"impact_clause": "An act to amend Section 1363.1 of, to repeal Section 1373.19 of, and to repeal and add Sections 1373.20 and 1373.21 of, the Health and Safety Code, and to repeal and add Section 10123.19 of the Insurance Code, relating to arbitration.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:52+00:00", "_id": "3d9af470-0e3a-11f1-a618-2a6200350f1a"}