{"legislative_session": "20252026", "identifier": "AB1073", "title": "Judicial officers: disqualification.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Judicialofficers", "disqualification"], "abstracts": [{"note": "summary", "abstract": "Existing law authorizes a party or attorney in an action or proceeding to move to disqualify a judge, court commissioner, or referee for prejudice against a party or attorney or the interest of a party or attorney, as specified. Prejudice may be established by an oral or written motion without notice supported by affidavit or declaration under penalty of perjury, or an oral statement under oath, that the judge, court commissioner, or referee is prejudiced against a party or attorney, or the interest of the party or attorney, so that the party or attorney cannot, or believes that they cannot, have a fair and impartial trial or hearing. Existing law requires, in specified circumstances, the Chair of the Judicial Council to assign some other judge, court commissioner, or referee to try the cause or hear the matter as promptly as possible.\n\nThis bill would extend these provisions to authorize a party or attorney to disqualify a justice or justices of an appellate court for prejudice against a party or attorney, or the interest of a party or attorney, as specified. The bill would make related findings and declarations.\n\nThis bill would require, following reversal by the California Supreme Court and remand to a court of appeal for further proceedings, other than of a ministerial nature, the presiding justice of the court of appeal to assign the case to a panel of three justices and to notify the parties of the assignment within 30 days of issuance of the remittitur to the court of appeal. The bill would authorize a motion directed to one or more justices of a court of appeal to only be made following reversal by the California Supreme Court of a court of appeal's decision, where the court of appeal is required to conduct further proceedings other than of a ministerial nature, and may only be directed to the justice or justices who authored or concurred in the prior decision and who is or are assigned to further consider the matter. The bill would authorize the party who obtained the reversal to make that motion regardless of whether that party or side has previously done so. The bill would require, for cases reversed on or after January 1, 2026, the motion to be made within 15 days after the party or the party's attorney has been notified of the assignment. The bill would require, for cases reversed before January 1, 2026, and remaining pending as of the effective date of this act, the motion to be made on or before January 16, 2026. The bill would authorize, upon presentation of a motion directed to one or more justices of a court of appeal, the presiding justice to, at the presiding justice's discretion, assign up to 3 new justices regardless of the number of justices to whom the motion is directed.\n\nThis bill would require, if the motion is duly presented and the affidavit or declaration under penalty of perjury is duly filed or an oral statement under oath is duly made, that the presiding justice assign other justice or justices or transfer the case to another panel of justices. The bill would also require, in specified circumstances, the Chair of the Judicial Council to assign some other justice or justices to hear the matter as promptly as possible.\n\nThe bill would make the above provisions operative from January 1, 2026, until January 1, 2031.\n\nThe bill would require the California Law Revision Commission to deliver, on or before September 30, 2028, a study regarding the recusal of judicial officers for prejudice and conflict of interest, as specified. The bill would require the California Law Revision Commission to consult with the Commission on Judicial Performance in developing the study.\n\nThis bill would make these provisions inoperative on September 30, 2031, and would repeal them as of January 1, 2032."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2025-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 23.", "date": "2025-02-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}, {"description": "Referred to Com. on JUD.", "date": "2025-03-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["referral-committee"], "related_entities": [{"name": "Com. on JUD.", "entity_type": "organization", "organization_id": null}]}], "sponsorships": [{"name": "Ávila Farías", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"\\u00c1vila Far\\u00edas\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1073", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1073", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/25 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1073&version=20250AB107399INT", "media_type": "application/pdf"}], "date": "2025-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1073", "note": ""}], "extras": {"impact_clause": "An act to amend, repeal, and add Section 170.6 of, and to add and repeal Section 170.6.1 of, the Code of Civil Procedure, relating to courts.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2025-12-31T08:40:59+00:00", "_id": "6eb442b6-e624-11f0-8b51-1283ff670ff7"}