{"legislative_session": "20252026", "identifier": "AB1749", "title": "Impeding emergency response with drone.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Impedingemergencyresponsewithdrone"], "abstracts": [{"note": "summary", "abstract": "Existing law makes it a crime for a person to operate or use an unmanned aerial vehicle, remote piloted aircraft, or drone at the scene of an emergency for the purpose of viewing the scene or emergency or military personnel, and thereby impede the emergency or military personnel, in the performance of their duties in coping with the emergency. Existing law excuses a local public entity or public employee from liability for damage to an unmanned aircraft or unmanned aircraft system, if the damage was caused while the local public entity or public employee of a local public entity was providing, and the unmanned aircraft or unmanned aircraft system was interfering with, the operation, support, or enabling of any emergency service, as specified. Existing law imposes liability for physical invasion of privacy on a person if the person knowingly enters onto the land or into the airspace above the land of another person without permission or otherwise commits a trespass in order to capture any image or recording of the other person engaging in a private activity and the invasion occurs in a manner that is offensive to a reasonable person. \n\nThis bill would prohibit a person from operating or using an unmanned aerial vehicle, remote piloted aircraft, or drone at the scene of an emergency and thereby impeding firefighters, peace officers, medical personnel, military personnel, or other emergency personnel in the performance of their fire suppression, law enforcement, or emergency response duties, unless the person has a federal operational waiver, as specified, or it is part of their employment duties to view the scene or activities. The bill would authorize the Attorney General or a county counsel or city attorney to bring civil action to enforce the prohibition and authorize a prevailing plaintiff to recover civil penalties, injunctive relief, or reasonable attorney's fees and costs, as specified."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 12.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Dixon", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Dixon\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1749", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1749", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/09/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1749&version=20250AB174999INT", "media_type": "application/pdf"}], "date": "2026-02-09", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1749", "note": ""}], "extras": {"impact_clause": "An act to add Section 1708.83 to the Civil Code, relating to civil law.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-12T09:00:57+00:00", "_id": "585efe90-07f1-11f1-8856-36e757393db5"}