{"legislative_session": "20252026", "identifier": "AB2017", "title": "State holidays: Eid.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Eid", "Stateholidays"], "abstracts": [{"note": "summary", "abstract": "Existing law designates specific days as holidays in this state. Existing law adopts state holidays as judicial holidays, with certain exceptions, including Admission Day and Columbus Day. Existing law designates holidays on which community colleges and public schools are authorized to close pursuant to a memorandum of understanding between the governing board and represented employees, including \"Native American Day\" on the 4th Friday in September.\n\nThis bill would add \"Eid al-Fitr\" and \"Eid al-Adha\" to the list of state holidays. The bill would exclude \"Eid al-Fitr\" and \"Eid al-Adha\" from designation as judicial holidays. The bill would authorize community colleges and public schools to close on \"Eid al-Fitr\" and \"Eid al-Adha,\" as specified.\n\nExisting law, notwithstanding the requirement that each person between 6 and 18 years of age who is not otherwise exempted is subject to compulsory full-time education, requires a pupil to be excused from school for specified types of absences, including, among others, an absence for justifiable personal reasons including, but not limited to, observance of a holiday or ceremony of the pupil's religion, if the pupil's absence is requested in writing by the parent or guardian and approved by the principal or a designated representative, as specified.\n\nThis bill would add an absence for purposes of observing \"Eid al-Fitr\" or \"Eid al-Adha\" to the list of required excused absences. To the extent the bill would impose additional duties on school officials, the bill would impose a state-mandated local program.\n\nExisting law entitles state employees, with specified exceptions, to be given time off with pay for specified holidays. Existing law, in addition, authorizes state employees to elect to use 8 hours of vacation, annual leave, compensating time off, or personal holiday credit corresponding with specified dates.\n\nThis bill would, similarly, authorize state employees to elect to use 8 hours of vacation, annual leave, compensating time off, or personal holiday credit corresponding with \"Eid al-Fitr\" or \"Eid al-Adha,\" as specified.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-17", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 20.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Haney", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Haney\"}", "organization_id": null}, {"name": "Wahab", "classification": "principal coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Wahab\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2017", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2017", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/17/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2017&version=20250AB201799INT", "media_type": "application/pdf"}], "date": "2026-02-17", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2017", "note": ""}], "extras": {"impact_clause": "An act to amend Section 135 of the Code of Civil Procedure, to amend Sections 37220.7, 45203, 48205, 79020, and 88203 of the Education Code, and to amend Sections 6700, 19853, and 19853.1 of the Government Code, relating to state holidays.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:56+00:00", "_id": "3ff508a0-0e3a-11f1-a618-2a6200350f1a"}