{"legislative_session": "20252026", "identifier": "SB1117", "title": "Accessory dwelling units and junior accessory dwelling units.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Accessorydwellingunitsandjunioraccessorydwellingunits"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Planning and Zoning Law, among other things, provides for the creation by ordinance, or by ministerial approval if the local agency has not adopted an ordinance, of an accessory dwelling unit (ADU) in accordance with specified standards and conditions. Existing law requires fees charged for the construction of ADUs to be determined in accordance with specified provisions of the Mitigation Fee Act. Existing law prohibits a local agency, special district, or water corporation from imposing any impact fee upon the development of an ADU that has 750 square feet of interior livable space or less, and requires any impact fees charged for an ADU that has more than 750 square feet of interior livable space to be charged proportionately in relation to the square footage of the primary dwelling unit.\n\nThis bill would additionally require the charge to be based only on the area in excess of 750 square feet of interior livable space. By changing the duties of local agencies with regard to calculating fees for ADUs, the bill would impose a state-mandated local program.\n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-17", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}, {"description": "From printer. May be acted upon on or after March 20.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"upper\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Cervantes", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Cervantes\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1117", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1117", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/17/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1117&version=20250SB111799INT", "media_type": "application/pdf"}], "date": "2026-02-17", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1117", "note": ""}], "extras": {"impact_clause": "An act to amend Section 66311.5 of the Government Code, relating to land use.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:43:56+00:00", "_id": "7551721e-0f01-11f1-bd68-62084ebb1ff2"}