{"legislative_session": "20252026", "identifier": "AB2201", "title": "Medi-Cal: eligibility redetermination.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Medi-Cal", "eligibilityredetermination"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Medi-Cal program, which is administered by the State Department of Health Care Services and under which qualified low-income individuals receive health care services. The Medi-Cal program is in part governed by, and funded pursuant to, federal Medicaid program provisions.\n\nExisting federal law, enacted on July 4, 2025, sets forth various changes to Medicaid eligibility with regard to community engagement reporting, redeterminations, retroactive coverage, and cost sharing, among other factors, for certain Medicaid populations. For purposes of eligibility redeterminations, existing federal law requires that certain beneficiaries between 19 and 64 years of age, inclusive, with income up to 138% of the federal poverty level, commonly known as Medicaid expansion adults, undergo a redetermination once every 6 months, instead of an annual redetermination, except as specified.\n\nExisting state law generally requires a county to perform eligibility redeterminations for Medi-Cal beneficiaries every 12 months and to promptly redetermine eligibility whenever the county receives information about changes in a beneficiary's circumstances, as specified.\n\nThis bill would make changes to those redetermination provisions to conform to the 6-month redetermination requirement under the above-described federal law for Medicaid expansion adults. The bill would make other conforming changes to related provisions.\n\nExisting law, for purposes of acquiring information necessary to conduct eligibility redeterminations, requires a county to gather information available to the county that is relevant to the beneficiary's Medi-Cal eligibility before contacting the beneficiary.\n\nThis bill would require the county, in the case of an annual or semiannual redetermination, to verify countable income and assets at renewal without requesting additional verification information or documentation if any of specified sets of conditions are met, relating to certain financial data sources.\n\nBy creating new duties for counties relating to Medi-Cal eligibility determinations or redeterminations, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Boerner", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Boerner\"}", "organization_id": null}, {"name": "Bonta", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Bonta\"}", "organization_id": null}, {"name": "Stefani", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Stefani\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2201", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2201", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2201&version=20250AB220199INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2201", "note": ""}], "extras": {"impact_clause": "An act to amend Section 14005.37 of the Welfare and Institutions Code, relating to Medi-Cal.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-21T08:45:14+00:00", "_id": "a3cb56b4-0f01-11f1-bd68-62084ebb1ff2"}