{"legislative_session": "20252026", "identifier": "SB1416", "title": "Physicians and surgeons: dentists: unprofessional conduct.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Physiciansandsurgeons", "dentists", "unprofessionalconduct"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes various healing arts boards within the Department of Consumer Affairs, including the Medical Board of California and the Dental Board of California, that license and regulate various healing arts licensees. Existing law, including the Medical Practice Act and the Dental Practice Act, deem certain violations by licensees to be unprofessional conduct subject to discipline by the licensee's licensing board.\n\nExisting law requires a physician and surgeon or dentist to refund to a patient any amount paid by the patient for services rendered that was subsequently paid to the physician and surgeon or dentist by a third-party payor and that constitutes a duplicate payment, as prescribed. Existing law requires that the above-described duplicate payment refund be paid, if requested by the patient, either within 30 days of that request or, if the duplicate payment has not been received, within 30 days of receipt of the duplicate payment by the physician and surgeon or dentist. Existing law requires, if the patient does not request a refund, a physician and surgeon or dentist who knows, or should have known, of the receipt of the duplicate payment to notify the patient, as prescribed, and to refund the payment within 30 days of that notification, except as specified. Existing law makes a violation of the above requirements unprofessional conduct subject to disciplinary proceedings as described above.\n\nThis bill would reduce the duration for a physician and surgeon or dentist to refund a duplicate payment following patient request or patient notification to 21 days."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Wahab", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Wahab\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1416", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1416", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1416&version=20250SB141699INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1416", "note": ""}], "extras": {"impact_clause": "An act to amend Section 732 of the Business and Professions Code, relating to healing arts.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:06+00:00", "_id": "ed86ac6c-0fca-11f1-9ce2-72e66fa16e68"}