{"legislative_session": "20252026", "identifier": "AB2262", "title": "Criminal procedure: discrimination.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Criminalprocedure", "discrimination"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes procedures for a judge to disqualify themselves from a case. Under existing law, if a judge who should disqualify themselves refuses or fails to do so, a party may file with the clerk a written verified statement objecting to the hearing or trial before the judge and setting forth the facts constituting grounds for disqualification of the judge. Existing law requires copies of the statement to be served on each party and personally served on the judge alleged to be disqualified or on their clerk, provided that the judge is present in the courthouse or in chambers.\n\nThis bill would require the statement to be served during regular business hours on the judge alleged to be disqualified at the courthouse in which the judge is sitting. The bill would, in addition to the clerk, permit service of the statement on the court executive officer, provided that the judge is present in the courthouse or in chambers.\n\nExisting law prohibits the state from seeking, obtaining, or imposing a criminal conviction or sentence on the basis of race, ethnicity, or national origin. Under existing law, a defendant may pursue relief for a violation of this prohibition by filing a motion pursuant to the provisions that prohibit this conduct, a petition for a writ of habeas corpus, or a motion to vacate a conviction or sentence.\n\nThe bill would authorize a judge to admit or deny the allegations in a defendant's motion showing that the judge exhibited bias or animus towards the defendant because of the defendant's race, ethnicity, or national origin in a written answer that sets forth any additional material or relevant facts. The bill would authorize a trial judge, if a motion is made during a trial and is based in whole or in part on the conduct of or statements made by the trial judge, to stay or proceed with the trial until a hearing is held, as specified. The bill would require the motions that are made after a verdict is entered and prior to sentencing to be made before the judge issues a tentative sentence."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 22.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Michelle Rodriguez", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Michelle Rodriguez\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2262", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2262", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2262&version=20250AB226299INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2262", "note": ""}], "extras": {"impact_clause": "An act to amend Section 170.3 of the Code of Civil Procedure, and to amend Section 745 of the Penal Code, relating to criminal procedure.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:33+00:00", "_id": "2109c466-0fcb-11f1-9ce2-72e66fa16e68"}