{"legislative_session": "20252026", "identifier": "SB1180", "title": "Plastic Pollution Prevention and Packaging Producer Responsibility Act: California Plastic Pollution Mitigation Fund.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["CaliforniaPlasticPollutionMitigationFund", "PlasticPollutionPreventionandPackagingProducerResponsibilityAct"], "abstracts": [{"note": "summary", "abstract": "Existing law, the Plastic Pollution Prevention and Packaging Producer Responsibility Act (act) , regulates certain single-use packaging and plastic single-use food service ware, as provided. As part of its comprehensive statutory scheme, the act requires producers of covered materials to reduce and recycle covered plastic material and to ensure that covered materials that are offered for sale, distributed, or imported in or into the state on or after January 1, 2032, are recyclable or compostable, as provided.\n\nThe act establishes, until January 1, 2037, the California Plastic Pollution Mitigation Fund, which consists of all environmental mitigation surcharges, interest, penalties, and other amounts collected pursuant to the act, as provided. The act requires, upon appropriation by the Legislature, that 60% of the moneys in the fund be expended to monitor and reduce the historical and current environmental justice and public health impacts of plastics, and that 40% of the moneys in the fund be expended to monitor and reduce the environmental impacts of plastics on terrestrial, aquatic, and marine life and human health.\n\nThis bill would, among other things, require each expenditure made upon appropriation from the fund to achieve one or more of specified purposes, including, among others, catalyzing mitigation of the adverse health impacts of plastics and creating or accelerating a transformative shift away from plastic production, use, and tendency to be disposed of after limited use. The bill would require each of those expenditures to comply with specified requirements, including, among others, prioritizing programs and projects that benefit communities most burdened by the impacts of plastic pollution and that provide multiple benefits. The bill would require each department, agency, or entity implementing a grant program funded by the fund to take specified actions, such as providing technical assistance and using a single standardized, simplified application across all of those entities. The bill would require reimbursement of a grantee's or subgrantee's indirect costs by applying one of four enumerated rates. The bill would authorize moneys from the fund to be expended on implementing the bill and would prohibit moneys from the fund from being expended on specified purposes.\n\nThe bill would require the Secretary for Environmental Protection to annually publish a list of all program and project expenditures made pursuant to the fund, as specified."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. Read first time. To Com. on RLS. for assignment. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "reading-1"], "related_entities": []}], "sponsorships": [{"name": "Allen", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Allen\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1180", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1180", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1180&version=20250SB118099INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1180", "note": ""}], "extras": {"impact_clause": "An act to add Sections 42040.5 and 42064.5 to the Public Resources Code, relating to solid waste.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-19T08:59:51+00:00", "_id": "5a04b426-0d71-11f1-814c-2ab210762532"}