{"legislative_session": "20252026", "identifier": "AB2418", "title": "Local building permits: nonresidential private permitting review.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Localbuildingpermits", "nonresidentialprivatepermittingreview"], "abstracts": [{"note": "summary", "abstract": "Existing law requires every city, county, or city and county, whether general law or chartered, that requires the issuance of a permit as a condition precedent to the construction, alteration, improvement, demolition, or repair of any building or structure, to require the execution of a permit application, as specified.\n\nExisting law permits a local agency, defined as a city, county, or city and county, to authorize its enforcement agency to contract with or employ a private entity or persons on a temporary basis to perform plan-checking functions for a nonresidential building, but that the local agency is not required to do so if it determines that no entities or persons are available or qualified to perform plan-checking services. Under existing law, when there is an excessive delay, as defined, in checking plans submitted as part of an application for specified nonresidential projects, a local agency is required to, upon request of the applicant, contract with or employ a private entity or persons on a temporary basis to perform the plan-checking function. Existing law defines \"excessive delay\" to mean, among other things, the local agency has taken more than 50 days to check plans and specifications, as provided.\n\nThis bill would, until January 1, 2037, revise and recast the above-described provisions related to private plan checking. The bill would, upon an application for a nonresidential building permit being deemed complete, as provided, require the local agency to provide the applicant with an estimated timeframe in which it will determine if the completed application is compliant with permit standards.\n\nThis bill would require the local agency to, upon an applicant's request, contract with or employ a private plan-checking entity if the estimated timeframe would result in an excessive delay or if there is excessive delay by the local agency. If the local agency determines no private entities or persons are available or qualified to perform plan-checking services, the bill would authorize the applicant to retain, at their sole expense, a private professional provider, as defined and specified. The bill would shorten the timeframe constituting an \"excessive delay\" from 50 days to 30 days.\n\nThis bill would, until January 1, 2037, require an applicant who retains a private professional provider to notify the city or county of their intent to retain the private professional provider within a prescribed timeframe. If a private professional provider performs the plan-checking function, the bill would impose additional requirements, including, among other things, requiring the private professional provider to prepare a specified affidavit, under penalty of perjury, and the applicant to submit to the city or county a specified report of the plan check.\n\nThis bill would require the city or county, within 10 business days of receiving the report, to consider the report and, based on the report, either issue the residential building permit or notify the applicant that the plans and specifications do not comply, as specified. If the city or county notifies the applicant that the plans and specifications do not comply, the bill would authorize the applicant to resubmit corrected plans and specifications to the city or county, as specified. The bill would provide that its provisions do not apply to certain nonresidential buildings, as specified.\n\nExisting law, the Permit Streamlining Act, requires each public agency to provide a development project applicant with a list that specifies the information that will be required from any applicant for a development project. Existing law requires a public agency that has received an application for a development project to determine in writing whether the application is complete within 30 calendar days and to immediately transmit the determination to the applicant of the development project.\n\nThis bill, until January 1, 2037, if a private professional provider performs the plan-checking function, would deem the local agency to be in compliance with the above-described streamlining provisions governing applications for nonresidential development projects as those requirements pertain to the nonresidential building permit.\n\nExisting law, the Government Claims Act, establishes the liability and immunity of a public entity for its acts or omissions that cause harm to persons. Where a public entity is under a mandatory duty imposed by an enactment that is designed to protect against the risk of a particular kind of injury, existing law imposes liability upon the public entity for an injury of that kind proximately caused by its failure to discharge the duty unless the public entity establishes that it exercised reasonable diligence to discharge the duty.\n\nThis bill would, until January 1, 2037, notwithstanding existing public entity liability provisions, grant a public entity immunity from liability for an injury caused by their discretionary or ministerial acts or omissions relating to the issuance or denial of any nonresidential building permit pursuant to the bill's provisions. The bill would require the applicant to indemnify the local agency from any property damage or personal injury arising from construction in accordance with the plans checked by a private professional provider under the bill's provisions.\n\nExisting law permits the governing body of any county or city, including a charter city, to adopt an ordinance prescribing fees for filing applications for specified building permits, as provided.\n\nThis bill would broaden the above-described permission and require a county or city that prescribes fees for a nonresidential building permit to prepare a nonresidential building permit fee schedule and post the schedule on the county's or city's internet website.\n\nThis bill would additionally require a local building department to conduct an inspection of the permitted work for specified new nonresidential buildings or structures within 10 business days of receiving a notice of the completion of the permitted work authorized by a building permit issued for those projects.\n\nBy expanding the crime of perjury, and by imposing new duties on local agencies, the bill would impose a state-mandated local program.\n\nThe bill would include related findings and declarations.\n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for specified reasons."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Mark González", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Mark Gonz\\u00e1lez\"}", "organization_id": null}, {"name": "Nguyen", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Nguyen\"}", "organization_id": null}, {"name": "Blanca Rubio", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Blanca Rubio\"}", "organization_id": null}, {"name": "Wicks", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Wicks\"}", "organization_id": null}, {"name": "Zbur", "classification": "coauthor", "entity_type": "person", "primary": false, "person_id": "~{\"name\": \"Zbur\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2418", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2418", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2418&version=20250AB241899INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2418", "note": ""}], "extras": {"impact_clause": "An act to amend, repeal, and add Section 19837 of, and to add Sections 19838 and 19839 to, the Health and Safety Code, relating to building permits.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:36+00:00", "_id": "2348b5c0-0fcb-11f1-9ce2-72e66fa16e68"}