{"legislative_session": "20252026", "identifier": "AB2601", "title": "Planning and zoning: housing development: streamlined approval and subdivisions.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Planningandzoning", "housingdevelopment", "streamlinedapprovalandsubdivisions"], "abstracts": [{"note": "summary", "abstract": "Under the Planning and Zoning Law, the legislative body of a city or county may adopt ordinances that, among other things, regulate the use of buildings, structures, and land, as provided. The Subdivision Map Act vests the authority to regulate and control the design and improvement of subdivisions in the legislative body of a local agency and sets forth procedures governing the local agency's processing, approval, conditional approval or disapproval, and filing of tentative, final, and parcel maps.\n\nExisting law requires a local agency to consider ministerially a proposed housing development containing no more than 2 residential units within a single-family residential zone, without discretionary review or a hearing, if the proposed housing development meets specified requirements. Existing law requires a local agency to ministerially approve a parcel map for an urban lot split if the parcel meets specified requirements.\n\nThis bill would require that an application for a proposed housing development containing no more than 2 residential units within a single-family residential zone, as described above, be eligible for concurrent processing with an application for a parcel map for an urban lot split, as provided. The bill would authorize a local agency to condition issuance of building permits, grading permits, or certificates of occupancy for a proposed housing development upon the applicant first obtaining approval and recording a parcel map for eligible parcels pursuant to the above-described urban lot split provisions. The bill would allow the primary dwellings in an urban lot split under these provisions to be developed or converted to condominiums upon request of the applicant, as specified, or, if the housing development includes an existing unit, allow the applicant to request a condominium conversion for that unit pursuant to state and local law. The bill would specify that a \"parcel map\" for purposes of these provisions means a parcel map prepared in accordance with specified provisions of the Subdivision Map Act and may include a condominium plan if proposed by the subdivider, as specified.\n\nExisting law authorizes a development proponent to submit an application for a housing development project on a subdivided lot, as specified, that meets specified requirements, and requires a local agency to ministerially consider that application, as specified. Existing law requires a local agency to issue a building permit for one or more residential units on a lot proposed to be subdivided, as specified, if the applicant for the permit meets prescribed requirements. Existing law requires a local agency to ministerially consider, without discretionary review or a hearing, a parcel map or a tentative and final map for a housing development project that meets specified requirements, including that the proposed subdivision will result in 10 or fewer parcels and the housing development project on the lot proposed to be subdivided will contain 10 or fewer residential units, except as provided.\n\nThis bill would require an application for a housing development project on a subdivided lot or an application for a building permit for one or more residential units on a lot proposed to be subdivided, as described above, to be eligible for concurrent processing with an application for a parcel map or a tentative and final map under the above-described subdivision provisions, as provided. The bill would authorize a local agency to condition issuance of building permits, grading permits, or certificates of occupancy for a proposed housing development under these provisions upon the applicant first obtaining approval and recording a parcel map for eligible parcels pursuant to the above-described subdivision provisions.\n\nExisting law generally requires any person who intends to offer subdivided lands within this state for sale or lease to file with the Department of Real Estate an application for a public report consisting of a notice of intention and a completed questionnaire on a form prepared by the department. Existing law requires the Real Estate Commissioner to make an examination of any subdivision and, unless there are grounds for denial, issue the subdivider a public report authorizing the sale or lease in this state of the lots or parcels within the subdivision, as provided.\n\nThis bill would exempt an urban lot split or a parcel map or a tentative and final map for a housing development project under the above-described provisions from the requirement to obtain a public report from the Department of Real Estate pursuant to the above-described provisions, provided that the development otherwise complies with applicable state and local health and safety standards."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Lee", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Lee\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2601", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2601", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2601&version=20250AB260199INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2601", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 65852.21, 65852.28, 65913.4.5, 66411.7, and 66499.41 of the Government Code, relating to land use.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:41+00:00", "_id": "2610a61e-0fcb-11f1-9ce2-72e66fa16e68"}