{"legislative_session": "20252026", "identifier": "AB2089", "title": "Property taxation: welfare tax exemption: delinquent payments: interest and penalties.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Propertytaxation", "delinquentpayments", "interestandpenalties", "welfaretaxexemption"], "abstracts": [{"note": "summary", "abstract": "Except as provided, the California Constitution requires that all property be taxed in proportion to its full value and assessed at the same percentage of fair market value. The tax imposed pursuant to these provisions is commonly referred to as an ad valorem property tax. Existing property tax law, in accordance with the California Constitution, provides for a \"welfare exemption\" for property used exclusively for religious, hospital, scientific, or charitable purposes and that is owned or operated by certain types of nonprofit entities, if certain qualifying criteria are met. Under existing property tax law, property that meets these requirements that is used exclusively for rental housing and related facilities is entitled to a partial exemption, equal to that percentage of the value of the property that is equal to the percentage that the number of units serving lower income households represents of the total number of residential units, in any year that any of certain criteria apply.\n\nExisting law imposes various penalties and costs for delinquent payment of real property taxes. Existing law provides that a property owner is not liable for interest or penalties, and prohibits the tax collector from taking or continuing any collection action, with respect to ad valorem property taxes levied upon a property if, annually while receiving the benefit, the facilities are in the course of construction, as defined, and the property owner supplies evidence to the tax collector that the property owner has submitted to the county assessor an application for an exemption pursuant to the above-described partial welfare exemption, except as provided, and that the property received a specified reservation of tax credits or award of funds. Existing law makes this benefit applicable to property tax installments that are due and payable from December 10, 2025, to April 10, 2031.\n\nThis bill would extend the benefit described above indefinitely. The bill would also extend the benefit to those properties that provide evidence that the property received a welfare tax exemption but lost the exemption due to a change in control, change in ownership, or removal, resignation, or replacement of a nonprofit managing general partner, as those terms are defined, and that the benefit is necessary to continue maintaining the welfare exemption on the property, in lieu of providing evidence that facilities are in the course of construction. The bill would make this extended benefit applicable to property tax installments that are due and payable from December 10, 2027. By imposing additional duties on local tax officials, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ward", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ward\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2089", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2089", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2089&version=20250AB208999INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2089", "note": ""}], "extras": {"impact_clause": "An act to amend Section 4985.05 of the Revenue and Taxation Code, relating to taxation.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:58+00:00", "_id": "409fbd68-0e3a-11f1-a618-2a6200350f1a"}