{"legislative_session": "20252026", "identifier": "AB2313", "title": "Gas corporations: gas distribution service line replacements: alternatives.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Gascorporations", "alternatives", "gasdistributionservicelinereplacements"], "abstracts": [{"note": "summary", "abstract": "Existing law vests the Public Utilities Commission with regulatory authority over public utilities, including gas corporations. Existing law requires, until January 1, 2031, gas corporations to submit to the commission an annual map that includes, among other things, the location of all potential gas distribution line replacement projects identified in its distribution integrity management plan and any foreseeable gas distribution pipeline replacements.\n\nThis bill, the Home Energy Choice Act, would require the commission, in a new or existing proceeding, to require each gas corporation to offer a Gas Distribution Service Line Replacement Alternatives Program, on or before January 1, 2028, to provide gas customers served by a gas distribution service line, planned or forecasted for replacement over the next 5 years, or prioritized for replacement by the commission, with a monetary incentive to deploy gas distribution service line replacement alternatives, as defined, and cease gas service to avoid the gas distribution service line replacement, as specified.\n\nUnder existing law, a violation of any order, decision, rule, direction, demand, or requirement of the commission is a crime.\n\nBecause a violation of a commission action implementing the bill's requirements would be a crime, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Berman", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Berman\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2313", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2313", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/19/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2313&version=20250AB231399INT", "media_type": "application/pdf"}], "date": "2026-02-19", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2313", "note": ""}], "extras": {"impact_clause": "An act to add Section 785.3 to the Public Utilities Code, relating to energy.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:58:01+00:00", "_id": "42f07d46-0e3a-11f1-a618-2a6200350f1a"}