{"legislative_session": "20252026", "identifier": "AB1902", "title": "Secure youth treatment facilities.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Secureyouthtreatmentfacilities"], "abstracts": [{"note": "summary", "abstract": "Existing law requires a probation department to request that the prosecuting attorney petition the committing court for an order directing that a person confined in a secure youth treatment facility remain subject to the control of the department at the time of discharge if the person confined is determined to be physically dangerous to the public because of the person's mental or physical condition, disorder, or other problem that causes the person to have serious difficulty controlling their dangerous behavior. Existing law establishes the process for the petition, probable cause hearing, trial, continued detention, and appeal pursuant to this provision. Under existing law, if an order for continued detention is made pursuant to these provisions, the probation department has continued control over the person, except as specified, and existing law requires the department to, within 2 years after the date of the order made by a juvenile court or after conviction in criminal proceedings, file a new application for continued detention if continued detention is deemed necessary.\n\nThis bill would require, if a petition is filed pursuant to these provisions, that the person who is the subject of the petition remain in custody in a secure youth treatment facility until the conclusion of the proceedings. The bill would prohibit a probable cause hearing pursuant to these provisions from being continued, except upon a showing of good cause by the party requesting the continuance. The bill would also authorize the court to base the finding of probable cause on certain hearsay statements, as specified. The bill would require the person be brought to trial within 60 days from the probable cause determination, unless good cause to the contrary is shown, the person enters a waiver, or the person requests or consents to the setting of the trial date beyond the 60-day period. The bill would require the department to file a new application within 10 years after the date of an order for continued detention if the department deems continued detention pursuant to these provisions is necessary. The bill would specify that the discovery process for criminal proceedings applies to these provisions.\n\nThis bill would authorize a prosecuting agency to request the Director of the Office of Youth and Community Restoration review any case in which the probation department has not requested a petition pursuant to the above-described provisions when the prosecuting agency believes that a person confined in the secure youth treatment facility would be physically dangerous to the public because of the person's mental or physical deficiency, disorder, or abnormality that causes the person to have serious difficulty controlling their dangerous behavior. The bill would require, upon the prosecuting agency's request, that a mental health professional designated by the director review the case and either affirm the decision of the probation department not to seek extended detention, order an additional assessment of the person, or request the prosecuting attorney petition the committing court for extended detention. The bill would require the prosecuting agency, director, and designated mental health professional to have access to a copy of the person's file and would specify the process for completing the request for review pursuant to these provisions. By requiring local probation departments to provide access to the ward's records for the purposes of these provisions, this bill would impose a state-mandated local program. \n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-12", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 15.", "date": "2026-02-13", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Pellerin", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Pellerin\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1902", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1902", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/12/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1902&version=20250AB190299INT", "media_type": "application/pdf"}], "date": "2026-02-12", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1902", "note": ""}], "extras": {"impact_clause": "An act to amend Section 876 of, and to add Section 876.5 to, the Welfare and Institutions Code, relating to juveniles.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:55+00:00", "_id": "3edaeaf2-0e3a-11f1-a618-2a6200350f1a"}