{"legislative_session": "20252026", "identifier": "AB2158", "title": "Pupil instruction: outdoor learning.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Pupilinstruction", "outdoorlearning"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes a system of public elementary and secondary education in this state. Under this system, local educational agencies throughout the state provide instruction to pupils in kindergarten and grades 1 to 12, inclusive, and existing law establishes courses of study for those pupils.\n\nThis bill would encourage school districts, county offices of education, and charter schools to integrate outdoor learning into standards-aligned instruction across subject areas, as provided. The bill would authorize local educational agencies to describe in their local control and accountability plans or other relevant planning documents how outdoor learning will be used to support pupil engagement, environmental literacy, climate resilience, and academic achievement of pupils from historically underserved communities.\n\nExisting law establishes the State Department of Education under the administration of the Superintendent of Public Instruction, and assigns the department numerous duties relating to the governance and funding of local educational agencies.\n\nThis bill would require the Superintendent, on or before July 1, 2028, to arrange to develop and publish statewide guidance on outdoor learning. The bill would also require the Superintendent, in developing this guidance, to consult with county offices of education, classroom educators, tribal partners, environmental literacy experts, and community organizations with experience in outdoor learning. The bill would authorize the Superintendent, subject to an appropriation, to provide professional learning resources to support educators in delivering high-quality outdoor learning. \n\nThis bill would establish the Statewide Outdoor Learning Pilot Program for a period of 3 years following an appropriation of funds for this purpose to, among other things, demonstrate the effectiveness of outdoor learning in improving pupil outcomes, and build statewide evidence to inform future legislative and budgetary decisions. The bill would require the Superintendent to, as part of this pilot program, award grants to six pilot sites with representation from northern, southern, and central California. The bill would authorize the Superintendent to contract with a nonprofit organization with demonstrated expertise in environmental literacy, as defined, and outdoor learning to serve as the intermediary coordinator to, among other things, develop grant award selection criteria and to consult with the Superintendent on selecting grantees. The bill would make the pilot program subject to an appropriation by the Legislature."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Hoover", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Hoover\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2158", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2158", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2158&version=20250AB215899INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2158", "note": ""}], "extras": {"impact_clause": "An act to add Article 9.5 (commencing with Section 51805) to Chapter 5 of Part 28 of Division 4 of Title 2 of, and to repeal Section 51805.8 of, the Education Code, relating to pupil instruction.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-20T08:57:59+00:00", "_id": "4148df60-0e3a-11f1-a618-2a6200350f1a"}