{"legislative_session": "20252026", "identifier": "AB2018", "title": "Missing persons: DNA testing.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["DNAtesting", "Missingpersons"], "abstracts": [{"note": "summary", "abstract": "Existing law requires the Department of Justice to develop a DNA database for all cases involving the report of an unidentified deceased person or a high-risk missing person and provides for the collection of DNA samples from unidentified deceased persons and from potential sources for comparison, as specified. Existing law requires that the database be funded by a $2 increase on death certificates issued by a local government agency or by the State of California. Existing law specifies the procedure for identifying the backlog of unidentified remains. Under existing law, all samples and DNA extracted from a living person are required to be destroyed after a positive identification is made and a report is issued, except as specified. \n\nThis bill would require the DNA database be used for all cases involving the report of an unidentified person, whether living or deceased. The bill would authorize the department to utilize other scientifically valid DNA testing methods and comparison procedures for the purpose of identifying an unidentified person or locating a high-risk missing person. The bill would require the department to take all reasonable steps to ensure that the genetic data be used and disclosed only in a manner consistent with, and designed to advance, the purposes of identifying an unidentified person or locating a high-risk missing person. The bill would additionally authorize the retention of DNA extracted from a living person under these provisions if the identified human remains are incomplete and there is a reasonable expectation that additional remains requiring identification may be found in the future. The bill would also make conforming changes."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-17", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 20.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Ramos", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Ramos\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2018", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2018", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/17/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2018&version=20250AB201899INT", "media_type": "application/pdf"}], "date": "2026-02-17", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2018", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 14250 and 14251 of the Penal Code, relating to missing persons.", "tags": ["fiscal committee"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:27+00:00", "_id": "1da2e0d2-0fcb-11f1-9ce2-72e66fa16e68"}