{"legislative_session": "20252026", "identifier": "AB1784", "title": "Postsecondary education: nondiscrimination: pregnancy or pregnancy-related issues.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["Postsecondaryeducation", "nondiscrimination", "pregnancyorpregnancy-relatedissues"], "abstracts": [{"note": "summary", "abstract": "(1) The Equity in Higher Education Act states the policy of the state to afford all persons, regardless of their disability, gender, gender identity, gender expression, nationality, race or ethnicity, religion, sexual orientation, or any other specified characteristic, equal rights and opportunities in postsecondary educational institutions of the state. For purposes of the act, existing law defines \"gender\" as sex, including a person's gender identity and gender-related appearance and behavior, whether or not stereotypically associated with the person's assigned sex at birth.\n\nThis bill would explicitly add ancestry, national origin, medical condition, marital status, familial status, citizenship, and primary language to the list of specified characteristics for purposes of that policy. The bill would also expand the definition of \"gender\" for purposes of the act to include pregnancy, childbirth, or medical conditions related to pregnancy.\n\n(2) The Equity in Higher Education Act prohibits a postsecondary educational institution from requiring a graduate student to take a leave of absence, withdraw from the graduate program, or limit their graduate studies solely due to pregnancy or pregnancy-related issues. The act requires a postsecondary educational institution to reasonably accommodate pregnant graduate students, as specified, so that they may complete their graduate courses of study and research, including by allowing graduate students to take a leave of absence, as specified.\n\nThis bill would prohibit a postsecondary educational institution from discriminating against a student or applicant based on the student's current, potential, or past pregnancy or pregnancy-related conditions, including by prohibiting the institution from requiring a student to take a leave of absence or withdraw from an educational or extracurricular program or activity, and prohibiting the institution from limiting the student's undergraduate or graduate program. The bill would require a postsecondary educational institution to provide reasonable accommodations to an institutional program for a student, including an undergraduate student, experiencing pregnancy or a pregnancy-related condition to ensure the student's equal access to the institution's educational programs and activities, as provided.\n\nThis bill would require a postsecondary educational institution to designate at least one employee to coordinate its efforts to comply with and fulfill its responsibilities under these provisions, as specified, and require certain employees, upon being directly informed by a student of the student's pregnancy or pregnancy-related condition, to inform the student of their right to receive accommodations to maintain access to the educational program and provide the student with the contact information for the designated employee or employees.\n\n(3) The Equity in Higher Education Act allows a graduate student who is pregnant or has recently given birth to take a leave of absence for a period consistent with the policies of the postsecondary educational institution, or a period of 12 months, whichever is longer, and have an extension of at least 12 months toward normative time to degree while in candidacy for a graduate degree, unless a longer extension is medically necessary, as specified. The act also allows a graduate student who is not the birth parent to take a leave of absence for a period consistent with the policies of the postsecondary educational institution, or a period of one month, whichever is longer, and have an extension of at least one month toward normative time to degree while in candidacy for a graduate degree, unless a longer extension is medically necessary to care for the student's partner or child, as specified.\n\nThis bill would also allow any undergraduate student who is pregnant or has recently given birth or who is not the birth parent to take the above-described leave of absence and have an extension toward normative time to degree, as specified.\n\n(4) The Equity in Higher Education Act requires a postsecondary educational institution to have a written policy for graduate students on pregnancy discrimination and procedures for addressing pregnancy discrimination complaints, as specified. Existing law requires a copy of the policy to be made available to all graduate students attending orientation sessions at a postsecondary educational institution. Existing law requires a public postsecondary institution to post on the institution's internet website, and to provide through on-campus medical centers, notice of protections provided under Title IX, as specified.\n\nThis bill would require a postsecondary educational institution to revise that policy to include undergraduate students, and require a copy of the revised policy to be made available to all students attending orientation sessions. The bill would also require a public postsecondary educational institution to post on the institution's internet website, and provide through on-campus medical centers, notice of the protections provided by these provisions.\n\n(5) By imposing additional duties on community college districts, the bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that, if the Commission on State Mandates determines that the bill contains costs mandated by the state, reimbursement for those costs shall be made pursuant to the statutory provisions noted above."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-09", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 12.", "date": "2026-02-10", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Pellerin", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Pellerin\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB1784", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1784", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/09/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB1784&version=20250AB178499INT", "media_type": "application/pdf"}], "date": "2026-02-09", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB1784", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 66251, 66260.7, and 66281.7 of the Education Code, relating to postsecondary education.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-12T09:00:58+00:00", "_id": "58ae902c-07f1-11f1-8856-36e757393db5"}