{"legislative_session": "20252026", "identifier": "SB1271", "title": "Health and care facilities: health care decisions.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": ["Healthandcarefacilities", "healthcaredecisions"], "abstracts": [{"note": "summary", "abstract": "Existing law establishes the Long-Term Care Patient Representative Program and the Office of the Long-Term Care Patient Representative in the California Department of Aging to train, certify, provide, and oversee patient representatives to protect the rights of nursing home residents, as specified.\n\nExisting law requires that if the attending physician and surgeon of a resident in a skilled nursing facility or intermediate care facility prescribes or orders a medical intervention that requires that informed consent be obtained prior to administration of the medical intervention, but is unable to obtain informed consent because the physician and surgeon determines that the resident lacks capacity to provide informed consent, the physician and surgeon is required to document the determination that the resident lacks capacity and the basis for that determination in the resident's medical record. Existing law also requires the physician and surgeon to inform the skilled nursing facility or intermediate care facility of that determination.\n\nUpon being notified by the attending physician of a determination that a resident lacks capacity to provide informed consent, existing law requires the skilled nursing facility or intermediate care facility to act promptly and identify, or use due diligence to search for, a legal decisionmaker, as defined. If no legal decisionmaker can be identified or located, existing law requires the facility to take further steps to promptly identify, or use due diligence to search for, a patient representative to participate in an interdisciplinary team review, as specified. Existing law requires the Long-Term Care Patient Representative Program to assign a public patient representative if no family member or friend is available to serve in that capacity and specified notice has been provided. Existing law prohibits an interdisciplinary team review from occurring until a patient representative is available to participate and specified notice has been provided. If the Long-Term Care Patient Representative Program is not operational, existing law requires that all notices otherwise required to be provided to the Long-Term Care Patient Representative Program pursuant to these provisions be provided to the local long-term care ombudsman or any other person or entity as may be permitted by law.\n\nThis bill would make technical, nonsubstantive changes to this provision."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Introduced. To Com. on RLS. for assignment. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction"], "related_entities": []}], "sponsorships": [{"name": "Reyes", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Reyes\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "SB1271", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1271", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260SB1271&version=20250SB127199INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260SB1271", "note": ""}], "extras": {"impact_clause": "An act to amend Section 1418.8 of the Health and Safety Code, relating to health and care facilities.", "tags": []}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:46:04+00:00", "_id": "ec0fb720-0fca-11f1-9ce2-72e66fa16e68"}