{"legislative_session": "20252026", "identifier": "AB2118", "title": "Affordable Housing and High Road Jobs Act of 2022: use by right: objective standards.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["AffordableHousingandHighRoadJobsActof2022", "objectivestandards", "usebyright"], "abstracts": [{"note": "summary", "abstract": "The Affordable Housing and High Road Jobs Act of 2022, until January 1, 2033, authorizes a development proponent to submit an application for a mixed-income housing development along a commercial corridor that satisfies specified site criteria, affordability criteria, and objective development standards, and deems a housing development that meets those requirements a use by right and subject to streamlined, ministerial review. Existing law prohibits the objective standards from precluding a development from being built at specified residential density required and from requiring the development to reduce unit size to meet the objective standards.\n\nThis bill would also prohibit the objective standards from prohibiting or otherwise limiting mixed-use development in a housing development project. By changing the criteria local agencies must follow for the approval of certain development projects, the bill would impose a state-mandated local program.\n\nThe California Environmental Quality Act (CEQA) requires a lead agency, as defined, to prepare, or cause to be prepared, and certify the completion of an environmental impact report on a project that it proposes to carry out or approve that may have a significant effect on the environment or to adopt a negative declaration if it finds that the project will not have that effect. CEQA also requires a lead agency to prepare a mitigated negative declaration for a project that may have a significant effect on the environment if revisions in the project would avoid or mitigate that effect and there is no substantial evidence that the project, as revised, would have a significant effect on the environment.\n\nThe Affordable Housing and High Road Jobs Act of 2022 defines various terms for purposes of the act. The act defines \"use by right\" to means a development project that, among other things, any aspect of the development project, including permits required for the development project, is not a \"project\" for purposes of CEQA.\n\nThis bill would instead define \"use by right\" to mean a development project that, among other things, any aspect of the development project, including a state or local permit or approval required for the development project, is not a \"project\" for purposes of CEQA.\n\nThe bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-18", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}, {"description": "From printer. May be heard in committee March 21.", "date": "2026-02-19", "organization_id": "~{\"classification\": \"lower\"}", "classification": [], "related_entities": []}], "sponsorships": [{"name": "Hoover", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Hoover\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2118", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2118", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/18/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2118&version=20250AB211899INT", "media_type": "application/pdf"}], "date": "2026-02-18", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2118", "note": ""}], "extras": {"impact_clause": "An act to amend Sections 65912.101 and 65912.123 of the Government Code, relating to housing.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:29+00:00", "_id": "1efcca92-0fcb-11f1-9ce2-72e66fa16e68"}