{"legislative_session": "20252026", "identifier": "AB2676", "title": "Housing Crisis Act of 2019.", "from_organization": "~{\"classification\": \"lower\"}", "classification": ["bill"], "subject": ["HousingCrisisActof2019"], "abstracts": [{"note": "summary", "abstract": "(1) Existing law, known as the Housing Crisis Act of 2019, with respect to land where housing is an allowable use and except as specified, prohibits a county or city, including the electorate exercising its local initiative or referendum power, in which specified conditions exist, determined as provided by the Department of Housing and Community Development, from enacting a development policy, standard, or condition, as defined, that would have certain effects. Under existing law, these proscribed policies, standards, or conditions include, among others, (A) changing the land use designation or zoning of a parcel or parcels of property to a less intensive use or reducing the intensity of land use within an existing zoning district below what was allowed under the general plan or specific plan land use designation and zoning ordinances of the county or city as in effect on January 1, 2018, and (B) imposing or enforcing a moratorium on housing development within all or a portion of the jurisdiction of the county or city, except as provided. Existing law states that these prohibitions apply to any zoning ordinance adopted or amended on or after the effective date of these provisions, and that any development policy, standard, or condition on or after that date that does not comply is deemed void.\n\nExisting law prohibits a county or city subject to these provisions from enforcing a zoning ordinance imposing a moratorium or other similar restriction on or limitation of housing development until it has submitted the ordinance to, and received approval from, the Department of Housing and Community Development. Existing law requires the department to approve a zoning ordinance submitted to it only if the department determines that the zoning ordinance satisfies these requirements. If the department denies approval of the zoning ordinance, as specified, existing law states that the ordinance is deemed void.\n\nThis bill would expand the prohibition against enacting a development policy, standard, or condition that has the effect of imposing or enforcing a moratorium on housing development within all or a portion of the jurisdiction of the county or city to also prohibit these policies, standards, or conditions within the sphere of influence of a city, as defined. The bill would define \"moratorium or similar restriction or limitation on housing development\" for purposes of the Housing Crisis Act of 2019 to include, but not be limited to, the electorate of a county or city subject to these provisions from exercising its referendum power in a manner that has the effect of extending an existing moratorium or similar restriction or limitation on housing development. The bill would prohibit a county or city subject to these provisions from enforcing an initiative or referendum imposing a moratorium or other similar restriction on or limitation of housing development until the initiative or referendum receives approval from the department pursuant to the approval process described above. The bill would state that if the department denies approval of the initiative or referendum, as specified, the initiative or referendum would be deemed void. \n\nExisting law defines \"reducing the intensity of land use\" for purposes of the Housing Crisis Act of 2019 to include reductions to height, density, or floor area ratio, new or increased open space or lot size requirements, new or increased setback requirements, minimum frontage requirements, or maximum lot coverage limitations, or any other action that would individually or cumulatively reduce the site's residential development capacity.\n\nThis bill would revise the definition of \"reducing the intensity of land use\" to mean any action that would individually or cumulatively reduce the site's residential development capacity, including reductions to height, density, or floor area ratio, new or increased open space or lot size requirements, new or increased setback requirements, minimum frontage requirements, or maximum lot coverage limitations.\n\n This bill would also provide that an action or special proceeding brought to enforce these provisions is subject to a 3-year statute of limitations under specified law. The bill would provide that the bill's provisions apply retroactively to any pending action or proceeding.\n\n(2) The bill would include findings that changes proposed by this bill address a matter of statewide concern rather than a municipal affair and, therefore, apply to all cities, including charter cities.\n\n(3) By imposing new requirements and duties on local planning officials with respect to housing development, this bill would impose a state-mandated local program.\n\nThe California Constitution requires the state to reimburse local agencies and school districts for certain costs mandated by the state. Statutory provisions establish procedures for making that reimbursement.\n\nThis bill would provide that no reimbursement is required by this act for a specified reason."}], "other_titles": [], "other_identifiers": [], "actions": [{"description": "Read first time. To print.", "date": "2026-02-20", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["reading-1"], "related_entities": []}], "sponsorships": [{"name": "Gallagher", "classification": "author", "entity_type": "person", "primary": true, "person_id": "~{\"name\": \"Gallagher\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "AB2676", "links": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2676", "media_type": "text/html"}], "date": "", "classification": ""}, {"note": "02/20/26 - Introduced", "links": [{"url": "https://leginfo.legislature.ca.gov/faces/billPdf.xhtml?bill_id=202520260AB2676&version=20250AB267699INT", "media_type": "application/pdf"}], "date": "2026-02-20", "classification": ""}], "documents": [], "citations": [], "sources": [{"url": "http://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202520260AB2676", "note": ""}], "extras": {"impact_clause": "An act to amend Section 66300 of the Government Code, relating to land use.", "tags": ["fiscal committee", "local program"]}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:ca/government", "name": "California", "classification": "state", "division_id": "ocd-division/country:us/state:ca"}, "scraped_at": "2026-02-22T08:47:43+00:00", "_id": "2723651e-0fcb-11f1-9ce2-72e66fa16e68"}